{
  "items": [
    {
      "type": [
        "h-feed"
      ],
      "properties": {},
      "children": [
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "author": [
              {
                "type": [
                  "h-card"
                ],
                "properties": {
                  "photo": [
                    {
                      "value": "https://abisso.org/images/me/2021-10-06-ab582705.jpeg",
                      "alt": "Alessio Caiazza"
                    }
                  ],
                  "name": [
                    "Alessio Caiazza"
                  ],
                  "url": [
                    "https://abisso.org/"
                  ]
                },
                "value": "https://abisso.org/"
              }
            ],
            "name": [
              "IU5BON/IA5 - Isola d'Elba"
            ],
            "content": [
              {
                "html": "<p>In questo 2022 ho avuto la fortuna di passare due settimane all'isola d'Elba. Vacanze in relax con la famiglia ma ho avuto modo di fare un po’ di attività radio. </p> <p>L'Elba è un luogo fantastico, e anche radiantisticamente ha i suoi vantaggi: si tratta di una referenza IOTA EU-028, ha due enormi parchi POTA I-1115 e I-1049 ed entrambi sono referenze 2-fer in quanto fanno parte del parco I-0667.</p> <p>Il giorno di maggiore attività da parte mia è stato il primo Agosto, dove l'intera giornata è stata dedicata alle attività radio. </p> <h2>Fortezza del Volterraio - DRES-TO035</h2> <p>Partenza la mattina da Rio Marina, c'è una strada provinciale che passa sul Volterraio. Il percorso da fare a piedi parte da un parcheggio lungo la strada ed il sentiero sale ripido, sono tutti gradoni, per circa 20 minuti (la segnaletica CAI indica 40 minuti).</p> <p>Raggiunta la cima del Volterraio, su uno sperone di roccia si erige la fortezza del Volterraio, edificata su fortificazioni etrusche preesistenti dalla famiglia Appiani per proteggere la città di Portoferraio dalle invasioni dei mori.</p> <p><img src=\"https://abisso.org/stream/2022/08/01/iu5bon-ia5/volterraio-809e54ad.png\" alt=\"Fortezza\"></p> <p>Si tratta di una attivazione rapida e senza pretese. Opero esclusivamente con lo yaesu ft-5d con uno stilo di circa 40cm e successivamente anche con una slimjim autocostruita. </p> <p>Purtroppo non è stato possibile confrontare le due antenne in modo approfondito perché l'assenza di alberi ha reso impossibile issare la slimjim che è stata appesa ad una ringhiera del castello e tesa in orizzontale a circa un metro da terra. </p> <p>Faccio una manciata di QSO, prevalentemente locali. Ad esclusione di Roberto IK0BDO/5 le altre stazioni sono tutte Elbane o in traghetto verso l'isola.</p> <p><a href=\"https://www.mountainqrp.it/awards/showAttivazione.php?uid=dres_62e983d5386d4\">Log e mappa dei QSO su MQC</a></p> <h2>Volterraio - WxM-TO793</h2> <p><img src=\"https://abisso.org/stream/2022/08/01/iu5bon-ia5/volterraio-me-18d1ed92.png\" alt=\"Io davanti alla fortezza\"></p> <p>Sono già in cima al volterraio quindi decido di dedicate la parte finale della mia permanenza in vetta al Watt per Miglio. A sorpresa collego una stazione di Genova che aveva a disposizione anche il C4FM e facciamo tutte le prove del caso in 2m e 70cm sia FM che C4FM. </p> <p>La dove in FM ogni tanto si perdeva il segnale, in C4FM nessun problema di sorta, sia in modalità Narrow che Wide. Segnale perfetto, audio impeccabile.</p> <p>I miei amici IZ5PHM e IK5JRZ sono ormai attraccati a Portoferraio, è il momento di scendere e andare sul monte Capanne. </p> <p><a href=\"https://www.mountainqrp.it/awards/showAttivazione.php?uid=wxm_62ea6dfcd77c8\">Log e mappa dei QSO su MQC</a></p> <h2>Monte Capanne e Promontorio dell'Enfola - I-1049</h2> <p>Il parco dell'Arcipelago Toscano (I-0667) ha una superficie enorme ed è a sua volta suddiviso in sottoparchi. Per esempio il Volterraio si trova nel parco dell'Elba Orientale (I-1115) che fa parte del parco I-0667. Allo stesso modo il monte Capanne fa anche parte del suo sottoparco di nome Monte Capanne e Promontorio dell'Enfola (I-1049).</p> <p><img src=\"https://abisso.org/stream/2022/08/01/iu5bon-ia5/elba-956a4b4d.png\" alt=\"Elba\"></p> <p>Dopo essere sceso dal Volterraio mi dirigo verso la gabinovia di Marciana per salire sul monte Capanne. La vista è mozzafiato già dopo i primi minuti, giunti in vetta lo spettacolo è incredibile. Faccio un paio di chiamate in FM mentre monto la EFHW e comincio le attività in HF. Mi posiziono all'ombra di uno sperone di roccia laterale rispetto alla sommità del monte, circa 50m in linea d'aria dal punto più alto. La posizione ombreggiata agevola l'attivazione e riesco ad andare avanti per quasi 3h, pausa pranzo inclusa. </p> <p>Ora è il momento di attivare la sommità per il SOTA. </p> <p><a href=\"https://www.mountainqrp.it/awards/showAttivazione.php?uid=pota_62ea7b0c0a992\">Log e mappa dei QSO su MQC</a></p> <h2>Monte Capanne - SOTA I/TO-080</h2> <p><img src=\"https://abisso.org/stream/2022/08/01/iu5bon-ia5/sota-719f5efa.png\" alt=\"sota\"></p> <p>IZ5PHM mi ha portato una 4 elementi per i 2m gemella della mia rimasta a casa a Firenze, mentre aspetto alcuni pezzi dell'antenna comincio a chiamare in FM e collego immediatamente quattro stazioni, due delle quali anche in C4FM. Quando arriva la yagi l'attivazione è già assicurata dal numero di QSO ma monto ugualmente nella speranza di un DX in 2 m SSB. Purtroppo l'antenna non si comporta come dovrebbe e mostra a tratti un ROS alle stelle. Il sole si fa sentire e dopo poco meno di un'ora comincio a smontare la stazione. </p> <p><a href=\"https://www.mountainqrp.it/awards/showAttivazione.php?uid=sota_62ea8029b280a\">Log e mappa dei QSO su MQC</a></p> <p><img src=\"https://abisso.org/stream/2022/08/01/iu5bon-ia5/team-6671672e.jpeg\" alt=\"team\"></p> <p>73 de IU5BON </p>",
                "value": "In questo 2022 ho avuto la fortuna di passare due settimane all'isola d'Elba. Vacanze in relax con la famiglia ma ho avuto modo di fare un po’ di attività radio.  L'Elba è un luogo fantastico, e anche radiantisticamente ha i suoi vantaggi: si tratta di una referenza IOTA EU-028, ha due enormi parchi POTA I-1115 e I-1049 ed entrambi sono referenze 2-fer in quanto fanno parte del parco I-0667. Il giorno di maggiore attività da parte mia è stato il primo Agosto, dove l'intera giornata è stata dedicata alle attività radio.  Fortezza del Volterraio - DRES-TO035 Partenza la mattina da Rio Marina, c'è una strada provinciale che passa sul Volterraio. Il percorso da fare a piedi parte da un parcheggio lungo la strada ed il sentiero sale ripido, sono tutti gradoni, per circa 20 minuti (la segnaletica CAI indica 40 minuti). Raggiunta la cima del Volterraio, su uno sperone di roccia si erige la fortezza del Volterraio, edificata su fortificazioni etrusche preesistenti dalla famiglia Appiani per proteggere la città di Portoferraio dalle invasioni dei mori.  Fortezza  Si tratta di una attivazione rapida e senza pretese. Opero esclusivamente con lo yaesu ft-5d con uno stilo di circa 40cm e successivamente anche con una slimjim autocostruita.  Purtroppo non è stato possibile confrontare le due antenne in modo approfondito perché l'assenza di alberi ha reso impossibile issare la slimjim che è stata appesa ad una ringhiera del castello e tesa in orizzontale a circa un metro da terra.  Faccio una manciata di QSO, prevalentemente locali. Ad esclusione di Roberto IK0BDO/5 le altre stazioni sono tutte Elbane o in traghetto verso l'isola. Log e mappa dei QSO su MQC Volterraio - WxM-TO793  Io davanti alla fortezza  Sono già in cima al volterraio quindi decido di dedicate la parte finale della mia permanenza in vetta al Watt per Miglio. A sorpresa collego una stazione di Genova che aveva a disposizione anche il C4FM e facciamo tutte le prove del caso in 2m e 70cm sia FM che C4FM.  La dove in FM ogni tanto si perdeva il segnale, in C4FM nessun problema di sorta, sia in modalità Narrow che Wide. Segnale perfetto, audio impeccabile. I miei amici IZ5PHM e IK5JRZ sono ormai attraccati a Portoferraio, è il momento di scendere e andare sul monte Capanne.  Log e mappa dei QSO su MQC Monte Capanne e Promontorio dell'Enfola - I-1049 Il parco dell'Arcipelago Toscano (I-0667) ha una superficie enorme ed è a sua volta suddiviso in sottoparchi. Per esempio il Volterraio si trova nel parco dell'Elba Orientale (I-1115) che fa parte del parco I-0667. Allo stesso modo il monte Capanne fa anche parte del suo sottoparco di nome Monte Capanne e Promontorio dell'Enfola (I-1049).  Elba  Dopo essere sceso dal Volterraio mi dirigo verso la gabinovia di Marciana per salire sul monte Capanne. La vista è mozzafiato già dopo i primi minuti, giunti in vetta lo spettacolo è incredibile. Faccio un paio di chiamate in FM mentre monto la EFHW e comincio le attività in HF. Mi posiziono all'ombra di uno sperone di roccia laterale rispetto alla sommità del monte, circa 50m in linea d'aria dal punto più alto. La posizione ombreggiata agevola l'attivazione e riesco ad andare avanti per quasi 3h, pausa pranzo inclusa.  Ora è il momento di attivare la sommità per il SOTA.  Log e mappa dei QSO su MQC Monte Capanne - SOTA I/TO-080  sota  IZ5PHM mi ha portato una 4 elementi per i 2m gemella della mia rimasta a casa a Firenze, mentre aspetto alcuni pezzi dell'antenna comincio a chiamare in FM e collego immediatamente quattro stazioni, due delle quali anche in C4FM. Quando arriva la yagi l'attivazione è già assicurata dal numero di QSO ma monto ugualmente nella speranza di un DX in 2 m SSB. Purtroppo l'antenna non si comporta come dovrebbe e mostra a tratti un ROS alle stelle. Il sole si fa sentire e dopo poco meno di un'ora comincio a smontare la stazione.  Log e mappa dei QSO su MQC  team  73 de IU5BON"
              }
            ],
            "url": [
              "https://abisso.org/stream/2022/08/01/iu5bon-ia5/"
            ],
            "uid": [
              "https://abisso.org/stream/2022/08/01/iu5bon-ia5/"
            ],
            "published": [
              "2022-08-01T22:21:41+02:00"
            ],
            "syndication": [
              "https://www.mountainqrp.it/awards/showAttivazione.php?uid=dres_62e983d5386d4",
              "https://www.mountainqrp.it/awards/showAttivazione.php?uid=wxm_62ea6dfcd77c8",
              "https://www.mountainqrp.it/wp/attivazione/?uid=pota_62ea7b0c0a992",
              "https://www.mountainqrp.it/wp/attivazione/?uid=sota_62ea8029b280a"
            ],
            "category": [
              "hamradio",
              "MQC",
              "POTA",
              "SOTA"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "author": [
              {
                "type": [
                  "h-card"
                ],
                "properties": {
                  "photo": [
                    {
                      "value": "https://abisso.org/images/me/2021-10-06-ab582705.jpeg",
                      "alt": "Alessio Caiazza"
                    }
                  ],
                  "name": [
                    "Alessio Caiazza"
                  ],
                  "url": [
                    "https://abisso.org/"
                  ]
                },
                "value": "https://abisso.org/"
              }
            ],
            "name": [
              "microstazione digitale"
            ],
            "content": [
              {
                "html": "<p>Durante la mia <a href=\"https://abisso.org/stream/2022/06/24/iq5fi-pota/\">ultima attivazione POTA</a> ho provato la mia nuova stazione digitale composta dal minuscolo raspberrypi zero 2W, il grosso dubbio per me erano i soli 512MB di RAM, ma l'apparato si è comportato bene in FT8 e JS8CALL. </p> <p>Purtroppo non ho ancora avuto modo di provare ftldigi per verificare la fattibilità di un QSO in RTTY, però durante la mia attivazione mi sono accorto che il collegamento USB con la radio innalzava il noise floor di diversi punti S, una cosa assolutamente inaccettabile. </p> <p>In questo giorni di quarantena familiare allora ho provato a costruire un choke RF per il cavo USB.</p> <p>Qui a S. Marcello Pistoiese mi sono arrangiato per l'antenna, avevo 20m di cavo elettrico ma non lo spazio per distenderlo quindi la EFHW è montata in po’ a zig-zag, però qualche QSO sono riuscito a farlo. </p> <p><img src=\"https://abisso.org/stream/2022/07/03/rpi-choke/antenna-cec0a9da.jpeg\" alt=\"Antenna\"></p> <p>Costruisco il primo prototipo su una ferrite un po’ grande, funziona alla perfezione ma il choke adesso è più ingombrante e pesante del mini computer. </p> <p><img src=\"https://abisso.org/stream/2022/07/03/rpi-choke/big-f1d46798.jpeg\" alt=\"Prototipo su ferrite grande\"></p> <p>Fortunatamente avevo anche una ferrite FT140-43, decisamente più piccola del mio primo esemplare, che si è dimostrata idonea per l'utilizzo. </p> <p><img src=\"https://abisso.org/stream/2022/07/03/rpi-choke/small-3ac94d07.jpeg\" alt=\"progetto su ferrite piccola\"></p> <p>Ora la mia stazione digitale è pronta per la prossima attivazione.</p> <p><span class=\"page-break\"></span></p> <h2>Cosa posso fare con questo setup?</h2> <ul> <li>CAT control tramite flrig</li> <li>Sincronizzazione orario tramite il GPS della radio</li> <li>Hotspot IU5BON-field in caso di assenza segnale dati dal mio hotspot del cellulare</li> <li>server VNC per utilizzare le applicazioni per i modi digitali dal telefono o tablet</li> </ul> <p>73 de IU5BON</p>",
                "value": "Durante la mia ultima attivazione POTA ho provato la mia nuova stazione digitale composta dal minuscolo raspberrypi zero 2W, il grosso dubbio per me erano i soli 512MB di RAM, ma l'apparato si è comportato bene in FT8 e JS8CALL.  Purtroppo non ho ancora avuto modo di provare ftldigi per verificare la fattibilità di un QSO in RTTY, però durante la mia attivazione mi sono accorto che il collegamento USB con la radio innalzava il noise floor di diversi punti S, una cosa assolutamente inaccettabile.  In questo giorni di quarantena familiare allora ho provato a costruire un choke RF per il cavo USB. Qui a S. Marcello Pistoiese mi sono arrangiato per l'antenna, avevo 20m di cavo elettrico ma non lo spazio per distenderlo quindi la EFHW è montata in po’ a zig-zag, però qualche QSO sono riuscito a farlo.   Antenna  Costruisco il primo prototipo su una ferrite un po’ grande, funziona alla perfezione ma il choke adesso è più ingombrante e pesante del mini computer.   Prototipo su ferrite grande  Fortunatamente avevo anche una ferrite FT140-43, decisamente più piccola del mio primo esemplare, che si è dimostrata idonea per l'utilizzo.   progetto su ferrite piccola  Ora la mia stazione digitale è pronta per la prossima attivazione.  Cosa posso fare con questo setup?  CAT control tramite flrig Sincronizzazione orario tramite il GPS della radio Hotspot IU5BON-field in caso di assenza segnale dati dal mio hotspot del cellulare server VNC per utilizzare le applicazioni per i modi digitali dal telefono o tablet  73 de IU5BON"
              }
            ],
            "url": [
              "https://abisso.org/stream/2022/07/03/rpi-choke/"
            ],
            "uid": [
              "https://abisso.org/stream/2022/07/03/rpi-choke/"
            ],
            "published": [
              "2022-07-03T11:10:19+02:00"
            ],
            "syndication": [
              "https://www.mountainqrp.it/wp/attivazione/?uid=qrp_exp_62c1bc3b1bc7a"
            ],
            "category": [
              "hamradio",
              "MQC",
              "QRP"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "author": [
              {
                "type": [
                  "h-card"
                ],
                "properties": {
                  "photo": [
                    {
                      "value": "https://abisso.org/images/me/2021-10-06-ab582705.jpeg",
                      "alt": "Alessio Caiazza"
                    }
                  ],
                  "name": [
                    "Alessio Caiazza"
                  ],
                  "url": [
                    "https://abisso.org/"
                  ]
                },
                "value": "https://abisso.org/"
              }
            ],
            "name": [
              "IQ5FI a Vallombrosa I-0104"
            ],
            "content": [
              {
                "html": "<h2>Prima attivazione POTA per la sezione ARI di Firenze</h2> <p>Giovedì 23 Giugno IU5BON Alessio e <a href=\"https://ik5vyz.com/\">IK5VYZ Claudio</a> decidono di provare un’attivazione club per il programma POTA attivando <a href=\"https://pota.app/#/park/I-0104\">il parco I-0104</a> con il nominativo di sezione IQ5FI.</p> <p>Essendo un’attivazione infrasettimanale il nostro scopo principale era quello di stare un po’ al fresco e di provare alcune antenne ed attrezzatura in tranquillità.</p> <p>Il parco è facilmente raggiungibile in auto quindi abbiamo portato un po’ più attrezzatura rispetto a quando andiamo a fare altre attività tipo SOTA.</p> <p><img src=\"https://abisso.org/stream/2022/06/24/iq5fi-pota/7-73f06163.jpeg\" alt=\"attrezzatura\"></p> <p>Iniziamo montando la JPC PAC-12 in configurazione 40m e la yagi 4 elementi per le VHF. Dopo un rapido check delle antenne spostiamo la PAC-12 in 20m e montiamo una EFHW per i 40m. Operiamo con due radio HF, un ICOM IC-705 e un elecraft KX2. A queste si aggiungono alcuni palmari D-Star e DMR.</p> <p><img src=\"https://abisso.org/stream/2022/06/24/iq5fi-pota/3-001617d9.jpeg\" alt=\"JPC PAC-12\"></p> <p><img src=\"https://abisso.org/stream/2022/06/24/iq5fi-pota/5-9dc361d3.jpeg\" alt=\"radiali JPC PAC-12\"></p> <p><img src=\"https://abisso.org/stream/2022/06/24/iq5fi-pota/10-666c348c.jpeg\" alt=\"EFHW\"></p> <p>Questa è la prima volta che usiamo HAMRS per il logging, il file ADIF per le attivazioni club richiede alcuni campi specifici per essere sicuri che il punteggio sia correttamente attribuito sia alla stazione di sezione che a all’operatore che esegue il collegamento e decidiamo di non rischiare. Programma molto comodo e in presenza di connettività internet permette di verificare nominativi e referenze in modo automatico.</p> <p><img src=\"https://abisso.org/stream/2022/06/24/iq5fi-pota/12-73619d11.jpeg\" alt=\"HAMRS\"></p> <p>La mattinata procede a rilento, nessuno risponde alle nostre chiamate quindi ci dedichiamo un po’ alla caccia di altre stazioni con risultati non eccellenti.</p> <p>Verso l’ora di pranzo riprendiamo a chiamare e arrivano i primi tre collegamenti HF in chiamata, fra cui Roberto IK0BDO/5 che ci collega sia in 20 che in 40.</p> <p>I collegamenti si interrompono e vista l’ora decidiamo di tentare la modalità panino&amp;FT8. IU5BON aveva portato una micro stazione digitale composta da un raspberrypi zero 2W. Purtroppo il setup induce tantissimo rumore in radiofrequenza ma decidiamo comunque di vedere che si può fare.</p> <p><img src=\"https://abisso.org/stream/2022/06/24/iq5fi-pota/13-96a0f729.jpeg\" alt=\"Pranzo\"></p> <p>Facciamo 8 QSO in FT8 20m in rapida successione mentre mangiamo. Poi proviamo js8call ma in 20m troviamo solo stazioni automatiche. Tentiamo con fldigi in RTTY ma il mini computer sembra soffrire molto l’avvio dell’applicazione oltre ad essere completamente da configurare. La poca batteria rimasta nel 705 e il rumore indotto dal computer ci spingono a tornare alla fonia per il tempo rimanente. Mettiamo a log altre tre stazioni poi tentiamo timidamente una chiamata CW QRS ma riceviamo solo una risposta ad altissima velocità che non riusciamo a mettere a log, dopodiché la batteria ci saluta.</p> <p>Nel frattempo il KX2 di Claudio continua ad andare, ma visto lo scarso successo in chiamata ci mettiamo a cacciare attivatori SOTA.</p> <p>Finita la batteria del 705 cominciamo l’attività in 2m FM e DMR. Avevamo pubblicizzato molto la nostra attivazione in sezione, eravamo abbastanza vicini a Firenze da poter avere dei QSO in 2m FM anche con i classici gommini dei palmari. Colleghiamo alcuni colleghi, e con IZ5HQB facciamo anche la comparativa FM/DMR. Incredibile la differenza, in FM dovevamo tenere lo squelch aperto per sentire Gabriele appena sopra il rumore mentre in DMR la sua voce arriva forte e squillante.</p> <p>Il premio QSO all’ultimo istante va a Roberto IW5BNY, avevamo appena acceso l’auto per andare via quando dal palmare sentiamo che Roberto ci chiama per sapere se eravamo ancora attività. Facciamo QSO con lui e poi via verso casa.</p> <h3>Cosa abbiamo imparato?</h3> <ul> <li>La stazione in 20m induce sempre un po’ di disturbo in 40m, indipendentemente dalle radio e le antenne utilizzate, il viceversa non è vero.</li> <li>La PAC-12 è velocissima da montare e ha un buon ROS. È un po’ troppo stretta di banda in 40m ma in 20m è perfetta. Purtroppo non abbiamo avuto tempo di provarla in altre bande.</li> <li>La stazione digitale con il raspberrypi zero 2W funziona, ma dobbiamo migliorare il cavo di collegamento, magari avvolgendolo attorno ad un toroide in ferrite.</li> <li>HAMRS si è rivelato comodo e piacevole da utilizzare.</li> </ul> <p>73 de IQ5FI - Alessio IU5BON e Claudio IK5VYZ </p>",
                "value": "Prima attivazione POTA per la sezione ARI di Firenze Giovedì 23 Giugno IU5BON Alessio e IK5VYZ Claudio decidono di provare un’attivazione club per il programma POTA attivando il parco I-0104 con il nominativo di sezione IQ5FI. Essendo un’attivazione infrasettimanale il nostro scopo principale era quello di stare un po’ al fresco e di provare alcune antenne ed attrezzatura in tranquillità. Il parco è facilmente raggiungibile in auto quindi abbiamo portato un po’ più attrezzatura rispetto a quando andiamo a fare altre attività tipo SOTA.  attrezzatura  Iniziamo montando la JPC PAC-12 in configurazione 40m e la yagi 4 elementi per le VHF. Dopo un rapido check delle antenne spostiamo la PAC-12 in 20m e montiamo una EFHW per i 40m. Operiamo con due radio HF, un ICOM IC-705 e un elecraft KX2. A queste si aggiungono alcuni palmari D-Star e DMR.  JPC PAC-12   radiali JPC PAC-12   EFHW  Questa è la prima volta che usiamo HAMRS per il logging, il file ADIF per le attivazioni club richiede alcuni campi specifici per essere sicuri che il punteggio sia correttamente attribuito sia alla stazione di sezione che a all’operatore che esegue il collegamento e decidiamo di non rischiare. Programma molto comodo e in presenza di connettività internet permette di verificare nominativi e referenze in modo automatico.  HAMRS  La mattinata procede a rilento, nessuno risponde alle nostre chiamate quindi ci dedichiamo un po’ alla caccia di altre stazioni con risultati non eccellenti. Verso l’ora di pranzo riprendiamo a chiamare e arrivano i primi tre collegamenti HF in chiamata, fra cui Roberto IK0BDO/5 che ci collega sia in 20 che in 40. I collegamenti si interrompono e vista l’ora decidiamo di tentare la modalità panino&FT8. IU5BON aveva portato una micro stazione digitale composta da un raspberrypi zero 2W. Purtroppo il setup induce tantissimo rumore in radiofrequenza ma decidiamo comunque di vedere che si può fare.  Pranzo  Facciamo 8 QSO in FT8 20m in rapida successione mentre mangiamo. Poi proviamo js8call ma in 20m troviamo solo stazioni automatiche. Tentiamo con fldigi in RTTY ma il mini computer sembra soffrire molto l’avvio dell’applicazione oltre ad essere completamente da configurare. La poca batteria rimasta nel 705 e il rumore indotto dal computer ci spingono a tornare alla fonia per il tempo rimanente. Mettiamo a log altre tre stazioni poi tentiamo timidamente una chiamata CW QRS ma riceviamo solo una risposta ad altissima velocità che non riusciamo a mettere a log, dopodiché la batteria ci saluta. Nel frattempo il KX2 di Claudio continua ad andare, ma visto lo scarso successo in chiamata ci mettiamo a cacciare attivatori SOTA. Finita la batteria del 705 cominciamo l’attività in 2m FM e DMR. Avevamo pubblicizzato molto la nostra attivazione in sezione, eravamo abbastanza vicini a Firenze da poter avere dei QSO in 2m FM anche con i classici gommini dei palmari. Colleghiamo alcuni colleghi, e con IZ5HQB facciamo anche la comparativa FM/DMR. Incredibile la differenza, in FM dovevamo tenere lo squelch aperto per sentire Gabriele appena sopra il rumore mentre in DMR la sua voce arriva forte e squillante. Il premio QSO all’ultimo istante va a Roberto IW5BNY, avevamo appena acceso l’auto per andare via quando dal palmare sentiamo che Roberto ci chiama per sapere se eravamo ancora attività. Facciamo QSO con lui e poi via verso casa. Cosa abbiamo imparato?  La stazione in 20m induce sempre un po’ di disturbo in 40m, indipendentemente dalle radio e le antenne utilizzate, il viceversa non è vero. La PAC-12 è velocissima da montare e ha un buon ROS. È un po’ troppo stretta di banda in 40m ma in 20m è perfetta. Purtroppo non abbiamo avuto tempo di provarla in altre bande. La stazione digitale con il raspberrypi zero 2W funziona, ma dobbiamo migliorare il cavo di collegamento, magari avvolgendolo attorno ad un toroide in ferrite. HAMRS si è rivelato comodo e piacevole da utilizzare.  73 de IQ5FI - Alessio IU5BON e Claudio IK5VYZ"
              }
            ],
            "url": [
              "https://abisso.org/stream/2022/06/24/iq5fi-pota/"
            ],
            "uid": [
              "https://abisso.org/stream/2022/06/24/iq5fi-pota/"
            ],
            "published": [
              "2022-06-24T11:21:41+02:00"
            ],
            "syndication": [
              "https://youtube.com/shorts/OCr9Y3G64Z4",
              "https://www.mountainqrp.it/wp/attivazione/?uid=pota_62b56281e2235"
            ],
            "category": [
              "hamradio",
              "MQC",
              "POTA"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "author": [
              {
                "type": [
                  "h-card"
                ],
                "properties": {
                  "photo": [
                    {
                      "value": "https://abisso.org/images/me/2021-10-06-ab582705.jpeg",
                      "alt": "Alessio Caiazza"
                    }
                  ],
                  "name": [
                    "Alessio Caiazza"
                  ],
                  "url": [
                    "https://abisso.org/"
                  ]
                },
                "value": "https://abisso.org/"
              }
            ],
            "name": [
              "tatitati tatatita"
            ],
            "content": [
              {
                "html": "<div class=\"no-print\"> <audio class=\"u-audio\" src=\"https://abisso.org/stream/2022/06/04/cq/cq.mp3\" controls> CQ DE IU5BON &lt;AR&gt; </audio> <a class=\"button is-primary\" href=\"https://abisso.org/stream/2022/06/04/cq/cq.mp3\" download=\"\"> <span class=\"icon is-small\"> <i class=\"fas fa-cloud-arrow-down\"></i> </span> </a> </div> <p>Quando si inizia a studiare la telegrafia, arriva poi il momento in cui ci si deve fare coraggio e chiamare CQ. Per me questo è successo Sabato 28 Maggio.</p> <p>Siamo in preparazione per la partenza con la famiglia, destinazione campeggio in JN53FH. Al momento di fare i bagagli decido di lasciare a casa l'ICOM IC-705 e di portare solamente la mia nuova SW-3B.</p> <p>Dopo pranzo approfitto della nanna pomeridiana di mia figlia per montare la EFHW e provare a fare qualche timida chiamata a 12 WPM.</p> <p><img src=\"https://abisso.org/stream/2022/06/04/cq/antenna-8d6b3258.jpeg\" alt=\"antenna\"></p> <p>È giorno di contest, c'è il CQ WPX CW, ma stranamente trovo un buchetto libero in 40m e comincio a chiamare.</p> <p><img src=\"https://abisso.org/stream/2022/06/04/cq/rbn-6a22b985.jpeg\" alt=\"RBN\"></p> <p>Ovviamente mi risponde Mario IW1DUS, mio compagno di corso base CW QRS ITA, e facciamo il nostro QSO in chiaro, usando spaziature <em>flessibili</em> per aiutarci nella decodifica.</p> <p>Continuo a chiamare ancora un po’ e mi risponde un'altra stazione, panico. Attacco con il mio fogliettino con il QSO standard, inciampo sul mio nome un paio di volte, ma completo il mio QTC. Il corrispondente riprende, avevo sbagliato il nominativo, si tratta di Ben I8QFK, il maestro del corso CW!</p> <div class=\"page-break\"></div> <p>Mi passa il rapporto e dice qualcosa a proposito del contest in corso, ma proprio durante il suo passaggio comincio a sentire il pianto di mia figlia che si è svegliata.</p> <p><img src=\"https://abisso.org/stream/2022/06/04/cq/qrt-0cc25fd5.jpeg\" alt=\"QRT\"></p> <p>QRT forzato per me.</p> <div class=\"page-break\"></div> <h3>La stazione radio</h3> <ul> <li>Radio <a href=\"https://www.venus-itech.com/product/sw-3b-qrp-cw-transceiver/\">SW-3B</a>\n</li> <li><a href=\"http://www.hamgadgets.com/ULTRA-PICOKEYER\">Ultra PicoKeyer</a></li> <li>Antenna <a href=\"https://qrpguys.com/qrpguys-multi-band-end-fed-antenna\">QRPGuys Portable Multi-Band EFHW per 40-30-20m</a>\n</li> <li>Batteria al litio cinese</li> <li>Paddle CW cinese in metallo</li> <li>Cuffiette di un vecchio iPhone</li> </ul> <p>Un kit molto leggero e assolutamente compatto.</p> <p>73 de IU5BON</p>",
                "value": "CQ DE IU5BON <AR>        Quando si inizia a studiare la telegrafia, arriva poi il momento in cui ci si deve fare coraggio e chiamare CQ. Per me questo è successo Sabato 28 Maggio. Siamo in preparazione per la partenza con la famiglia, destinazione campeggio in JN53FH. Al momento di fare i bagagli decido di lasciare a casa l'ICOM IC-705 e di portare solamente la mia nuova SW-3B. Dopo pranzo approfitto della nanna pomeridiana di mia figlia per montare la EFHW e provare a fare qualche timida chiamata a 12 WPM.  antenna  È giorno di contest, c'è il CQ WPX CW, ma stranamente trovo un buchetto libero in 40m e comincio a chiamare.  RBN  Ovviamente mi risponde Mario IW1DUS, mio compagno di corso base CW QRS ITA, e facciamo il nostro QSO in chiaro, usando spaziature flessibili per aiutarci nella decodifica. Continuo a chiamare ancora un po’ e mi risponde un'altra stazione, panico. Attacco con il mio fogliettino con il QSO standard, inciampo sul mio nome un paio di volte, ma completo il mio QTC. Il corrispondente riprende, avevo sbagliato il nominativo, si tratta di Ben I8QFK, il maestro del corso CW!  Mi passa il rapporto e dice qualcosa a proposito del contest in corso, ma proprio durante il suo passaggio comincio a sentire il pianto di mia figlia che si è svegliata.  QRT  QRT forzato per me.  La stazione radio  Radio SW-3B Ultra PicoKeyer Antenna QRPGuys Portable Multi-Band EFHW per 40-30-20m Batteria al litio cinese Paddle CW cinese in metallo Cuffiette di un vecchio iPhone  Un kit molto leggero e assolutamente compatto. 73 de IU5BON"
              }
            ],
            "audio": [
              "https://abisso.org/stream/2022/06/04/cq/cq.mp3"
            ],
            "url": [
              "https://abisso.org/stream/2022/06/04/cq/"
            ],
            "uid": [
              "https://abisso.org/stream/2022/06/04/cq/"
            ],
            "published": [
              "2022-06-04T09:01:38+02:00"
            ],
            "category": [
              "hamradio",
              "MQC",
              "QRP",
              "CW"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "author": [
              {
                "type": [
                  "h-card"
                ],
                "properties": {
                  "photo": [
                    {
                      "value": "https://abisso.org/images/me/2021-10-06-ab582705.jpeg",
                      "alt": "Alessio Caiazza"
                    }
                  ],
                  "name": [
                    "Alessio Caiazza"
                  ],
                  "url": [
                    "https://abisso.org/"
                  ]
                },
                "value": "https://abisso.org/"
              }
            ],
            "name": [
              "Prove di ruota MQC in js8call"
            ],
            "content": [
              {
                "html": "<p>Dopo gli <a href=\"https://abisso.org/stream/2022/05/29/js8call/\">esperimenti di Mercoledì</a> con js8call, la voglia di provare qualcosa di nuovo era ancora forte. Il giorno dopo, Giovedì 26, è il turno di IU2OMT Paolo e IW1DUS Mario.</p> <table>\n<thead> <tr> <th>Callsign</th> <th style=\"text-align: center\">TX</th> <th style=\"text-align: center\">RX</th> <th style=\"text-align: center\">Nome</th> <th style=\"text-align: center\">Time off</th> </tr> </thead>\n<tbody> <tr> <td>IU2OMT</td> <td style=\"text-align: center\">-08</td> <td style=\"text-align: center\">+13</td> <td style=\"text-align: center\">Paolo</td> <td style=\"text-align: center\">2042</td> </tr> <tr> <td>IW1DUS</td> <td style=\"text-align: center\">-15</td> <td style=\"text-align: center\">-02</td> <td style=\"text-align: center\">Mario</td> <td style=\"text-align: center\">2048</td> </tr> </tbody>\n</table> <p>Segnali come sempre interessantissimi per i nostri 5W. Facciamo quattro chiacchiere poi propongo di testare una funzionalità di js8call chiamata <a href=\"https://docs.google.com/document/d/159S4wqMUVdMA7qBgaSWmU-iDI4C9wd4CuWnetN68O9U/edit#heading=h.p2czxqrknaod\">group callsign</a>. Aggiungiamo <code>@MQC</code> alle group callsign del nostro applicativo e tentiamo un QSO di gruppo.</p> <p><img src=\"https://abisso.org/stream/2022/06/02/js8call-mqc/ruota-4b381e2c.png\" alt=\"Ruota MQC\"></p> <p>La cosa funziona, ma comunque richiede un po’ di pratica. Approfondendo il manuale sembra che esistano delle group callsign ufficiali che sono ottimizzate per la trasmissione come <code>@QRP</code>, <code>@SOTA</code>, e <code>@POTA</code>.</p> <p>La prossima volta sarebbe meglio usare <code>@QRP</code> al posto di <code>@MQC</code> per sfruttare le ottimizzazioni di js8call.</p> <p>73 de IU5BON</p>",
                "value": "Dopo gli esperimenti di Mercoledì con js8call, la voglia di provare qualcosa di nuovo era ancora forte. Il giorno dopo, Giovedì 26, è il turno di IU2OMT Paolo e IW1DUS Mario.   Callsign TX RX Nome Time off    IU2OMT -08 +13 Paolo 2042   IW1DUS -15 -02 Mario 2048   Segnali come sempre interessantissimi per i nostri 5W. Facciamo quattro chiacchiere poi propongo di testare una funzionalità di js8call chiamata group callsign. Aggiungiamo @MQC alle group callsign del nostro applicativo e tentiamo un QSO di gruppo.  Ruota MQC  La cosa funziona, ma comunque richiede un po’ di pratica. Approfondendo il manuale sembra che esistano delle group callsign ufficiali che sono ottimizzate per la trasmissione come @QRP, @SOTA, e @POTA. La prossima volta sarebbe meglio usare @QRP al posto di @MQC per sfruttare le ottimizzazioni di js8call. 73 de IU5BON"
              }
            ],
            "url": [
              "https://abisso.org/stream/2022/06/02/js8call-mqc/"
            ],
            "uid": [
              "https://abisso.org/stream/2022/06/02/js8call-mqc/"
            ],
            "published": [
              "2022-06-02T19:23:28+02:00"
            ],
            "category": [
              "hamradio",
              "MQC",
              "QRP"
            ]
          }
        }
      ]
    },
    {
      "type": [
        "h-card"
      ],
      "properties": {
        "url": [
          "https://abisso.org/",
          "https://alessiocaiazza.info/"
        ],
        "uid": [
          "https://abisso.org/"
        ],
        "photo": [
          {
            "value": "https://abisso.org/images/me_big-3ce5f3ed.jpg",
            "alt": "Alessio"
          }
        ],
        "name": [
          "Alessio Caiazza"
        ],
        "nickname": [
          "nolith",
          "IU5BON"
        ],
        "category": [
          "production engineering"
        ],
        "org": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "name": [
                "IndieWeb"
              ],
              "url": [
                "https://indieweb.org/"
              ]
            },
            "value": "IndieWeb"
          },
          "GitLab"
        ],
        "job-title": [
          "Staff Backend Engineer, Delivery"
        ],
        "pronoun": [
          "he/him/his"
        ],
        "note": [
          "\"Il sapere umano appartiene al mondo.\""
        ]
      }
    }
  ],
  "rels": {
    "stylesheet": [
      "https://abisso.org/stylesheets/abisso-5385fa91.css"
    ],
    "webmention": [
      "https://webmention.io/abisso.org/webmention"
    ],
    "pingback": [
      "https://webmention.io/abisso.org/xmlrpc"
    ],
    "authorization_endpoint": [
      "https://indieauth.com/auth"
    ],
    "token_endpoint": [
      "https://tokens.indieauth.com/token"
    ],
    "icon": [
      "https://abisso.org/images/me_128-8b0ab3fd.jpg"
    ],
    "apple-touch-icon-precomposed": [
      "https://abisso.org/images/me_128-8b0ab3fd.jpg"
    ],
    "micropub": [
      "https://api.abisso.org/micropub"
    ],
    "microsub": [
      "https://aperture.p3k.io/microsub/573"
    ],
    "alternate": [
      "https://abisso.org/feed.xml"
    ],
    "author": [
      "https://abisso.org/"
    ],
    "syndication": [
      "https://www.mountainqrp.it/awards/showAttivazione.php?uid=dres_62e983d5386d4",
      "https://www.mountainqrp.it/awards/showAttivazione.php?uid=wxm_62ea6dfcd77c8",
      "https://www.mountainqrp.it/wp/attivazione/?uid=pota_62ea7b0c0a992",
      "https://www.mountainqrp.it/wp/attivazione/?uid=sota_62ea8029b280a",
      "https://www.mountainqrp.it/wp/attivazione/?uid=qrp_exp_62c1bc3b1bc7a",
      "https://youtube.com/shorts/OCr9Y3G64Z4",
      "https://www.mountainqrp.it/wp/attivazione/?uid=pota_62b56281e2235"
    ],
    "next": [
      "https://abisso.org/#"
    ],
    "prev": [
      "https://abisso.org/page/2/"
    ],
    "me": [
      "https://abisso.org/",
      "https://alessiocaiazza.info/",
      "https://gitlab.com/nolith",
      "https://github.com/nolith",
      "https://twitter.com/nolith",
      "https://www.linkedin.com/in/nolith",
      "https://www.qrz.com/db/iu5bon"
    ],
    "noreferrer": [
      "https://about.gitlab.com/"
    ]
  },
  "rel-urls": {
    "https://abisso.org/stylesheets/abisso-5385fa91.css": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://webmention.io/abisso.org/webmention": {
      "rels": [
        "webmention"
      ]
    },
    "https://webmention.io/abisso.org/xmlrpc": {
      "rels": [
        "pingback"
      ]
    },
    "https://indieauth.com/auth": {
      "rels": [
        "authorization_endpoint"
      ]
    },
    "https://tokens.indieauth.com/token": {
      "rels": [
        "token_endpoint"
      ]
    },
    "https://abisso.org/images/me_128-8b0ab3fd.jpg": {
      "rels": [
        "icon"
      ]
    },
    "https://api.abisso.org/micropub": {
      "rels": [
        "micropub"
      ]
    },
    "https://aperture.p3k.io/microsub/573": {
      "rels": [
        "microsub"
      ]
    },
    "https://abisso.org/feed.xml": {
      "rels": [
        "alternate"
      ],
      "type": "application/atom+xml"
    },
    "https://abisso.org/": {
      "rels": [
        "author"
      ]
    },
    "https://www.mountainqrp.it/awards/showAttivazione.php?uid=dres_62e983d5386d4": {
      "rels": [
        "syndication"
      ]
    },
    "https://www.mountainqrp.it/awards/showAttivazione.php?uid=wxm_62ea6dfcd77c8": {
      "rels": [
        "syndication"
      ]
    },
    "https://www.mountainqrp.it/wp/attivazione/?uid=pota_62ea7b0c0a992": {
      "rels": [
        "syndication"
      ]
    },
    "https://www.mountainqrp.it/wp/attivazione/?uid=sota_62ea8029b280a": {
      "rels": [
        "syndication"
      ]
    },
    "https://www.mountainqrp.it/wp/attivazione/?uid=qrp_exp_62c1bc3b1bc7a": {
      "rels": [
        "syndication"
      ]
    },
    "https://youtube.com/shorts/OCr9Y3G64Z4": {
      "rels": [
        "syndication"
      ]
    },
    "https://www.mountainqrp.it/wp/attivazione/?uid=pota_62b56281e2235": {
      "rels": [
        "syndication"
      ]
    },
    "https://abisso.org/#": {
      "rels": [
        "next"
      ]
    },
    "https://abisso.org/page/2/": {
      "rels": [
        "prev"
      ]
    },
    "https://alessiocaiazza.info/": {
      "rels": [
        "me"
      ]
    },
    "https://about.gitlab.com/": {
      "rels": [
        "noreferrer"
      ],
      "text": "GitLab"
    },
    "https://gitlab.com/nolith": {
      "rels": [
        "me"
      ]
    },
    "https://github.com/nolith": {
      "rels": [
        "me"
      ]
    },
    "https://twitter.com/nolith": {
      "rels": [
        "me"
      ]
    },
    "https://www.linkedin.com/in/nolith": {
      "rels": [
        "me"
      ]
    },
    "https://www.qrz.com/db/iu5bon": {
      "rels": [
        "me"
      ]
    }
  }
}