{
  "items": [
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "name": [
          "Home\n\n\tWell met and welcome!  My name is Sam, and on this little corner of the \n\tinternet, you can find the various programming projects I have put together \n\tin my spare time.  For any questions or comments about them, the site, or \n\tfull‐time Haskell jobs you may be looking to fill, please email me at \n\tag@ (personal messages can be sent to sam@); otherwise, \n\tjust enjoy your time here, and I hope that your day goes well for you!\n\n\n\nAround the web\n\n\n\tGitHub:\n\t\tag-eitilt\n\t\n\tLinkedIn:\n\t\tsam-may-eitilt\n\t\n\n\n\nBackground\n\n\n\tIʼve always enjoyed finding my way around computers; from when I figured \n\tout the F11 key made Internet Explorer take up the entire screen \n\tby accidentally banging the keyboard, and then by deliberately banging on \n\tprogressively smaller portions of the keyboard until I zeroed in on the \n\tproper key, to when I switched my Gentoo installation to build everything \n\tusing Clang rather than GCC, and \n\thacked together code patches and/or manually added compiler flags to get \n\t(almost) everything building again.  I took a video game development class \n\tin high school because I had started writing my own—using a more complex \n\tlanguage and environment than the class did—in my spare time in middle \n\tschool.  I specifically requested programming textbooks through the \n\tinterlibrary loan system for a bit of light reading, even before I had the \n\tmathmatical knowledge to fully understand them.\n\n\n\n\tAnd yet (or maybe because of that), my mother is able to joke about how \n\ttechnologically conservative I am.  I might unthinkingly forward an email \n\tand leave the recipiant dealing with a plain‐text rendition of what was \n\tonce a complex HTML document, \n\tcomplete with tracking links displayed in full over three lines of \n\tidentifying characters, just because thatʼs the view I see all the time.  I \n\thave to admit to finding a certain delight in replying to peopleʼs \n\toffhanded comments about an app I should use or a new feature of an \n\tupcoming phone by pulling out my own and flipping open the 2½″ screen; I \n\thad a smartphone once.  I switched back the first excuse I got.  I am \n\twriting this in Vim, to be compiled on the terminal to static HTML files, and pushed to a server where the \n\tprimary management is done via ssh.\n\n\n\n\tShe might joke, but I would describe it more as being aware of what I lose \n\tin the newer technologies, and not buying in to the slicker interface just \n\tbecause itʼs a bit fancier.  I would talk about how having the internet in \n\tmy pocket wound up being the only thing I would look at on breaks at work, \n\tto the detriment of writing the stories I had in my head, of the physical \n\tbooks I was reading, of walking the trail alongside the river.  I would \n\targue for the benefits of controling your own information on your own \n\tdomain, and of having that information be accessible even to the most basic \n\tof clients.  I would not have any good excuse for the overly‐basic email.  \n\t😉\n\n\n\n\tThat is the mentality that underlies my programming: provide the user with \n\ta complete, comfortable experience, but give them control over their own \n\tdata and system.  Moreover, avoid complexity for complexity's sake, \n\tand—above all—keep in mind what unintended effects any seemingly simple \n\tease‐of‐life feature might have on the quality of the rest of their life.  \n\tWe can help; we should not take over.  Don′t be evil."
        ]
      }
    }
  ],
  "rels": {
    "canonical": [
      "https://ag.eitilt.life/index.html.en.utf8"
    ],
    "stylesheet": [
      "https://ag.eitilt.life/css/common.css",
      "https://ag.eitilt.life/fonts/symbola-emoji.css",
      "https://ag.eitilt.life/css/main.css"
    ],
    "author": [
      "https://flower.eitilt.life/contact/sam.html"
    ],
    "external": [
      "https://github.com/ag-eitilt",
      "https://www.linkedin.com/in/sam-may-eitilt/",
      "https://jaspervdj.be/hakyll",
      "https://www.nearlyfreespeech.net/"
    ],
    "me": [
      "https://github.com/ag-eitilt",
      "https://www.linkedin.com/in/sam-may-eitilt/"
    ],
    "license": [
      "http://creativecommons.org/licenses/by/4.0/"
    ]
  },
  "rel-urls": {
    "https://ag.eitilt.life/index.html.en.utf8": {
      "rels": [
        "canonical"
      ]
    },
    "https://ag.eitilt.life/css/common.css": {
      "rels": [
        "stylesheet"
      ],
      "type": "text/css"
    },
    "https://ag.eitilt.life/fonts/symbola-emoji.css": {
      "rels": [
        "stylesheet"
      ],
      "type": "text/css"
    },
    "https://flower.eitilt.life/contact/sam.html": {
      "rels": [
        "author"
      ]
    },
    "https://ag.eitilt.life/css/main.css": {
      "rels": [
        "stylesheet"
      ],
      "type": "text/css"
    },
    "https://github.com/ag-eitilt": {
      "rels": [
        "external",
        "me"
      ],
      "text": "Older & contributed"
    },
    "https://www.linkedin.com/in/sam-may-eitilt/": {
      "rels": [
        "external",
        "me"
      ],
      "text": "sam-may-eitilt"
    },
    "https://jaspervdj.be/hakyll": {
      "rels": [
        "external"
      ],
      "text": "Hakyll"
    },
    "https://www.nearlyfreespeech.net/": {
      "rels": [
        "external"
      ],
      "text": "NearlyFreeSpeech.net"
    },
    "http://creativecommons.org/licenses/by/4.0/": {
      "rels": [
        "license"
      ]
    }
  }
}