{
  "items": [
    {
      "type": [
        "h-feed"
      ],
      "properties": {},
      "children": [
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "name": [
              "Captain, it’s Wednesday"
            ],
            "content": [
              {
                "html": "<a href=\"https://alirezahayati.com/2023/02/27/captain-its-wednesday/\" title=\"Permalink to Captain, it’s Wednesday\"><img width=\"700\" height=\"394\" src=\"https://alirezahayati.com/wp-content/uploads/2023/02/tin-tin-captain-wednesday-700x394.jpg\" class=\"attachment-independent_publisher_post_thumbnail size-independent_publisher_post_thumbnail wp-post-image\" alt=\"\" decoding=\"async\" srcset=\"https://alirezahayati.com/wp-content/uploads/2023/02/tin-tin-captain-wednesday-700x394.jpg 700w, https://alirezahayati.com/wp-content/uploads/2023/02/tin-tin-captain-wednesday-300x169.jpg 300w, https://alirezahayati.com/wp-content/uploads/2023/02/tin-tin-captain-wednesday-1024x576.jpg 1024w, https://alirezahayati.com/wp-content/uploads/2023/02/tin-tin-captain-wednesday-768x432.jpg 768w, https://alirezahayati.com/wp-content/uploads/2023/02/tin-tin-captain-wednesday-1536x864.jpg 1536w, https://alirezahayati.com/wp-content/uploads/2023/02/tin-tin-captain-wednesday.jpg 1600w\" sizes=\"(max-width: 700px) 100vw, 700px\"></a>\n\t\t\t\n\t\t\t\n<p>I’ve been watching West Wing for past weeks and it I just ended. It was amazing. It’s one of those shows for me that I feel I’m actually living with the characters. One of those shows that if I see the character on the streets, I won’t remember them by their real name but by their character name.</p>\n\n\n\n<p>For example, Chandler (from friends) is not Matthew Perry for me. I know his real name but he’s always Chandler for me. Same goes for Sheldon (Jim Parsons), Mike Ross (Patrick J. Adams), and Will McAvoy (Jeff Daniels). They’re always their characters for me. I know it may sound bad or rude but it’s just like that. RIP John Spencer is Leo, Martin Sheen is Jed, Bradley Whitford is my dear Josh, Rob Lowe is Sam, Allison Janney is C.J., but, but, Dule Hill is Alex Williams from Suits.</p>\n\n\n\n<p>Speaking of other shows, I first watched The Newsroom, and then went to West Wing. American political drama started for me with The Newsroom. I loved what Aaron Sorkin did and got interested to watch West Wing as well.</p>\n\n\n\n<p>I don’t have a lot of time in the day. Between working and studying, there’s not much time left to do anything beside eating and getting some rest. That’s why I usually binge-watch series. I download them on my phone and computer and watch them before I go to sleep. I wake up early so I have to manage how many episodes I watch so I an get few hours of rest.</p>\n\n\n\n<p>It’s been tiring these past few months. Heavy pressure and complications in my life makes time run very slower than usual. I think all people experience this. It doesn’t need you to be a scientist to be sure that time is relative. Sometimes I think to myself, was Einstein going through a personal difficulty when he came up with the theory of relative time?</p>\n\n\n\n<p>From Iran Protests to economic disaster we’re experiencing right now, everything seems to be falling to hell. IRR was the least valuable currency in the world but it’s even getting worse right now. Seems that politicians are not tired of messing with people. Sometimes I wish I was living in the West Wing virtual world with Jed Bartlet as my president. He seemed to really care about people.</p>\n\n\n\n<p>I’m not the strapping young Muslim socialist I used to be (Obama said it). I got softened. I more align with Bernie than Obama. I used to align with Norman Thomas and before that, Abbie Hoffman. I was wondering if the system does this to people. Making them tired and turning them to what it likes. Creating drama after drama, difficulties and complex problems, out-of-touch disasters in life, etc. etc. to make you tired of even trying to change anything.</p>\n\n\n\n<p>That’s my conspiracy theory. There’s a group of people, 100 of them, that decide about disasters in third-world countries to protect ones in advanced states. 100 for disasters, 100 to control the economy, 100 for war and peace stuff, and 100 for advertising these correctly. I might just throw another 100 just in case there’s need for another group. So 500 people, hard-working people, that control the world. They ought to be very hard-working. It’s no easy job to make world shit like this, pardon my French.</p>\n\n\n\n<p>It’s been 20 years since I first thought to myself when this hell will end and we feel peace and prosperity. Even with relative time it should have been passed right now. It’s taking too long to end. Even with the feeling that everything is going fast in world, it’s taking too long. I’m getting tired and I’m young, relatively. I know people who’ve been tired for 60 years now.</p>\n\n\n\n<p>I feel like the captain in the book of “The Crab with the Golden Claws.” Captain asked Tin Tin “what a week, huh?” and Tin Tin replies with somehow a shock: “Captain, it’s Wednesday”. I can feel the disappointment in the captain.</p>",
                "value": "I’ve been watching West Wing for past weeks and it I just ended. It was amazing. It’s one of those shows for me that I feel I’m actually living with the characters. One of those shows that if I see the character on the streets, I won’t remember them by their real name but by their character name.\n\n\n\nFor example, Chandler (from friends) is not Matthew Perry for me. I know his real name but he’s always Chandler for me. Same goes for Sheldon (Jim Parsons), Mike Ross (Patrick J. Adams), and Will McAvoy (Jeff Daniels). They’re always their characters for me. I know it may sound bad or rude but it’s just like that. RIP John Spencer is Leo, Martin Sheen is Jed, Bradley Whitford is my dear Josh, Rob Lowe is Sam, Allison Janney is C.J., but, but, Dule Hill is Alex Williams from Suits.\n\n\n\nSpeaking of other shows, I first watched The Newsroom, and then went to West Wing. American political drama started for me with The Newsroom. I loved what Aaron Sorkin did and got interested to watch West Wing as well.\n\n\n\nI don’t have a lot of time in the day. Between working and studying, there’s not much time left to do anything beside eating and getting some rest. That’s why I usually binge-watch series. I download them on my phone and computer and watch them before I go to sleep. I wake up early so I have to manage how many episodes I watch so I an get few hours of rest.\n\n\n\nIt’s been tiring these past few months. Heavy pressure and complications in my life makes time run very slower than usual. I think all people experience this. It doesn’t need you to be a scientist to be sure that time is relative. Sometimes I think to myself, was Einstein going through a personal difficulty when he came up with the theory of relative time?\n\n\n\nFrom Iran Protests to economic disaster we’re experiencing right now, everything seems to be falling to hell. IRR was the least valuable currency in the world but it’s even getting worse right now. Seems that politicians are not tired of messing with people. Sometimes I wish I was living in the West Wing virtual world with Jed Bartlet as my president. He seemed to really care about people.\n\n\n\nI’m not the strapping young Muslim socialist I used to be (Obama said it). I got softened. I more align with Bernie than Obama. I used to align with Norman Thomas and before that, Abbie Hoffman. I was wondering if the system does this to people. Making them tired and turning them to what it likes. Creating drama after drama, difficulties and complex problems, out-of-touch disasters in life, etc. etc. to make you tired of even trying to change anything.\n\n\n\nThat’s my conspiracy theory. There’s a group of people, 100 of them, that decide about disasters in third-world countries to protect ones in advanced states. 100 for disasters, 100 to control the economy, 100 for war and peace stuff, and 100 for advertising these correctly. I might just throw another 100 just in case there’s need for another group. So 500 people, hard-working people, that control the world. They ought to be very hard-working. It’s no easy job to make world shit like this, pardon my French.\n\n\n\nIt’s been 20 years since I first thought to myself when this hell will end and we feel peace and prosperity. Even with relative time it should have been passed right now. It’s taking too long to end. Even with the feeling that everything is going fast in world, it’s taking too long. I’m getting tired and I’m young, relatively. I know people who’ve been tired for 60 years now.\n\n\n\nI feel like the captain in the book of “The Crab with the Golden Claws.” Captain asked Tin Tin “what a week, huh?” and Tin Tin replies with somehow a shock: “Captain, it’s Wednesday”. I can feel the disappointment in the captain."
              }
            ],
            "published": [
              "2023-02-27T12:29:39+0330"
            ]
          },
          "id": "post-5451"
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "name": [
              "I’m NOT changing my license!"
            ],
            "content": [
              {
                "html": "<p>I was reading <a href=\"https://zenhabits.net/\">Zen Habits</a> and it made me thinking about changing my blog’s license to public domain and I was going to do it. But I thought about it and I thought about it hard and I realized then I might change the license of any code or program I wrote to public domain as well, and it felt wrong.</p>\n\n\n\n<p>I’m a <a href=\"https://www.gnu.org/philosophy/free-sw.html\">free software</a> person. I care about software freedom and that’s why I advocate for GNU GPL family of licenses. GNU GPL license makes sure that you have freedom to do anything with your copy but you have to keep it free. If I truly advocate for freedom, I think I wouldn’t want my piece of software to become proprietary. And I thought the same argument goes for other forms of published work.</p>\n\n\n\n<p>I want people to be able to do whatever they want with my published works, and I sometimes don’t even care if they give me credit, but the difference my Creative Commons license makes is that it requires people to keep the work under the same license. They can do whatever they want, even profit from it financially, but they don’t have the right to limit other people from freedoms they were given to.</p>\n\n\n\n<p>The GNU GPL family of licenses do the same. If you publish your code or program under the GPL, the users will be entitled to the four essential freedoms but they won’t be able to make the software proprietary. If you license your work under BSDs or Expat, you’ll give the user right to prevent other people from benefiting of the same rights you gave the user.</p>\n\n\n\n<p>I care about freedom. Free culture is as important to me as free software but also as much as I advocate for copyleft in software, I advocate for it in other forms of publications. I believe the right to freedom in any matter should not be put in hands of someone else thus someone should not be able to restrict other people from the freedoms they are are benefiting from.</p>\n\n\n\n<p>If I was given the freedom to walk in a beach, I shouldn’t be able to build walls and restrict others from enjoying the beach. I was given the freedom to speak, then I shouldn’t be able to restrict other people from speaking. That’s how copyleft works. You’re enjoying your freedoms thus you can’t limit others. You can share what you have if you want only if you spread the freedom you were given.</p>",
                "value": "I was reading Zen Habits and it made me thinking about changing my blog’s license to public domain and I was going to do it. But I thought about it and I thought about it hard and I realized then I might change the license of any code or program I wrote to public domain as well, and it felt wrong.\n\n\n\nI’m a free software person. I care about software freedom and that’s why I advocate for GNU GPL family of licenses. GNU GPL license makes sure that you have freedom to do anything with your copy but you have to keep it free. If I truly advocate for freedom, I think I wouldn’t want my piece of software to become proprietary. And I thought the same argument goes for other forms of published work.\n\n\n\nI want people to be able to do whatever they want with my published works, and I sometimes don’t even care if they give me credit, but the difference my Creative Commons license makes is that it requires people to keep the work under the same license. They can do whatever they want, even profit from it financially, but they don’t have the right to limit other people from freedoms they were given to.\n\n\n\nThe GNU GPL family of licenses do the same. If you publish your code or program under the GPL, the users will be entitled to the four essential freedoms but they won’t be able to make the software proprietary. If you license your work under BSDs or Expat, you’ll give the user right to prevent other people from benefiting of the same rights you gave the user.\n\n\n\nI care about freedom. Free culture is as important to me as free software but also as much as I advocate for copyleft in software, I advocate for it in other forms of publications. I believe the right to freedom in any matter should not be put in hands of someone else thus someone should not be able to restrict other people from the freedoms they are are benefiting from.\n\n\n\nIf I was given the freedom to walk in a beach, I shouldn’t be able to build walls and restrict others from enjoying the beach. I was given the freedom to speak, then I shouldn’t be able to restrict other people from speaking. That’s how copyleft works. You’re enjoying your freedoms thus you can’t limit others. You can share what you have if you want only if you spread the freedom you were given."
              }
            ],
            "published": [
              "2023-01-23T12:52:36+0330"
            ]
          },
          "id": "post-5444"
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "name": [
              "The purpose of AI"
            ],
            "content": [
              {
                "html": "<p>About a year ago when we talked about artificial intelligence and machine learning, what we meant was a machine getting used to some routines or somehow understanding an algorithm and order of matters happening so it can respond in a certain way. That may sound complicated but in comparison to what we are experience right now, it’s quite simple.</p>\n\n\n\n<p>What we have right now is marvelous and very much advanced. Of course it will improve day to day and maybe another year from now what we currently have may seem even stupid but we got to compare it to what we had before to see how much progress we made.</p>\n\n\n\n<p>However, the real purpose of AI and the path we’re going is not exactly what I believe we had in mind when we first started working on it. We built artificial intelligence to make our lives easier so we can be able to focus on what truly matters to us as human race. I believe when we started the machines and when we first started to replace part of the labor and work with automatons what we had in mind was to finally replace humans with machines not in what we enjoyed doing but in what we believed is exploiting our essence.</p>\n\n\n\n<p>Today, with all the improved codes and computers running AI, we are forgetting what we had in mind when we first started. We are now experimenting with artificial intelligence that writes essays and articles for us. We are experimenting to hand over what we were pleased to do to a robot. Writing an article had a purpose of sharing ideas and teaching people of a point of view. Now we are training robots to prove points for us, like if we’re in a war.</p>\n\n\n\n<p>We  are not all internet trolls who are fighting and trying to win an argument at all costs. We are people of reason and intellectual who have good will and intentions in our souls and bodies, so we don’t need a robot to write an article on our behalf and prove, in any way, that our point is valid. What is the point of that article if it prevents us from thinking?</p>\n\n\n\n<p>We are now experimenting robots and so-called intelligence that is creating art for us. Art used to be an escape for us humans. It was a form of creation that made us feel needed, made us feel empowered, it gives us a way to invent a new reality for ourselves in which everything’s placed according our will and ideas. And the satisfaction was not from the result or what others would see, it was from the work we put in it and every detail that we thought about and cared deeply with passion to create a thing with our bare hands.</p>\n\n\n\n<p>Now there’s a robot that will learn from what others have created and you just tell it to create a portrait of unicorn with purple scary eyes and it will give it to you in few seconds. Where is the fun? Where is the satisfaction? Who is the real artist here? Is it you? Is it the robot? Is it the creator of the robot? Or is it the actual creators of portraits that the machine learnt from them?</p>\n\n\n\n<p>Machines supposed to write our emails and clean our houses and run our factories and bring us food so we can focus on art and philosophy and everything else we enjoyed. We are going to the wrong end on the wrong road. We weren’t supposed to create machines that mass produce art so we can focus on labor, it was quite opposite.</p>\n\n\n\n<p>I believe it is wrong and it should be prohibited. We all have seen movies like Matrix that machines finally enslave the human race and forced us to do the labor but what we’re doing now is to do it voluntarily. We were frightened that machines some day can think for themselves and purge us all or force us to give up on what we truly loved and now we are happily training them to do what we love and replace us where we love to be and force us to where we always hated.</p>\n\n\n\n<p>This article could be produced with an AI. I just needed to write a question that “how modern AI will act like Matrix and replace us from creators of art and put us to labor instead?” and it would most probably write the same arguments. It’s nice because then I could argue that even the machines know it but happily machines don’t think.</p>\n\n\n\n<p>They don’t think so they should not be put in a position to decide for an important matter. Happily, we’re not there yet but we have started to put them in an important place to think instead of us and replace us in where I consider one of the most important aspects of humanity which is art.</p>\n\n\n\n<p>Instead of developing intelligence to create art, we should use this intelligence to better our farming and food producing and solve human crises like hunger, education reform, environmental issues, and freedom-related matters.</p>\n\n\n\n<p>I believe that is the true purpose of AI and that is what we need to do. </p>",
                "value": "About a year ago when we talked about artificial intelligence and machine learning, what we meant was a machine getting used to some routines or somehow understanding an algorithm and order of matters happening so it can respond in a certain way. That may sound complicated but in comparison to what we are experience right now, it’s quite simple.\n\n\n\nWhat we have right now is marvelous and very much advanced. Of course it will improve day to day and maybe another year from now what we currently have may seem even stupid but we got to compare it to what we had before to see how much progress we made.\n\n\n\nHowever, the real purpose of AI and the path we’re going is not exactly what I believe we had in mind when we first started working on it. We built artificial intelligence to make our lives easier so we can be able to focus on what truly matters to us as human race. I believe when we started the machines and when we first started to replace part of the labor and work with automatons what we had in mind was to finally replace humans with machines not in what we enjoyed doing but in what we believed is exploiting our essence.\n\n\n\nToday, with all the improved codes and computers running AI, we are forgetting what we had in mind when we first started. We are now experimenting with artificial intelligence that writes essays and articles for us. We are experimenting to hand over what we were pleased to do to a robot. Writing an article had a purpose of sharing ideas and teaching people of a point of view. Now we are training robots to prove points for us, like if we’re in a war.\n\n\n\nWe  are not all internet trolls who are fighting and trying to win an argument at all costs. We are people of reason and intellectual who have good will and intentions in our souls and bodies, so we don’t need a robot to write an article on our behalf and prove, in any way, that our point is valid. What is the point of that article if it prevents us from thinking?\n\n\n\nWe are now experimenting robots and so-called intelligence that is creating art for us. Art used to be an escape for us humans. It was a form of creation that made us feel needed, made us feel empowered, it gives us a way to invent a new reality for ourselves in which everything’s placed according our will and ideas. And the satisfaction was not from the result or what others would see, it was from the work we put in it and every detail that we thought about and cared deeply with passion to create a thing with our bare hands.\n\n\n\nNow there’s a robot that will learn from what others have created and you just tell it to create a portrait of unicorn with purple scary eyes and it will give it to you in few seconds. Where is the fun? Where is the satisfaction? Who is the real artist here? Is it you? Is it the robot? Is it the creator of the robot? Or is it the actual creators of portraits that the machine learnt from them?\n\n\n\nMachines supposed to write our emails and clean our houses and run our factories and bring us food so we can focus on art and philosophy and everything else we enjoyed. We are going to the wrong end on the wrong road. We weren’t supposed to create machines that mass produce art so we can focus on labor, it was quite opposite.\n\n\n\nI believe it is wrong and it should be prohibited. We all have seen movies like Matrix that machines finally enslave the human race and forced us to do the labor but what we’re doing now is to do it voluntarily. We were frightened that machines some day can think for themselves and purge us all or force us to give up on what we truly loved and now we are happily training them to do what we love and replace us where we love to be and force us to where we always hated.\n\n\n\nThis article could be produced with an AI. I just needed to write a question that “how modern AI will act like Matrix and replace us from creators of art and put us to labor instead?” and it would most probably write the same arguments. It’s nice because then I could argue that even the machines know it but happily machines don’t think.\n\n\n\nThey don’t think so they should not be put in a position to decide for an important matter. Happily, we’re not there yet but we have started to put them in an important place to think instead of us and replace us in where I consider one of the most important aspects of humanity which is art.\n\n\n\nInstead of developing intelligence to create art, we should use this intelligence to better our farming and food producing and solve human crises like hunger, education reform, environmental issues, and freedom-related matters.\n\n\n\nI believe that is the true purpose of AI and that is what we need to do."
              }
            ],
            "published": [
              "2023-01-20T13:21:59+0330"
            ]
          },
          "id": "post-5429"
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "name": [
              "Aim for freedom tech"
            ],
            "content": [
              {
                "html": "<p>While people are still publishing their end-of-the-year lists and new year resolutions, and while people are still debating about whether social networks should provide a safe space or a complete free speech environment, many people around the world are struggling to connect to internet.</p>\n\n\n\n<p>The situation in Iran is terrible. Internet is heavily censored and people are facing shutdowns on a daily basis. Almost all popular messengers, including WhatsApp, Telegram, and Signal are blocked and there are reports of instances of federated messengers, such as XMPP and Matrix, being blocked as well.</p>\n\n\n\n<p>Almost all popular social networks such as Twitter, Facebook, Instagram, and many instances of Mastodon are blocked and people can’t use them freely. Even if they can use them, their posts may be used as evidence of criminal activity, labeled as “action against national security” or “combat against god” or even “insulting the supreme leader.”</p>\n\n\n\n<p>The free VPNs and anti-censorship tools are blocked as well, ironically. No popular VPN is working as intended and people rely on paid domestic VPN providers which on many cases are very dangerous. They either give away users’ data to authorities or are designed as spyware. This leaves people vulnerable to a lot of harm simply for trying to connect to free internet and get free flow of information.</p>\n\n\n\n<p>The goal of every developer focused (or even not focused) on human rights should be providing and developing tech that can help people access free internet and information. Anti-censorship tools and new tech that can send and receive data.</p>\n\n\n\n<p>One example of this effort is the awesome project of <a href=\"https://www.toosheh.org/\">Toosheh</a>. They are a satellite filecasting technology deployed in Iran and the Middle East that use common satellite equipment to deliver digital content without relying on access to the Internet. I have no idea how many people receive information and needed  stuff from this project but this is a very useful and helping project.</p>\n\n\n\n<p>In recent days, I’ve heard WhatsApp is deploying a feature that lets people connect to the messenger using proxies. This probably is the same effort done by Telegram and Signal. Many people in Iran are using MTProto proxies to be able to connect to Telegram and communicate with each other. Telegram is the second (if not first) most used messenger in Iran. Similar proxy feature was added to Signal but I doubt that many people use it. WhatsApp providing proxies will be very much appreciated by the public as many people rely on WhatsApp to communicate with each other.</p>\n\n\n\n<p>As much as I advocate for <a href=\"https://www.gnu.org/philosophy/free-sw.html\">free (libre) technology and software</a>, in this situation, connecting people is far more important to not only me but everybody who is concerned with the situation we are facing in the country.</p>\n\n\n\n<p>If you’re a software/hardware person or a techie, you surely can help developing tools to help people not only in Iran, but every other place or people needing tools to access basic available daily stuff such as a social network or a communication tool or even reading an article and getting information. You can contact your friends discussing the needs and required tools to get started. The simplest act can be running Snowflake extensions and help people connecting to free internet using Tor.</p>\n\n\n\n<p>As I said, this is not just a matter of Iran. There are many reports of internet shutdowns or heavy censorship in India, China, countries of Middle East, Cuba, Venezuela, Brazil, and many others. So, please, if you can do something about it, many people will appreciate your efforts.</p>\n\n\n\n<p> </p>",
                "value": "While people are still publishing their end-of-the-year lists and new year resolutions, and while people are still debating about whether social networks should provide a safe space or a complete free speech environment, many people around the world are struggling to connect to internet.\n\n\n\nThe situation in Iran is terrible. Internet is heavily censored and people are facing shutdowns on a daily basis. Almost all popular messengers, including WhatsApp, Telegram, and Signal are blocked and there are reports of instances of federated messengers, such as XMPP and Matrix, being blocked as well.\n\n\n\nAlmost all popular social networks such as Twitter, Facebook, Instagram, and many instances of Mastodon are blocked and people can’t use them freely. Even if they can use them, their posts may be used as evidence of criminal activity, labeled as “action against national security” or “combat against god” or even “insulting the supreme leader.”\n\n\n\nThe free VPNs and anti-censorship tools are blocked as well, ironically. No popular VPN is working as intended and people rely on paid domestic VPN providers which on many cases are very dangerous. They either give away users’ data to authorities or are designed as spyware. This leaves people vulnerable to a lot of harm simply for trying to connect to free internet and get free flow of information.\n\n\n\nThe goal of every developer focused (or even not focused) on human rights should be providing and developing tech that can help people access free internet and information. Anti-censorship tools and new tech that can send and receive data.\n\n\n\nOne example of this effort is the awesome project of Toosheh. They are a satellite filecasting technology deployed in Iran and the Middle East that use common satellite equipment to deliver digital content without relying on access to the Internet. I have no idea how many people receive information and needed  stuff from this project but this is a very useful and helping project.\n\n\n\nIn recent days, I’ve heard WhatsApp is deploying a feature that lets people connect to the messenger using proxies. This probably is the same effort done by Telegram and Signal. Many people in Iran are using MTProto proxies to be able to connect to Telegram and communicate with each other. Telegram is the second (if not first) most used messenger in Iran. Similar proxy feature was added to Signal but I doubt that many people use it. WhatsApp providing proxies will be very much appreciated by the public as many people rely on WhatsApp to communicate with each other.\n\n\n\nAs much as I advocate for free (libre) technology and software, in this situation, connecting people is far more important to not only me but everybody who is concerned with the situation we are facing in the country.\n\n\n\nIf you’re a software/hardware person or a techie, you surely can help developing tools to help people not only in Iran, but every other place or people needing tools to access basic available daily stuff such as a social network or a communication tool or even reading an article and getting information. You can contact your friends discussing the needs and required tools to get started. The simplest act can be running Snowflake extensions and help people connecting to free internet using Tor.\n\n\n\nAs I said, this is not just a matter of Iran. There are many reports of internet shutdowns or heavy censorship in India, China, countries of Middle East, Cuba, Venezuela, Brazil, and many others. So, please, if you can do something about it, many people will appreciate your efforts."
              }
            ],
            "published": [
              "2023-01-06T12:59:05+0330"
            ]
          },
          "id": "post-5425"
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "name": [
              "Don’t think positive!"
            ],
            "content": [
              {
                "html": "<p>Sometimes I just want to punch people in the face when they ask me to think positive. Stay positive they say. What a brilliant idea.</p>\n\n\n\n<p>I’m not angry though. I just chose to use those words to express how stupid it is to tell people stay positive and how frustrated I get when I hear that.</p>\n\n\n\n<p>Yet sometimes you should be angry. Sometimes you need to compel people to be afraid of you and your potential. It’s not good to always be positive.</p>\n\n\n\n<p>It’s like someone holding your head under the water and they guy next to you tells you think positive. I’m pretty sure even the one holding your head will punch that person.</p>\n\n\n\n<p>I guess sometimes it’s because they don’t understand the difference between being positive and being hopeful. In worst situations you don’t need to be positive, you need to be hopeful. It’s hope that will move you forward, not positivity.</p>\n\n\n\n<p>You can be fearful yet filled with hope. Fear is normal. It’s a defense mechanism for us to so our best to get the results we need, in stressful and less-likely-to-win conditions. We should learn to use it properly for better of ourselves.</p>\n\n\n\n<p>Being positive is for idiots. It makes us weak while those who are not positive, are doubtful and handle their fears and anger, do much better and actually accomplish something.</p>\n\n\n\n<p>I’m not a positive person. It doesn’t mean that I’m unpleasant to be around or I’m not likable or evil, it just means I just don’t give up trying. I don’t bow down to the situation I am in and I don’t accept the idiocy that everything is going to be better just by staying positive.</p>\n\n\n\n<p>I actually work to reach what I want. I do what I need to do and for that I get what I want. I learned to manage my fears, turn my anger to energy and force, control my stress and turn it to focus and strength, and finally handle them the best I can to reach my destination.</p>\n\n\n\n<p>I don’t want to be positive. I want to be accomplished.</p>\n\n\n\n<p> </p>",
                "value": "Sometimes I just want to punch people in the face when they ask me to think positive. Stay positive they say. What a brilliant idea.\n\n\n\nI’m not angry though. I just chose to use those words to express how stupid it is to tell people stay positive and how frustrated I get when I hear that.\n\n\n\nYet sometimes you should be angry. Sometimes you need to compel people to be afraid of you and your potential. It’s not good to always be positive.\n\n\n\nIt’s like someone holding your head under the water and they guy next to you tells you think positive. I’m pretty sure even the one holding your head will punch that person.\n\n\n\nI guess sometimes it’s because they don’t understand the difference between being positive and being hopeful. In worst situations you don’t need to be positive, you need to be hopeful. It’s hope that will move you forward, not positivity.\n\n\n\nYou can be fearful yet filled with hope. Fear is normal. It’s a defense mechanism for us to so our best to get the results we need, in stressful and less-likely-to-win conditions. We should learn to use it properly for better of ourselves.\n\n\n\nBeing positive is for idiots. It makes us weak while those who are not positive, are doubtful and handle their fears and anger, do much better and actually accomplish something.\n\n\n\nI’m not a positive person. It doesn’t mean that I’m unpleasant to be around or I’m not likable or evil, it just means I just don’t give up trying. I don’t bow down to the situation I am in and I don’t accept the idiocy that everything is going to be better just by staying positive.\n\n\n\nI actually work to reach what I want. I do what I need to do and for that I get what I want. I learned to manage my fears, turn my anger to energy and force, control my stress and turn it to focus and strength, and finally handle them the best I can to reach my destination.\n\n\n\nI don’t want to be positive. I want to be accomplished."
              }
            ],
            "published": [
              "2022-12-01T11:19:18+0330"
            ]
          },
          "id": "post-5415"
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "name": [
              "You are worthy"
            ],
            "content": [
              {
                "html": "<p>Watching Marvel Cinematic Universe movies, I know all those saviors needed one thing to become a hero and that was being worthy of helping people and selflessness. What made those people recognized as heroes is that they put aside their differences and accepted their weaknesses yet became whole as a team, became strong, and defeated most impossible enemies.</p>\n\n\n\n<p>I love Marvel movies because they make me feel hopeful. They teach us something that maybe other movies can’t even mention and that’s how a simplest act can make an impact complex and big enough to save the entire world.</p>\n\n\n\n<p>Most of the times I hear people worrying about not being enough to do something or not being worthy of acting in defense of people, I just remember how some normal human beings with just one or two special talents could save the world in our favorite movies.</p>\n\n\n\n<p>It’s true that those are just movies but the lesson we learn from those movies are real. I believe millions of people fighting against a common enemy are far more stronger than a team of 10 people with robots or magic.</p>\n\n\n\n<p>These fighters for freedom are worthy. Worthy of lifting Thor’s hammer, worthy of becoming an Avenger, and worthy of becoming the leaders of war for freedom.</p>\n\n\n\n<p>I remember someone telling me a wonderful story about our true value: a while back someone gave a watch to me. He handed me a wristwatch. I opened the box and it was a beautiful watch. It wasn’t super fancy but it was attractive. I brought it to home and put it in my desk drawer.</p>\n\n\n\n<p>Couple of months later I opened the drawer to take something out and I saw the watch sitting there. I looked at it again and I thought it costs a few hundred bucks but for some reason I did a web search for its price and when I did I nearly passed out. The exact watch came out, it was worth over 10 thousand dollars.</p>\n\n\n\n<p>It was from a very famous prestigious watchmaker. I’ve seen a lot of other watches that cost several hundred dollars but because of the manufacturer this watch was extremely valuable. You could put it side by side of other watches and you wouldn’t see much difference. Looked average, ordinary, copied. On the surface it looked the same.</p>\n\n\n\n<p>But what gave it its value was who made it. Sometimes we don’t realize who we are because we see other people just like us. We may look average, ordinary, like nothing stands out but there’s something about us that makes us extremely valuable.</p>\n\n\n\n<p>We’re not a copy, or a knockoff, we are original. We can’t get any more prestigious than what we are now. Nothing is more valuable than what we are.</p>\n\n\n\n<p>Never think of yourself as worthless or incapable. You are capable of holding an entire chain together and doing the impossible. Simplest act from you can affect the whole system, the whole universe, and result in doing the absolute impossible.</p>\n\n\n\n<p>You are not a single person, you are what the chain needs to remain intact. You, alone, can’t do anything but you are what the chain needs to remain intact. You may be the first part of the chain or the last one, either way, you are doing greatest work you can.</p>\n\n\n\n<p>Never think of yourself as worthless or not valued. Never think that you are alone or you can’t do anything because you feel lonely in your situation. Think about how you inspire others or how you can start something amazing enough to change everything.</p>",
                "value": "Watching Marvel Cinematic Universe movies, I know all those saviors needed one thing to become a hero and that was being worthy of helping people and selflessness. What made those people recognized as heroes is that they put aside their differences and accepted their weaknesses yet became whole as a team, became strong, and defeated most impossible enemies.\n\n\n\nI love Marvel movies because they make me feel hopeful. They teach us something that maybe other movies can’t even mention and that’s how a simplest act can make an impact complex and big enough to save the entire world.\n\n\n\nMost of the times I hear people worrying about not being enough to do something or not being worthy of acting in defense of people, I just remember how some normal human beings with just one or two special talents could save the world in our favorite movies.\n\n\n\nIt’s true that those are just movies but the lesson we learn from those movies are real. I believe millions of people fighting against a common enemy are far more stronger than a team of 10 people with robots or magic.\n\n\n\nThese fighters for freedom are worthy. Worthy of lifting Thor’s hammer, worthy of becoming an Avenger, and worthy of becoming the leaders of war for freedom.\n\n\n\nI remember someone telling me a wonderful story about our true value: a while back someone gave a watch to me. He handed me a wristwatch. I opened the box and it was a beautiful watch. It wasn’t super fancy but it was attractive. I brought it to home and put it in my desk drawer.\n\n\n\nCouple of months later I opened the drawer to take something out and I saw the watch sitting there. I looked at it again and I thought it costs a few hundred bucks but for some reason I did a web search for its price and when I did I nearly passed out. The exact watch came out, it was worth over 10 thousand dollars.\n\n\n\nIt was from a very famous prestigious watchmaker. I’ve seen a lot of other watches that cost several hundred dollars but because of the manufacturer this watch was extremely valuable. You could put it side by side of other watches and you wouldn’t see much difference. Looked average, ordinary, copied. On the surface it looked the same.\n\n\n\nBut what gave it its value was who made it. Sometimes we don’t realize who we are because we see other people just like us. We may look average, ordinary, like nothing stands out but there’s something about us that makes us extremely valuable.\n\n\n\nWe’re not a copy, or a knockoff, we are original. We can’t get any more prestigious than what we are now. Nothing is more valuable than what we are.\n\n\n\nNever think of yourself as worthless or incapable. You are capable of holding an entire chain together and doing the impossible. Simplest act from you can affect the whole system, the whole universe, and result in doing the absolute impossible.\n\n\n\nYou are not a single person, you are what the chain needs to remain intact. You, alone, can’t do anything but you are what the chain needs to remain intact. You may be the first part of the chain or the last one, either way, you are doing greatest work you can.\n\n\n\nNever think of yourself as worthless or not valued. Never think that you are alone or you can’t do anything because you feel lonely in your situation. Think about how you inspire others or how you can start something amazing enough to change everything."
              }
            ],
            "published": [
              "2022-11-16T18:37:21+0330"
            ]
          },
          "id": "post-5407"
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "name": [
              "How does Fediverse work?"
            ],
            "content": [
              {
                "html": "<a href=\"https://alirezahayati.com/2022/11/09/how-does-fediverse-work/\" title=\"Permalink to How does Fediverse work?\"><img width=\"700\" height=\"394\" src=\"https://alirezahayati.com/wp-content/uploads/2022/11/4D8A5A1D-93DD-4F48-8473-CDC1E9E62800-700x394.jpeg\" class=\"attachment-independent_publisher_post_thumbnail size-independent_publisher_post_thumbnail wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://alirezahayati.com/wp-content/uploads/2022/11/4D8A5A1D-93DD-4F48-8473-CDC1E9E62800-700x394.jpeg 700w, https://alirezahayati.com/wp-content/uploads/2022/11/4D8A5A1D-93DD-4F48-8473-CDC1E9E62800-300x169.jpeg 300w, https://alirezahayati.com/wp-content/uploads/2022/11/4D8A5A1D-93DD-4F48-8473-CDC1E9E62800-1024x576.jpeg 1024w, https://alirezahayati.com/wp-content/uploads/2022/11/4D8A5A1D-93DD-4F48-8473-CDC1E9E62800-768x432.jpeg 768w, https://alirezahayati.com/wp-content/uploads/2022/11/4D8A5A1D-93DD-4F48-8473-CDC1E9E62800-1536x864.jpeg 1536w, https://alirezahayati.com/wp-content/uploads/2022/11/4D8A5A1D-93DD-4F48-8473-CDC1E9E62800.jpeg 1920w\" sizes=\"(max-width: 700px) 100vw, 700px\"></a>\n\t\t\t\n\t\t\t\n<p>As Elon Musk took over Twitter, people are migrating to alternative social networks. One of them being Mastodon, it is a decentralized social network based on a protocol named ActivityPub. This protocol is what Fediverse is built upon.</p>\n\n\n\n<p>But we don’t want to talk about the technical stuff behind the Fediverse. What we want to talk about is simply how Fediverse and/or Mastodon work. Mastodon is just a part of Fediverse, not all of it. Fediverse is a word built by mixing the two words of federation and universe.</p>\n\n\n\n<p>The Fediverse is a network of connected different social platforms making it possible for users to communicate with each other. For example, they can follow each other or send posts to each other or simply share whatever they want without being forced to sign up on a single centralized social network, or a web site, app, whatsoever.</p>\n\n\n\n<p>Mastodon, Pleroma, GNU Social, and Pixelfed are some of these different social networks all connected to each other using the protocol they are built upon. Each of those social networks have many instances or servers. So they are federated with each other and each of those federations are also federated to other federations.</p>\n\n\n\n<p>If it’s too complicated for you, imagine earth. We have multiple countries, all having relationships with each other, and within every country, there are many cities which are also connected with each other. Now every city also can connect to another city whether it’s inside the country or outside.</p>\n\n\n\n <a href=\"https://alirezahayati.com/2022/11/09/how-does-fediverse-work/#more-5367\" class=\"more-link\">Continue reading <span class=\"meta-nav\">→</span></a>",
                "value": "As Elon Musk took over Twitter, people are migrating to alternative social networks. One of them being Mastodon, it is a decentralized social network based on a protocol named ActivityPub. This protocol is what Fediverse is built upon.\n\n\n\nBut we don’t want to talk about the technical stuff behind the Fediverse. What we want to talk about is simply how Fediverse and/or Mastodon work. Mastodon is just a part of Fediverse, not all of it. Fediverse is a word built by mixing the two words of federation and universe.\n\n\n\nThe Fediverse is a network of connected different social platforms making it possible for users to communicate with each other. For example, they can follow each other or send posts to each other or simply share whatever they want without being forced to sign up on a single centralized social network, or a web site, app, whatsoever.\n\n\n\nMastodon, Pleroma, GNU Social, and Pixelfed are some of these different social networks all connected to each other using the protocol they are built upon. Each of those social networks have many instances or servers. So they are federated with each other and each of those federations are also federated to other federations.\n\n\n\nIf it’s too complicated for you, imagine earth. We have multiple countries, all having relationships with each other, and within every country, there are many cities which are also connected with each other. Now every city also can connect to another city whether it’s inside the country or outside.\n\n\n\n Continue reading →"
              }
            ],
            "published": [
              "2022-11-09T10:18:38+0330"
            ]
          },
          "id": "post-5367"
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "name": [
              "Obeying the law"
            ],
            "content": [
              {
                "html": "<p>You would have to agree with me that all people should obey just laws but I would also say that unjust law is no law at all. And when we find an unjust law, I think we have a moral obligation to take a stand against it.</p>\n\n\n\n<p>I do feel there are two types of laws: one is a just law and one is an unjust law. We all have moral obligations to disobey unjust laws because noncooperation with evil is as much as moral obligation as is cooperation with good.</p>\n\n\n\n<p>Any man who breaks a law that conscience tells him is unjust and willingly accepts the penalty by staying in jail in order to arouse the conscience of the community on the injustice of the law is in that moment expressing the very highest respect for law.</p>\n\n\n\n<p>Laws have been made for us to have a better life, and to provide a good condition for living in communities. At least it is the purpose that we have been told the laws have. However, laws were supposed to trigger the moral obligation of humans toward each other in societies to do good and avoid evil.</p>\n\n\n\n<p>Since we made laws zero and one, it is doing more damage than good to the soul and spirit of the original purpose and idea of having laws. Since the creation of classes and since one class made to rule and control other classes, laws have changed to protect the benefits of the master class against other people.</p>\n\n\n\n<p>The first two paragraphs of this writing came from speeches of Martin Luther King Jr. when he was fighting against the tyranny of segregation. Many laws, such as slavery, or forced way of clothing, or forced way of eating or drinking (like the prohibition), were unjust and people fought against them for a better living.</p>\n\n\n\n<p>It is, now, obvious to us that those laws were unjust and we praise those who risked their life to change those laws. However, at the time those laws were in place, people were told to obey the law no matter what. If everyone were obeying those unjust laws, there would have been no change and no advancement of our condition and living situation.</p>\n\n\n\n<p>The laws were made for us to do good and to avoid evil and for us to be able to punish those who do evil in order to have more pure and safe communities. Since we forgot the purpose of the creation of the law, we have been forced to obey bunch of papers written by a higher class with the purpose of control.</p>\n\n\n\n<p>The controlling class is now fighting against the very people who respected these laws for a long time and wishes to break them into a new form of slavery. A form of slavery that people are not forced to do what the master class wants by whips but by manipulating them to believe what they do is morally correct and they are obligated to do them for the good of themselves.</p>\n\n\n\n<p>The freedom of the minds of people will result in riots and revolutions against these tyrants and modern slave-owners.</p>\n\n\n\n<p>My brothers and sisters, we are living in a new slavery and we are bound by unjust laws to obey these lords and masters, but we are morally obligated to disobey the unjust laws forced on us and we are morally and humanly obligated to fight against these masters for the sake of ourselves and the good of people and for a better future.</p>\n\n\n\n<p>That is how we respect the law most. That is how we are supposed to treat laws.</p>",
                "value": "You would have to agree with me that all people should obey just laws but I would also say that unjust law is no law at all. And when we find an unjust law, I think we have a moral obligation to take a stand against it.\n\n\n\nI do feel there are two types of laws: one is a just law and one is an unjust law. We all have moral obligations to disobey unjust laws because noncooperation with evil is as much as moral obligation as is cooperation with good.\n\n\n\nAny man who breaks a law that conscience tells him is unjust and willingly accepts the penalty by staying in jail in order to arouse the conscience of the community on the injustice of the law is in that moment expressing the very highest respect for law.\n\n\n\nLaws have been made for us to have a better life, and to provide a good condition for living in communities. At least it is the purpose that we have been told the laws have. However, laws were supposed to trigger the moral obligation of humans toward each other in societies to do good and avoid evil.\n\n\n\nSince we made laws zero and one, it is doing more damage than good to the soul and spirit of the original purpose and idea of having laws. Since the creation of classes and since one class made to rule and control other classes, laws have changed to protect the benefits of the master class against other people.\n\n\n\nThe first two paragraphs of this writing came from speeches of Martin Luther King Jr. when he was fighting against the tyranny of segregation. Many laws, such as slavery, or forced way of clothing, or forced way of eating or drinking (like the prohibition), were unjust and people fought against them for a better living.\n\n\n\nIt is, now, obvious to us that those laws were unjust and we praise those who risked their life to change those laws. However, at the time those laws were in place, people were told to obey the law no matter what. If everyone were obeying those unjust laws, there would have been no change and no advancement of our condition and living situation.\n\n\n\nThe laws were made for us to do good and to avoid evil and for us to be able to punish those who do evil in order to have more pure and safe communities. Since we forgot the purpose of the creation of the law, we have been forced to obey bunch of papers written by a higher class with the purpose of control.\n\n\n\nThe controlling class is now fighting against the very people who respected these laws for a long time and wishes to break them into a new form of slavery. A form of slavery that people are not forced to do what the master class wants by whips but by manipulating them to believe what they do is morally correct and they are obligated to do them for the good of themselves.\n\n\n\nThe freedom of the minds of people will result in riots and revolutions against these tyrants and modern slave-owners.\n\n\n\nMy brothers and sisters, we are living in a new slavery and we are bound by unjust laws to obey these lords and masters, but we are morally obligated to disobey the unjust laws forced on us and we are morally and humanly obligated to fight against these masters for the sake of ourselves and the good of people and for a better future.\n\n\n\nThat is how we respect the law most. That is how we are supposed to treat laws."
              }
            ],
            "published": [
              "2022-11-02T08:56:03+0330"
            ]
          },
          "id": "post-5363"
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "name": [
              "Who is NIAC?"
            ],
            "content": [
              {
                "html": "<p>While the Iranian people are fighting for regime change, Iran regime lobby in United States, NIAC, is busy trying to reclaim the narrative and making it one of reform, and not regime change.</p>\n\n\n\n<p>But the Iranian people aren’t calling for reform, they’re calling for regime change. NIAC isn’t just a group which advocates for US-Iran relations, they are an active body of the Islamic regime.</p>\n\n\n\n<p>Now their activists are trying to twist the protests into an issue of forced hijab, or of economic stressors; anything to avoid admitting reality, that people are saying no to the Islamic regime.</p>\n\n\n\n<p>Their main talking point is that the left should make an Iran-deal and lift sanctions, as if that’s what causing the protests. NIAC founder, Trita Parsi, and NIAC activists such as Negar Mortazavi and Ellie Geranmayeh of the European Council of Foreign Relations, as well as Hoda Katebi, a hijabi fashion influencer, have all called for sanction relief.</p>\n\n\n\n<p>Sanctions have made life harder for Iranians but if sanctions are removed with Islamic regime still in power, none of that money will go to the Iranian people, as we saw during the time Hasan Rouhani took presidency.</p>\n\n\n\n<p>It will end up in Syria, Yemen, or Lebanon’s Hezbollah, in hands of terrorists, or maybe in pockets of regime leaders. That is the real reason that NIAC and its activists are lobbying for sanction relief so aggressively.</p>\n\n\n\n<p>NIAC (or better called regime reformist wing) want to preserve the Islamic regime at any cost, but the regime cannot be reformed.</p>\n\n\n\n<p>The problem is not economics or forced hijab (which the regime caused itself at the first place), it’s lack of free speech, free expression, free press, no due process, torture, corruption, funding of global terror, gender apartheid, and many more issues.</p>\n\n\n\n<p>That’s why rich, poor, young, old, men, and women are all protesting in the streets of Iran with one common goal: an end to the Islamic regime. To minimize the protests to hijab or economics is a slap in the face to those who already given their lives in this fight.</p>\n\n\n\n<p>Few days ago a consultant to NIAC, Reza Aslan, resigned due to the lack of trust for NIAC in the eyes of Iranian people worldwide. That’s how terrible they have been. They have been known for hurting people inside and outside of the country.</p>\n\n\n\n<p>NIAC cannot he trusted.</p>",
                "value": "While the Iranian people are fighting for regime change, Iran regime lobby in United States, NIAC, is busy trying to reclaim the narrative and making it one of reform, and not regime change.\n\n\n\nBut the Iranian people aren’t calling for reform, they’re calling for regime change. NIAC isn’t just a group which advocates for US-Iran relations, they are an active body of the Islamic regime.\n\n\n\nNow their activists are trying to twist the protests into an issue of forced hijab, or of economic stressors; anything to avoid admitting reality, that people are saying no to the Islamic regime.\n\n\n\nTheir main talking point is that the left should make an Iran-deal and lift sanctions, as if that’s what causing the protests. NIAC founder, Trita Parsi, and NIAC activists such as Negar Mortazavi and Ellie Geranmayeh of the European Council of Foreign Relations, as well as Hoda Katebi, a hijabi fashion influencer, have all called for sanction relief.\n\n\n\nSanctions have made life harder for Iranians but if sanctions are removed with Islamic regime still in power, none of that money will go to the Iranian people, as we saw during the time Hasan Rouhani took presidency.\n\n\n\nIt will end up in Syria, Yemen, or Lebanon’s Hezbollah, in hands of terrorists, or maybe in pockets of regime leaders. That is the real reason that NIAC and its activists are lobbying for sanction relief so aggressively.\n\n\n\nNIAC (or better called regime reformist wing) want to preserve the Islamic regime at any cost, but the regime cannot be reformed.\n\n\n\nThe problem is not economics or forced hijab (which the regime caused itself at the first place), it’s lack of free speech, free expression, free press, no due process, torture, corruption, funding of global terror, gender apartheid, and many more issues.\n\n\n\nThat’s why rich, poor, young, old, men, and women are all protesting in the streets of Iran with one common goal: an end to the Islamic regime. To minimize the protests to hijab or economics is a slap in the face to those who already given their lives in this fight.\n\n\n\nFew days ago a consultant to NIAC, Reza Aslan, resigned due to the lack of trust for NIAC in the eyes of Iranian people worldwide. That’s how terrible they have been. They have been known for hurting people inside and outside of the country.\n\n\n\nNIAC cannot he trusted."
              }
            ],
            "published": [
              "2022-10-23T20:07:17+0330"
            ]
          },
          "id": "post-5358"
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "name": [
              "Occupied"
            ],
            "content": [
              {
                "html": "<p>It’s been a month since nationwide protests in Iran started and it seems people are not willing to stop shouting their pains. People are hopeful that this time they can change something, even if not big enough.</p>\n\n\n\n<p>People are hopeful, and this is dangerous. Hope is the general source for motivation. Hope can move you forward to the point that you actually affect your environment and change.</p>\n\n\n\n<p>Since the start of the protests, many people have joined this movement, including Mehdi Mahdavikia, Ali Karimi, and Ali Daei. These are former football players for Hamburger SV and Bayern Munich football clubs. Some of the greatest ever football players in Iran.</p>\n\n\n\n<p>In a country that you can lose everything for practicing your free speech rights, these people speaking publicly against the system is a brave action. They are now under the risk of losing their wealth and their public image in state-controlled economy and media. I admire them for that bravery.</p>\n\n\n\n<p>Ali Daei, in an Instagram post, said that “in the current situation, silence is treason” and I agree with him. People have suffered enough from inconveniences and injustices imposed on them by the regime.</p>\n\n\n\n<p>Everything is blamed on foreign governments and spies. The regime takes no responsibility on anything. Even with videos showing police officers shooting people, the system doesn’t even recognize its own brutality and claims the shooters are foreign officers in police uniform doing this to spread mistrust in security forces.</p>\n\n\n\n<p>I am also tired. I was once a supporter of this regime, under the influence of state media and all the brainwashings done to me by strictly-controlled books and news published by this very government. I regret the time I spent supporting this regime.</p>\n\n\n\n<p>Sometimes I wonder what would happen if Iraq had won the eight-year war against Iran. Sometimes people ask me about what will we replace this regime with. I always think about it. What will we lose?</p>\n\n\n\n<p>The next government, the next regime, can’t be any worse. What will they do? Shut down the internet? Ban free speech? Shoot people? Economic disaster? No emotional, economical, and humane safety? Giving up the independence and freedom of the country? All has happened to us before in this very regime. It feels we are actually occupied by a foreign brutal force.</p>\n\n\n\n<p>People live in constant fear of getting arrested and imprisoned for their slightest criticism. I live in fear of getting arrested every time I write or speak critically against this regime, yet the system lies to us, looking in our eyes, that we have freedom.</p>\n\n\n\n<p>Supporters of the regime, some living in foreign countries, control what gets published in foreign media. Specially those in NIAC, National Iranian American Council, are constantly spreading the regime’s propaganda. This makes people more helpless, and more angry.</p>\n\n\n\n<p>People feel betrayed. Their fathers, brothers and sisters once started a revolution to make things better. They now feel betrayed and lied to by the very people they had hope in. They see the duality of system’s speeches and actions and hear the lies they’ve been told to.</p>\n\n\n\n<p>An example is hijab. Hijab is mandatory in Iran but children of  some government people and ayatollahs live with freedom of choosing their clothes and way of living in other countries, or privately inside the borders. While the morality police arrests our sisters, they wear bikinis and lie under sun and get tanned in European countries.</p>\n\n\n\n<p>People ask, why these people don’t force their own children to wear hijab? Of course their children are responsible for their own actions, but if their children are mature and responsible enough to choose, why they think they can force us to do what they say? Are we different? Are we not humans?</p>\n\n\n\n<p>We’re not sheeples, but we’re treated as such. We’re told to use what the regime wants, avoid what regime doesn’t like, speak and act as the system desires, and go where they need us to be. They see themselves as our shepherd and us as brainless sheeples who need protection.</p>\n\n\n\n<p>I am disgusted by all of these and just like our football legend, Ali Daei, I think silence is treason.</p>\n\n\n\n<p>Yet again, people are hopeful. People are motivated and braver than ever, determined to change the situation. They are moving forward with hope to achieve something greater for people. Hope is beautifully dangerous for the current situation. It can change everything.</p>",
                "value": "It’s been a month since nationwide protests in Iran started and it seems people are not willing to stop shouting their pains. People are hopeful that this time they can change something, even if not big enough.\n\n\n\nPeople are hopeful, and this is dangerous. Hope is the general source for motivation. Hope can move you forward to the point that you actually affect your environment and change.\n\n\n\nSince the start of the protests, many people have joined this movement, including Mehdi Mahdavikia, Ali Karimi, and Ali Daei. These are former football players for Hamburger SV and Bayern Munich football clubs. Some of the greatest ever football players in Iran.\n\n\n\nIn a country that you can lose everything for practicing your free speech rights, these people speaking publicly against the system is a brave action. They are now under the risk of losing their wealth and their public image in state-controlled economy and media. I admire them for that bravery.\n\n\n\nAli Daei, in an Instagram post, said that “in the current situation, silence is treason” and I agree with him. People have suffered enough from inconveniences and injustices imposed on them by the regime.\n\n\n\nEverything is blamed on foreign governments and spies. The regime takes no responsibility on anything. Even with videos showing police officers shooting people, the system doesn’t even recognize its own brutality and claims the shooters are foreign officers in police uniform doing this to spread mistrust in security forces.\n\n\n\nI am also tired. I was once a supporter of this regime, under the influence of state media and all the brainwashings done to me by strictly-controlled books and news published by this very government. I regret the time I spent supporting this regime.\n\n\n\nSometimes I wonder what would happen if Iraq had won the eight-year war against Iran. Sometimes people ask me about what will we replace this regime with. I always think about it. What will we lose?\n\n\n\nThe next government, the next regime, can’t be any worse. What will they do? Shut down the internet? Ban free speech? Shoot people? Economic disaster? No emotional, economical, and humane safety? Giving up the independence and freedom of the country? All has happened to us before in this very regime. It feels we are actually occupied by a foreign brutal force.\n\n\n\nPeople live in constant fear of getting arrested and imprisoned for their slightest criticism. I live in fear of getting arrested every time I write or speak critically against this regime, yet the system lies to us, looking in our eyes, that we have freedom.\n\n\n\nSupporters of the regime, some living in foreign countries, control what gets published in foreign media. Specially those in NIAC, National Iranian American Council, are constantly spreading the regime’s propaganda. This makes people more helpless, and more angry.\n\n\n\nPeople feel betrayed. Their fathers, brothers and sisters once started a revolution to make things better. They now feel betrayed and lied to by the very people they had hope in. They see the duality of system’s speeches and actions and hear the lies they’ve been told to.\n\n\n\nAn example is hijab. Hijab is mandatory in Iran but children of  some government people and ayatollahs live with freedom of choosing their clothes and way of living in other countries, or privately inside the borders. While the morality police arrests our sisters, they wear bikinis and lie under sun and get tanned in European countries.\n\n\n\nPeople ask, why these people don’t force their own children to wear hijab? Of course their children are responsible for their own actions, but if their children are mature and responsible enough to choose, why they think they can force us to do what they say? Are we different? Are we not humans?\n\n\n\nWe’re not sheeples, but we’re treated as such. We’re told to use what the regime wants, avoid what regime doesn’t like, speak and act as the system desires, and go where they need us to be. They see themselves as our shepherd and us as brainless sheeples who need protection.\n\n\n\nI am disgusted by all of these and just like our football legend, Ali Daei, I think silence is treason.\n\n\n\nYet again, people are hopeful. People are motivated and braver than ever, determined to change the situation. They are moving forward with hope to achieve something greater for people. Hope is beautifully dangerous for the current situation. It can change everything."
              }
            ],
            "published": [
              "2022-10-20T09:40:28+0330"
            ]
          },
          "id": "post-5354"
        }
      ]
    }
  ],
  "rels": {
    "profile": [
      "http://gmpg.org/xfn/11"
    ],
    "pingback": [
      "https://alirezahayati.com/xmlrpc.php"
    ],
    "canonical": [
      "https://alirezahayati.com/"
    ],
    "next": [
      "https://alirezahayati.com/page/2/"
    ],
    "alternate": [
      "https://alirezahayati.com/feed/",
      "https://alirezahayati.com/comments/feed/"
    ],
    "stylesheet": [
      "https://alirezahayati.com/wp-includes/css/dist/block-library/style.min.css?ver=6.1.1",
      "https://alirezahayati.com/wp-includes/css/classic-themes.min.css?ver=1",
      "https://alirezahayati.com/wp-content/plugins/simple-banner/simple-banner.css?ver=2.13.3",
      "https://alirezahayati.com/wp-content/themes/independent-publisher/fonts/genericons/genericons.css?ver=3.1",
      "https://alirezahayati.com/wp-content/themes/independent-publisher/css/nprogress.css?ver=0.1.3",
      "https://alirezahayati.com/wp-content/themes/independent-publisher/style.css?ver=6.1.1",
      "https://alirezahayati.com/wp-admin/admin-ajax.php?action=independent_publisher_customizer_css&ver=1.7"
    ],
    "https://api.w.org/": [
      "https://alirezahayati.com/wp-json/"
    ],
    "EditURI": [
      "https://alirezahayati.com/xmlrpc.php?rsd"
    ],
    "wlwmanifest": [
      "https://alirezahayati.com/wp-includes/wlwmanifest.xml"
    ],
    "me": [
      "https://mstdn.io/@arh"
    ],
    "icon": [
      "https://alirezahayati.com/wp-content/uploads/2020/05/cropped-logo-32x32.jpg",
      "https://alirezahayati.com/wp-content/uploads/2020/05/cropped-logo-192x192.jpg"
    ],
    "apple-touch-icon": [
      "https://alirezahayati.com/wp-content/uploads/2020/05/cropped-logo-180x180.jpg"
    ],
    "home": [
      "https://alirezahayati.com/"
    ],
    "bookmark": [
      "https://alirezahayati.com/2023/02/27/captain-its-wednesday/",
      "https://alirezahayati.com/2023/01/23/im-not-changing-my-license/",
      "https://alirezahayati.com/2023/01/20/the-purpose-of-ai/",
      "https://alirezahayati.com/2023/01/06/aim-for-freedom-tech/",
      "https://alirezahayati.com/2022/12/01/dont-think-positive/",
      "https://alirezahayati.com/2022/11/16/you-are-worthy/",
      "https://alirezahayati.com/2022/11/09/how-does-fediverse-work/",
      "https://alirezahayati.com/2022/11/02/obeying-the-law/",
      "https://alirezahayati.com/2022/10/23/who-is-niac/",
      "https://alirezahayati.com/2022/10/20/occupied/"
    ],
    "category": [
      "https://alirezahayati.com/category/general/",
      "https://alirezahayati.com/category/user-rights/",
      "https://alirezahayati.com/category/society/"
    ],
    "tag": [
      "https://alirezahayati.com/category/general/",
      "https://alirezahayati.com/category/user-rights/",
      "https://alirezahayati.com/category/society/"
    ],
    "designer": [
      "http://independentpublisher.me/"
    ],
    "generator": [
      "http://wordpress.org/"
    ],
    "license": [
      "https://creativecommons.org/licenses/by-sa/4.0/"
    ]
  },
  "rel-urls": {
    "http://gmpg.org/xfn/11": {
      "rels": [
        "profile"
      ]
    },
    "https://alirezahayati.com/xmlrpc.php": {
      "rels": [
        "pingback"
      ]
    },
    "https://alirezahayati.com/": {
      "rels": [
        "canonical"
      ]
    },
    "https://alirezahayati.com/page/2/": {
      "rels": [
        "next"
      ]
    },
    "https://alirezahayati.com/feed/": {
      "rels": [
        "alternate"
      ],
      "title": "Ali Reza Hayati » Feed",
      "type": "application/rss+xml"
    },
    "https://alirezahayati.com/comments/feed/": {
      "rels": [
        "alternate"
      ],
      "title": "Ali Reza Hayati » Comments Feed",
      "type": "application/rss+xml"
    },
    "https://alirezahayati.com/wp-includes/css/dist/block-library/style.min.css?ver=6.1.1": {
      "rels": [
        "stylesheet"
      ],
      "media": "all",
      "type": "text/css"
    },
    "https://alirezahayati.com/wp-includes/css/classic-themes.min.css?ver=1": {
      "rels": [
        "stylesheet"
      ],
      "media": "all",
      "type": "text/css"
    },
    "https://alirezahayati.com/wp-content/plugins/simple-banner/simple-banner.css?ver=2.13.3": {
      "rels": [
        "stylesheet"
      ],
      "media": "all",
      "type": "text/css"
    },
    "https://alirezahayati.com/wp-content/themes/independent-publisher/fonts/genericons/genericons.css?ver=3.1": {
      "rels": [
        "stylesheet"
      ],
      "media": "all",
      "type": "text/css"
    },
    "https://alirezahayati.com/wp-content/themes/independent-publisher/css/nprogress.css?ver=0.1.3": {
      "rels": [
        "stylesheet"
      ],
      "media": "all",
      "type": "text/css"
    },
    "https://alirezahayati.com/wp-content/themes/independent-publisher/style.css?ver=6.1.1": {
      "rels": [
        "stylesheet"
      ],
      "media": "all",
      "type": "text/css"
    },
    "https://alirezahayati.com/wp-admin/admin-ajax.php?action=independent_publisher_customizer_css&ver=1.7": {
      "rels": [
        "stylesheet"
      ],
      "media": "all",
      "type": "text/css"
    },
    "https://alirezahayati.com/wp-json/": {
      "rels": [
        "https://api.w.org/"
      ]
    },
    "https://alirezahayati.com/xmlrpc.php?rsd": {
      "rels": [
        "EditURI"
      ],
      "title": "RSD",
      "type": "application/rsd+xml"
    },
    "https://alirezahayati.com/wp-includes/wlwmanifest.xml": {
      "rels": [
        "wlwmanifest"
      ],
      "type": "application/wlwmanifest+xml"
    },
    "https://mstdn.io/@arh": {
      "rels": [
        "me"
      ]
    },
    "https://alirezahayati.com/wp-content/uploads/2020/05/cropped-logo-32x32.jpg": {
      "rels": [
        "icon"
      ]
    },
    "https://alirezahayati.com/wp-content/uploads/2020/05/cropped-logo-192x192.jpg": {
      "rels": [
        "icon"
      ]
    },
    "https://alirezahayati.com/wp-content/uploads/2020/05/cropped-logo-180x180.jpg": {
      "rels": [
        "apple-touch-icon"
      ]
    },
    "https://alirezahayati.com/2023/02/27/captain-its-wednesday/": {
      "rels": [
        "bookmark"
      ],
      "title": "Permalink to Captain, it’s Wednesday",
      "text": "Captain, it’s Wednesday"
    },
    "https://alirezahayati.com/category/general/": {
      "rels": [
        "category",
        "tag"
      ],
      "text": "General"
    },
    "https://alirezahayati.com/2023/01/23/im-not-changing-my-license/": {
      "rels": [
        "bookmark"
      ],
      "title": "Permalink to I’m NOT changing my license!",
      "text": "I’m NOT changing my license!"
    },
    "https://alirezahayati.com/category/user-rights/": {
      "rels": [
        "category",
        "tag"
      ],
      "text": "User Rights"
    },
    "https://alirezahayati.com/2023/01/20/the-purpose-of-ai/": {
      "rels": [
        "bookmark"
      ],
      "title": "Permalink to The purpose of AI",
      "text": "The purpose of AI"
    },
    "https://alirezahayati.com/category/society/": {
      "rels": [
        "category",
        "tag"
      ],
      "text": "Society"
    },
    "https://alirezahayati.com/2023/01/06/aim-for-freedom-tech/": {
      "rels": [
        "bookmark"
      ],
      "title": "Permalink to Aim for freedom tech",
      "text": "Aim for freedom tech"
    },
    "https://alirezahayati.com/2022/12/01/dont-think-positive/": {
      "rels": [
        "bookmark"
      ],
      "title": "Permalink to Don’t think positive!",
      "text": "Don’t think positive!"
    },
    "https://alirezahayati.com/2022/11/16/you-are-worthy/": {
      "rels": [
        "bookmark"
      ],
      "title": "Permalink to You are worthy",
      "text": "You are worthy"
    },
    "https://alirezahayati.com/2022/11/09/how-does-fediverse-work/": {
      "rels": [
        "bookmark"
      ],
      "title": "Permalink to How does Fediverse work?",
      "text": "How does Fediverse work?"
    },
    "https://alirezahayati.com/2022/11/02/obeying-the-law/": {
      "rels": [
        "bookmark"
      ],
      "title": "Permalink to Obeying the law",
      "text": "Obeying the law"
    },
    "https://alirezahayati.com/2022/10/23/who-is-niac/": {
      "rels": [
        "bookmark"
      ],
      "title": "Permalink to Who is NIAC?",
      "text": "Who is NIAC?"
    },
    "https://alirezahayati.com/2022/10/20/occupied/": {
      "rels": [
        "bookmark"
      ],
      "title": "Permalink to Occupied",
      "text": "Occupied"
    },
    "http://independentpublisher.me/": {
      "rels": [
        "designer"
      ],
      "title": "Independent Publisher: A beautiful reader-focused WordPress theme, for you.",
      "text": "Independent Publisher"
    },
    "http://wordpress.org/": {
      "rels": [
        "generator"
      ],
      "title": "WordPress: A free open-source publishing platform",
      "text": "WordPress"
    },
    "https://creativecommons.org/licenses/by-sa/4.0/": {
      "rels": [
        "license"
      ],
      "text": "CC BY-SA 4.0"
    }
  }
}