{
  "items": [
    {
      "type": [
        "h-feed"
      ],
      "properties": {
        "url": [
          "https://ch-st.de/wasp-os-vaccination-certificate/",
          "https://ch-st.de/gdb-mpi-debugging/",
          "https://ch-st.de/two-quine-life-imitates-art/",
          "https://ch-st.de/its-ray-marching-march/",
          "https://ch-st.de/raspberry-pi-grafana-influxdb-collectd/",
          "https://ch-st.de/kodi-wol/",
          "https://ch-st.de/arduino-midi-pedal/",
          "https://ch-st.de/retrogames-pico8/",
          "https://ch-st.de/workflow-zathura-recoll/",
          "https://ch-st.de/diploide-zellulaerautomaten/",
          "https://ch-st.de/wikipedia-analysis-teil1/"
        ],
        "name": [
          "Vaccination QR Code on WaspOS smartwatches  03 Mar 2022  Last year, when I first read about the PineTime smart watch, I got really excited. Screw expensive Apple Watches or data-harvesting fitness loggers, I want to be able to create my own watch faces and peek at the firmware! Because if you can’t hack your gadget, do you really own...   Debugging MPI programs with GDB  28 Oct 2021  Debugging programs that run in parallel can be really difficult. It is hard to keep track of state across multiple processes and observe bugs that are timing-dependent, such as deadlocks. This post will not solve any of these problems, but at least it will show you how to easily attach...   Programs That Know Themselves  08 Jun 2021  I have a program for you.   It's raymarching march!  06 Mar 2021  In preparation for my computer graphics exam next week, I decided to take an excursion to the low-level side of things: ray marching ASCII graphics of rotating spheres! Multiple ways to create an image Generally, there are two different ways to generate an image with a computer: Object-order rendering (rasterization)...   Monitoring a Raspberry Pi with Grafana, InfluxDB and collectd  05 Feb 2021  If you use a Raspberry Pi as a microserver, it might be a good idea to keep an eye on various metrics. In this article, I will show you how to set up collectd, a metrics collection daemon, InfluxDB, a time series database which will store the collected data, and...   Kodi mit Wake-on-LAN starten  23 Nov 2020  Ein Raspberry Pi ist vielseitig einsetzbar! Zurzeit nutze ich einen Pi 3b als „microserver“ zur Dateisynchronisation, als VPN Server und als Mediacenter mit Kodi. Aber: die Ressourcen sind limitiert, und wenn etwas nicht benötigt wird dann sollte es möglichst keinen Speicher und keine CPU-Zeit verwenden. Kodi ist da ein ganz...   Morsetaste als MIDI-Haltepedal mit Arduino  31 Oct 2020  Ich habe ein großes MIDI-Keyboard mit 76 Tasten, aber leider kein Haltepedal dafür. Wer schon einmal Klavier gespielt hat weiß, wie groß der Einfluss des Haltepedals auf den Klang ist, weshalb wir uns in diesem Artikel anschauen wollen, wie man sich ein Ersatz-Haltepedal zusammenbauen kann. Hardware Zuerst wollte ich aus...   Retrospiele für PICO-8 entwickeln  27 Sep 2020  TL;DR Computerspiele gehören wohl zu den besten Einstiegsdrogen die die IT zu bieten hat: der Traum vom eigenen Spiel hat wohl schon so manchen dazu inspiriert, Programmieren zu lernen. Aber sobald man sich ernsthafter mit der Materie befasst, entdeckt man zahlreiche Hindernisse: moderne Computerspiele werden von Studios mit mehreren Hundert...   Workflow - Zathura und Recoll  13 Jun 2020  Während eines Studiums häufen sich die PDF-Dateien regelrecht: aktuell habe ich 578 pdfs auf meinem Rechner die mit meinem Studium zu tun haben. Nicht leicht da den Überblick zu behalten - ich nutze dafür das Desktop-Wiki ZIM: Dort kann ich die einzelnen Studienmodule in Seiten hierarchisch ordnen, verschiedenste Dateien anhängen,...   Diploide Zellularautomaten  11 Jun 2020  Zellularautomaten sind ein untereinander verbundenes Netz von einzelnen Zellen, die strengen Regeln folgen und sich untereinander in unmittelbaren Nachbarschaft beeinflussen. Hier werden elementare Zellularautomaten betrachtet, die zuerst von Stephen Wolfram beschrieben wurden. Es handelt sich dabei um einen 1-dimensionales Feld von Zellen, die den Zustand AN (1) oder AUS (0)...   Graph-Repräsentation von Wikipedia - Teil 1  19 Oct 2019  Wer schon einmal gelangweilt an einem Rechner mit Zugang zu Wikipedia gesessen hat kennt vielleicht das Spiel Wikispeedia: Man startet auf einem zufälligen Artikel und muss sich mittels möglichst weniger Verlinkungen innerhalb des Artikels zu Adolf Hitler oder Jesus durchklicken; wer die wenigsten Klicks gebraucht hat gewinnt. Doch wie kann..."
        ]
      },
      "id": "posts"
    }
  ],
  "rels": {
    "stylesheet": [
      "https://ch-st.de/css/main.css"
    ],
    "alternate": [
      "https://ch-st.de/atom.xml"
    ],
    "icon": [
      "https://ch-st.de/img/favicon.png"
    ],
    "shortcut": [
      "https://ch-st.de/img/favicon.png"
    ],
    "me": [
      "https://github.com/stelzch"
    ],
    "pgpkey": [
      "https://ch-st.de/assets/PGP.asc"
    ],
    "authorization_endpoint": [
      "https://indieauth.com/auth"
    ]
  },
  "rel-urls": {
    "https://ch-st.de/css/main.css": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://ch-st.de/atom.xml": {
      "rels": [
        "alternate"
      ],
      "title": "ATOM Feed",
      "type": "application/atom+xml"
    },
    "https://ch-st.de/img/favicon.png": {
      "rels": [
        "icon",
        "shortcut"
      ],
      "type": "image/png"
    },
    "https://github.com/stelzch": {
      "rels": [
        "me"
      ]
    },
    "https://ch-st.de/assets/PGP.asc": {
      "rels": [
        "pgpkey"
      ]
    },
    "https://indieauth.com/auth": {
      "rels": [
        "authorization_endpoint"
      ]
    }
  }
}