{
  "items": [
    {
      "type": [
        "h-card"
      ],
      "properties": {
        "photo": [
          {
            "value": "https://cj.w6k.ca/media/images/elderberries.jpg",
            "alt": "A photograph of elderberries."
          }
        ],
        "name": [
          "cj.w6k.ca"
        ],
        "url": [
          "https://cj.w6k.ca/"
        ],
        "uid": [
          "https://cj.w6k.ca/"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "content": [
          {
            "html": "<p>I have been giving Twitter a bit of my time in the last few months. It reminds me, in parts, of the buzzing crowd in Neal Stephenson's book, \"Fall; or, Dodge in Hell.\" I didn't get it when I read the book. I get it now.</p>\n<p>Saw an H. Clinton tweet (paraphrasing): the group of people whom normalize extreme conspiratorial positions as rational rhetoric suitable for the public forum bear some responsibility for the actions of extremist individuals that hold the conspiratorial positions as truths rather than knowing the nature of such statements as devices in service of the democratic process. They, the former, must bear some responsibility for others whom take immoral actions such as have recently been enacted at the Pelosi's San Francisco residence. </p>\n<p>The toxic response to this statement is the worst part of humanity, only available on Twitter in my day-to-day participation with 'social'-media. Dozens parading extreme vitriol against the tweet-maker, buoyed by affirmations from like-minded sensationalists, catching a buzz from the clamour and feedback arising from the zeitgeist within the onslaught, the mentality of the mob physically dispersed though together online. Of all responses I reviewed, there was not one on the same topic as that in the original statement. Supporters of the statement, or the statement-maker, showed agreement with a 'like.' Some others immediately complimented the author with supportive statements on her character and personal worth, for sharing an opinion, but this is quickly lost among the rain of shit that follows. Is it really appropriate that there is this unbordered positive reinforcement loop in the immediate screenspace immediately following the original statement, completely derailing the author's intent? Is that where you need to be, politics person, to reach the voters? How sad. That's Twitter?</p>\n<p>People that think some combination of facebook and twitter make up the whole of the disussion, of the internet, its so so sad. That's not the internet, that can't be the internet. What happened here?</p>\n<p>Human soup, whipped into a zealous fervour, all abuzz at election time. Rationality devalued, antagonism of the other side held up as duty. No civil limit to the extent of each textual and verbal attack, launched on individuals that would share an opinion of ANY subject. Grand poohbah close at hand to share in the mass attack. Not for the accuracy, precision or rationale behind the statement or embodied by it, but for the author's character, their integrity. This each and every time they tweet, or share sentiment with their retweets and similar.</p>\n<p>This pile-on is somehow a reasonable thing to do in the society of the purveyors for the obvious reason that the statement-maker is known for having chosen a different political affiliation than that which they prefer. There in San Francisco, one alone holding the same positions and further taking action based on the literal messages, acting out the very sentiments found therein has sharply broken with reason. Blind to the power of high office, the actual true purpose of the rhetoric, seeing only the mad desolation of the world as if all of that drivel were real, one feeble mind snaps and takes extreme, illegal action. This is the least surprising thing in my own reckoning of the sorry state of affairs.</p>\n<p>How I long for discussion based on the merits. That is the capacity we have in 2022 with our social media machines. Instead, it is as though each person, each tweet, takes place beyond the reach of any decency, any notion of etiquette, any sense of grace or constructivist intention. A terror of a place, to be sure. Consider the newly arrived Chief Twit, who responds to Clinton, not on the topic raised and merits of the statement, but instead calls into question the character of the victim; details of the relationship between attacker and victim. Of course, nuance, but so disheartening that the real topic is sidelined for more small-mind puppetshow. But of course, it's a dangerous thing if one doesn't buzz along. The shock-value exceeds the humanity. This is not my internet. It is a distraction serving no purpose outside the machinations of a democracy burdened with beastmasters and their beasts.</p>\n<p>I am ultra-modern. There are any number of twisted behaviours that may have been underway which do not force me into a position that I will judge either person concerned. Whatever abnormality or lasciviousness is turned up. Does this change the fact that a man was savagely beaten with a hammer? One chance -was it self-defence- after which it is without question that the guilty party is known to be the one wielding the hammer in aggression. It's so sad when we hear that a person has snapped, diverged from civility. In this case, what was the day-to-day social fabric of the assailant? What were his norms? That's what we have an opportunity to examine, in the context of the political discourse, its recent departure, a few elections, on a tangent from its former composure, a few millenia. I see that Twitter will never be the venue where that discussion takes place, other than as it sways the mass of the whole-of-smalls from one frightful too-atrocious-to-be-real trepidation-with-a-laugh-we-don't-see, to the next.</p>\n<p>After the recent hurricane, there are many solo hornets buzzing about with nothing to work on. They have lost their purpose. So many trees came down in the wind, that hives were destroyed in great numbers. A local news article described this as the cause of the over-abundance of aimless creatures. Sucks to be in a hive mind.</p>\n<p>I still go to my backyard and hornets are just hornets. As I go to Twitter I can feel it buzzing. But I do not buzz along.</p>",
            "value": "I have been giving Twitter a bit of my time in the last few months. It reminds me, in parts, of the buzzing crowd in Neal Stephenson's book, \"Fall; or, Dodge in Hell.\" I didn't get it when I read the book. I get it now.Saw an H. Clinton tweet (paraphrasing): the group of people whom normalize extreme conspiratorial positions as rational rhetoric suitable for the public forum bear some responsibility for the actions of extremist individuals that hold the conspiratorial positions as truths rather than knowing the nature of such statements as devices in service of the democratic process. They, the former, must bear some responsibility for others whom take immoral actions such as have recently been enacted at the Pelosi's San Francisco residence. The toxic response to this statement is the worst part of humanity, only available on Twitter in my day-to-day participation with 'social'-media. Dozens parading extreme vitriol against the tweet-maker, buoyed by affirmations from like-minded sensationalists, catching a buzz from the clamour and feedback arising from the zeitgeist within the onslaught, the mentality of the mob physically dispersed though together online. Of all responses I reviewed, there was not one on the same topic as that in the original statement. Supporters of the statement, or the statement-maker, showed agreement with a 'like.' Some others immediately complimented the author with supportive statements on her character and personal worth, for sharing an opinion, but this is quickly lost among the rain of shit that follows. Is it really appropriate that there is this unbordered positive reinforcement loop in the immediate screenspace immediately following the original statement, completely derailing the author's intent? Is that where you need to be, politics person, to reach the voters? How sad. That's Twitter?People that think some combination of facebook and twitter make up the whole of the disussion, of the internet, its so so sad. That's not the internet, that can't be the internet. What happened here?Human soup, whipped into a zealous fervour, all abuzz at election time. Rationality devalued, antagonism of the other side held up as duty. No civil limit to the extent of each textual and verbal attack, launched on individuals that would share an opinion of ANY subject. Grand poohbah close at hand to share in the mass attack. Not for the accuracy, precision or rationale behind the statement or embodied by it, but for the author's character, their integrity. This each and every time they tweet, or share sentiment with their retweets and similar.This pile-on is somehow a reasonable thing to do in the society of the purveyors for the obvious reason that the statement-maker is known for having chosen a different political affiliation than that which they prefer. There in San Francisco, one alone holding the same positions and further taking action based on the literal messages, acting out the very sentiments found therein has sharply broken with reason. Blind to the power of high office, the actual true purpose of the rhetoric, seeing only the mad desolation of the world as if all of that drivel were real, one feeble mind snaps and takes extreme, illegal action. This is the least surprising thing in my own reckoning of the sorry state of affairs.How I long for discussion based on the merits. That is the capacity we have in 2022 with our social media machines. Instead, it is as though each person, each tweet, takes place beyond the reach of any decency, any notion of etiquette, any sense of grace or constructivist intention. A terror of a place, to be sure. Consider the newly arrived Chief Twit, who responds to Clinton, not on the topic raised and merits of the statement, but instead calls into question the character of the victim; details of the relationship between attacker and victim. Of course, nuance, but so disheartening that the real topic is sidelined for more small-mind puppetshow. But of course, it's a dangerous thing if one doesn't buzz along. The shock-value exceeds the humanity. This is not my internet. It is a distraction serving no purpose outside the machinations of a democracy burdened with beastmasters and their beasts.I am ultra-modern. There are any number of twisted behaviours that may have been underway which do not force me into a position that I will judge either person concerned. Whatever abnormality or lasciviousness is turned up. Does this change the fact that a man was savagely beaten with a hammer? One chance -was it self-defence- after which it is without question that the guilty party is known to be the one wielding the hammer in aggression. It's so sad when we hear that a person has snapped, diverged from civility. In this case, what was the day-to-day social fabric of the assailant? What were his norms? That's what we have an opportunity to examine, in the context of the political discourse, its recent departure, a few elections, on a tangent from its former composure, a few millenia. I see that Twitter will never be the venue where that discussion takes place, other than as it sways the mass of the whole-of-smalls from one frightful too-atrocious-to-be-real trepidation-with-a-laugh-we-don't-see, to the next.After the recent hurricane, there are many solo hornets buzzing about with nothing to work on. They have lost their purpose. So many trees came down in the wind, that hives were destroyed in great numbers. A local news article described this as the cause of the over-abundance of aimless creatures. Sucks to be in a hive mind.I still go to my backyard and hornets are just hornets. As I go to Twitter I can feel it buzzing. But I do not buzz along."
          }
        ],
        "author": [
          "https://cj.w6k.ca/"
        ],
        "category": [
          "politics",
          "Twitter",
          "society"
        ],
        "uid": [
          "https://cj.w6k.ca/2022/10/30/1/"
        ],
        "url": [
          "https://cj.w6k.ca/2022/10/30/1/"
        ],
        "published": [
          "2022-10-30T21:41:22-03:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "content": [
          {
            "html": "<p>The first electronic toy I remember is a calculator that had a '+1' button. It wasn't a toy actually, it was just my Dad's calculator. I would press the '+1' button to make the number bigger for long stretches at a time. I would have been very young, four years or less. It had a red front and black back. It was rectangular and required four (4) AA batteries; was four AA's wide (maybe three). The +1 button was on top, and white.</p>\n<p>The next one I recall is a <a href=\"https://www.vtech.com/en/about-us/history/\">Talking Whiz Kid</a>, made by V-Tech beginning in 1986. I can easily relive the sound of 'Yes, you are right,' but I don't remember what it said when an error was made. Hmmm. Maybe just 'No, try again.' It was not the sound of hitting the ball out of bounds in <a href=\"https://archive.org/details/segasms_Great_Golf_Rev_1_1987_Sega\">Sega's \"Great Golf\" from 1987</a>, though that comes to mind!</p>\n<p>I had a lot of SMS games. I remember playing <a href=\"https://archive.org/details/segasms_Phantasy_Star_1987_Sega_JP\">Phantasy Star</a> and someone (Dad) making maps of the dungeons on graph paper.</p>",
            "value": "The first electronic toy I remember is a calculator that had a '+1' button. It wasn't a toy actually, it was just my Dad's calculator. I would press the '+1' button to make the number bigger for long stretches at a time. I would have been very young, four years or less. It had a red front and black back. It was rectangular and required four (4) AA batteries; was four AA's wide (maybe three). The +1 button was on top, and white.The next one I recall is a Talking Whiz Kid, made by V-Tech beginning in 1986. I can easily relive the sound of 'Yes, you are right,' but I don't remember what it said when an error was made. Hmmm. Maybe just 'No, try again.' It was not the sound of hitting the ball out of bounds in Sega's \"Great Golf\" from 1987, though that comes to mind!I had a lot of SMS games. I remember playing Phantasy Star and someone (Dad) making maps of the dungeons on graph paper."
          }
        ],
        "author": [
          "https://cj.w6k.ca/"
        ],
        "category": [
          "journal"
        ],
        "uid": [
          "https://cj.w6k.ca/2022/10/23/17/"
        ],
        "url": [
          "https://cj.w6k.ca/2022/10/23/17/"
        ],
        "published": [
          "2022-10-23T20:23:08-03:00"
        ],
        "updated": [
          "2022-10-23T20:35:35-03:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "content": [
          {
            "html": "<p>Shaq pantomimed the zoo gorilla, wolrdwide average, reaction to meeting Shaq.</p>\n<p>Surreal moment.</p>\n<p>OG: rapt. <del>inattention, diminutive.</del></p>\n<p>Shaq: rapt.</p>",
            "value": "Shaq pantomimed the zoo gorilla, wolrdwide average, reaction to meeting Shaq.Surreal moment.OG: rapt. inattention, diminutive.Shaq: rapt."
          }
        ],
        "author": [
          "https://cj.w6k.ca/"
        ],
        "category": [
          "journal"
        ],
        "uid": [
          "https://cj.w6k.ca/2022/10/22/2/"
        ],
        "url": [
          "https://cj.w6k.ca/2022/10/22/2/"
        ],
        "published": [
          "2022-10-22T15:59:34-03:00"
        ],
        "updated": [
          "2022-10-22T16:30:37-03:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "content": [
          {
            "html": "<p>A friend of mine said to me this evening, \"When I'm out in public I still need to be careful.\" Consummate businessman.</p>\n<p>\"I know, right?\" I said. \"I live only a couple doors down from you but I am living a completely different experience.\"</p>\n<p>He nodded.</p>\n<p>\"The way I see it, there are two paths. Play it safe, or conquer the village.\"</p>",
            "value": "A friend of mine said to me this evening, \"When I'm out in public I still need to be careful.\" Consummate businessman.\"I know, right?\" I said. \"I live only a couple doors down from you but I am living a completely different experience.\"He nodded.\"The way I see it, there are two paths. Play it safe, or conquer the village.\""
          }
        ],
        "author": [
          "https://cj.w6k.ca/"
        ],
        "category": [
          "journal"
        ],
        "uid": [
          "https://cj.w6k.ca/2022/10/14/4/"
        ],
        "url": [
          "https://cj.w6k.ca/2022/10/14/4/"
        ],
        "published": [
          "2022-10-14T02:25:05-03:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "content": [
          {
            "html": "<p>I played pool today. Just forget that happened.</p>\n<p>Interrupted a cursing jay walker (it was later and indoors) to state that he was rude! He grumbled about bums, cursedly calling 'asshole' while not looking at me directly but rather at the person situated behind the bar. Talking to me, oh yes, he spake bullshit once. He was, in fact, being rude to myself and my associate only for being in sight when he was originally interrupted. By me.</p>\n<p>\"You are a very rude person,\" I said loudly, while looking directly at him.</p>\n<p>His associates at the bar immediately began apologizing to me.</p>\n<p>Such is life, and his drunken game.</p>\n<p>I implied that I along with many others present were all assholes and listening. Couple of laughs around. He less-frowned. I described the modern contrivance, the automated and lit cross-walk. </p>\n<p>He was speechless. His friend got it and asked if I was in that car earlier.</p>\n<p>\"Yes,\" says I. </p>\n<p>\"Don't mind him\", says he.</p>\n<p>Met people. Bought beer for two strangers (coors light; <ins>other side of the bar</ins>). Drank with an entire bar full of people for eight (8) minutes before the bar closed at 11pm. Good times.</p>",
            "value": "I played pool today. Just forget that happened.Interrupted a cursing jay walker (it was later and indoors) to state that he was rude! He grumbled about bums, cursedly calling 'asshole' while not looking at me directly but rather at the person situated behind the bar. Talking to me, oh yes, he spake bullshit once. He was, in fact, being rude to myself and my associate only for being in sight when he was originally interrupted. By me.\"You are a very rude person,\" I said loudly, while looking directly at him.His associates at the bar immediately began apologizing to me.Such is life, and his drunken game.I implied that I along with many others present were all assholes and listening. Couple of laughs around. He less-frowned. I described the modern contrivance, the automated and lit cross-walk. He was speechless. His friend got it and asked if I was in that car earlier.\"Yes,\" says I. \"Don't mind him\", says he.Met people. Bought beer for two strangers (coors light; other side of the bar). Drank with an entire bar full of people for eight (8) minutes before the bar closed at 11pm. Good times."
          }
        ],
        "author": [
          "https://cj.w6k.ca/"
        ],
        "category": [
          "journal"
        ],
        "uid": [
          "https://cj.w6k.ca/2022/10/14/3/"
        ],
        "url": [
          "https://cj.w6k.ca/2022/10/14/3/"
        ],
        "published": [
          "2022-10-14T02:04:53-03:00"
        ],
        "updated": [
          "2022-10-14T02:32:12-03:00"
        ]
      }
    },
    {
      "type": [
        "h-x-challenge"
      ],
      "properties": {
        "name": [
          "Christopher James Willcock"
        ],
        "url": [
          "https://cj.w6k.ca/"
        ],
        "license": [
          "All rights reserved except where otherwise specified."
        ]
      }
    }
  ],
  "rels": {
    "stylesheet": [
      "https://cj.w6k.ca/bundle.min.css?t=1663566917"
    ],
    "authorization_endpoint": [
      "https://cj.w6k.ca/auth/"
    ],
    "token_endpoint": [
      "https://cj.w6k.ca/token/"
    ],
    "micropub": [
      "https://cj.w6k.ca/micropub/"
    ],
    "microsub": [
      "https://aperture.p3k.io/microsub/528"
    ],
    "feed": [
      "https://cj.w6k.ca/articles/",
      "https://cj.w6k.ca/notes/",
      "https://cj.w6k.ca/photos/",
      "https://cj.w6k.ca/bookmarks/",
      "https://cj.w6k.ca/reposts/",
      "https://cj.w6k.ca/responses/",
      "https://cj.w6k.ca/all/"
    ],
    "me": [
      "https://code.cjwillcock.ca/cjw6k/",
      "https://cj.w6k.ca/",
      "https://github.com/cjw6k",
      "https://twitter.com/cjw6k",
      "https://open.spotify.com/user/31edqa7pnsitqcmhhbggm4btw6eu",
      "https://www.codingame.com/profile/6d19bbcae1169ee4a1513de917008c405226544"
    ]
  },
  "rel-urls": {
    "https://cj.w6k.ca/bundle.min.css?t=1663566917": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://cj.w6k.ca/auth/": {
      "rels": [
        "authorization_endpoint"
      ]
    },
    "https://cj.w6k.ca/token/": {
      "rels": [
        "token_endpoint"
      ]
    },
    "https://cj.w6k.ca/micropub/": {
      "rels": [
        "micropub"
      ]
    },
    "https://aperture.p3k.io/microsub/528": {
      "rels": [
        "microsub"
      ]
    },
    "https://cj.w6k.ca/articles/": {
      "rels": [
        "feed"
      ],
      "text": "Articles"
    },
    "https://cj.w6k.ca/notes/": {
      "rels": [
        "feed"
      ],
      "text": "Notes"
    },
    "https://cj.w6k.ca/photos/": {
      "rels": [
        "feed"
      ],
      "text": "Photos"
    },
    "https://cj.w6k.ca/bookmarks/": {
      "rels": [
        "feed"
      ],
      "text": "Bookmarks"
    },
    "https://cj.w6k.ca/reposts/": {
      "rels": [
        "feed"
      ],
      "text": "Reposts"
    },
    "https://cj.w6k.ca/responses/": {
      "rels": [
        "feed"
      ],
      "text": "Responses"
    },
    "https://cj.w6k.ca/all/": {
      "rels": [
        "feed"
      ],
      "text": "All"
    },
    "https://code.cjwillcock.ca/cjw6k/": {
      "rels": [
        "me"
      ]
    },
    "https://cj.w6k.ca/": {
      "rels": [
        "me"
      ],
      "text": "Christopher James Willcock"
    },
    "https://github.com/cjw6k": {
      "rels": [
        "me"
      ]
    },
    "https://twitter.com/cjw6k": {
      "rels": [
        "me"
      ],
      "text": ".cls-1{fill:#1da1f2;}.cls-2{fill:#fff;}.cls-3{fill:none;}Twitter_Logo_White-on-Blue"
    },
    "https://open.spotify.com/user/31edqa7pnsitqcmhhbggm4btw6eu": {
      "rels": [
        "me"
      ]
    },
    "https://www.codingame.com/profile/6d19bbcae1169ee4a1513de917008c405226544": {
      "rels": [
        "me"
      ]
    }
  }
}