{
  "items": [
    {
      "type": [
        "h-card"
      ],
      "properties": {
        "url": [
          "https://holliebutler.net/"
        ],
        "name": [
          "Hollie Butler"
        ],
        "note": [
          "Follow @hollie on Micro.blog."
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "name": [
          ""
        ],
        "summary": [
          "Carrots scrubbed and peeled and brined, now awaiting their microbial transformation! Pickled carrots are so good. (After I took the photo I added a weight to submerge the pokey ones)."
        ],
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://holliebutler.net/"
              ]
            },
            "value": "https://holliebutler.net/"
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "name": [
          ""
        ],
        "summary": [
          "Is it really a “birth-rate crisis” when we have nearly 8 billion people? One article quote: “Fewer people are good for the climate, but the economic consequences are severe.” Can’t they hear how ridiculous this sounds? “Keep driving off the cliff; braking might stall the car.”"
        ],
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://holliebutler.net/"
              ]
            },
            "value": "https://holliebutler.net/"
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "name": [
          "Hugo puzzlement"
        ],
        "summary": [
          "So this Hugo online notebook idea (I describe the idea here) is proving to be a challenge. I’ve read a few pages about index.md vs. _index.md, and as someone who has never coded or worked with computers past being a user of apps, it all feels like a foreign language. I can’t deciper what this page means, or this one. This person seems confused too but he must have a background in coding because he read the previous stuff and that clarified things for him.\nMy theme doesn’t seem to render the pages properly (I’m using Digital Garden). I don’t know enough about this to tell whether it’s the theme that’s the issue, or just the way I’ve structured things, but basically the problem is that I create a folder and I want the base index page to exist (I know enough HTML to know that index.html is the default page in a folder that the browser loads), but apparently sometimes with Hugo you use _index.md? But I can’t tell when. The instructions seem to say, “If folders come after (are nested inside) this one, use _index.md for the uppermost folder,” but I have tested this and it doesn’t work. Sometimes the page loads a blank page, sometimes “Page Not Found,” but never the actual page that has the content on it.\nNext steps:\n\nDefinitely finish the YouTube series from Mike Dane I was watching out on how to get started with Hugo.\nMaybe figuring out what this whole TOML thing is, and how to use it, would help?\nKeep working to finish the HTML and CSS course that I started awhile ago (chronic illness makes progress slow). I feel like this could help a lot in understanding layout, but it still feels like there are many concepts integral to computing in general, that I don’t recognize or understand. When I watch YouTube tutorials, it’s clear there are foundational ideas that people assume you must know, that I don’t recognize."
        ],
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://holliebutler.net/"
              ]
            },
            "value": "https://holliebutler.net/"
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "name": [
          ""
        ],
        "summary": [
          "Belated (by an hour or so) entry for Caturday. Here’s Cal duking it out with Princess Leia!\n  \n🐈📷"
        ],
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://holliebutler.net/"
              ]
            },
            "value": "https://holliebutler.net/"
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "name": [
          ""
        ],
        "summary": [
          "Today is game night, and my friend is sending me images of their new game, called Dog Park - we normally play with 7 but tonight we may have to team up lol!"
        ],
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://holliebutler.net/"
              ]
            },
            "value": "https://holliebutler.net/"
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "name": [
          ""
        ],
        "summary": [
          "My Hugo installation is up and running! Well, locally anyway, it’s nowhere online. Am now learning how to use it. How fun! I would happily spend my life creating funky little archival websites/blogs of weird little niche subjects."
        ],
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://holliebutler.net/"
              ]
            },
            "value": "https://holliebutler.net/"
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "name": [
          ""
        ],
        "summary": [
          "Trying to install a Hugo blog. Okay, so what I need is language to do a search that will help me find pages or books or videos to describe the most basic things, like the concept of a terminal, what it does, what yaml is and why that’s better than toml, and other mysteries that every YouTube video I can find takes for granted that one already knows.\nI’ve got programmer/coding friends all over the place (spreads out hands - BEHOLD, YE BEAUTIFUL NERDS) but whenever I ask these super basic things, I get amused befuddlement, it’s like those are the things people learned first, at the start. For many of you that was back in the 80’s or 90’s (or 70’s) and you don’t even remember how you absorbed those essential basic building blocks. You just did, they’re just in there.\nI need the building blocks, but where do you get those in 2022? When you’re 48 years old? Where are all the fresh baby nerds starting out these days?"
        ],
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://holliebutler.net/"
              ]
            },
            "value": "https://holliebutler.net/"
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "name": [
          ""
        ],
        "summary": [
          "The Trader Joe’s help counter tells me they’re out of the autumnal apple caramels and the candied pumpkin seeds. After the weeping (okay really I just had a very stricken expression for several minutes) I did find these amazing new ice cream bars. Gluten free, yo!"
        ],
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://holliebutler.net/"
              ]
            },
            "value": "https://holliebutler.net/"
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "name": [
          ""
        ],
        "summary": [
          "The whole household is now bivalently boosted, but this one has hit harder than the last couple of vaccines. I’m grateful there’s nothing pressing to get done today. And of course: SO grateful for the vaccines themselves."
        ],
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://holliebutler.net/"
              ]
            },
            "value": "https://holliebutler.net/"
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "name": [
          "Takeout Night!"
        ],
        "summary": [
          "We don’t go to restaurants anymore because of that pesky global pandemic, and that means I’ve evolved into this person who gets just super bonkers excited over one of the fam going to pick up dinner and bring it home. I get the movie queued up, there is discussion about what beverages we need, etc. I do miss restaurants but I gotta say we have made the best of it! Getting takeout is truly fun."
        ],
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://holliebutler.net/"
              ]
            },
            "value": "https://holliebutler.net/"
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "name": [
          ""
        ],
        "summary": [
          "Excellent pillow selection at our local hair salon"
        ],
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://holliebutler.net/"
              ]
            },
            "value": "https://holliebutler.net/"
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "name": [
          "Jupiter can comic!"
        ],
        "summary": [
          "Jupiter (our 17yo) was telling me about the art class they’re in at school and how the new assignment to do a comic-style piece felt frustrating because that just isn’t their usual style. So it blew me away to see their final piece! It’s amazing! The rules were no humans or anthropomorphic animals, no words, but one sound effect. They said they got inspiration from when we used to visit the Japanese Garden so much when we lived in Seattle. ❤️ 🎨"
        ],
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://holliebutler.net/"
              ]
            },
            "value": "https://holliebutler.net/"
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "name": [
          "Some of my thoughts and difficulties figuring out whether to use ClassicPress or Micro.blog"
        ],
        "summary": [
          "My tale of starting Micro.blog, swapping over to ClassicPress, and ending back up on Micro.blog again\nEarly this year when I discovered IndieWeb, I thought it’d be fun to get back into blogging. Originally I assumed I’d use WordPress for this. I used WordPress in the early ‘10’s when my kids were little, and I enjoyed it a lot. I made a handful of different cooking and craft blogs that petered out over time. When Gutenberg came along, I was not a fan (my thoughts echo this person’s), and I eventually moved more to using Facebook and off blogging entirely.\nSo I was excited to find out there is this magical marvelous thing called ClassicPress, a fork of pre-Gutenberg WordPress, now being lovingly tended by a community of people who wanted to keep that functionality alive. I love community-run projects like this.\nMicro.blog vs. ClassicPress\nMeanwhile, I had also gotten an early account on Micro.blog, without knowing much about it other than I loved the simple aesthetics. Now I was trying to read up on Micro.blog, learning what a static site generator was and what made it different from WordPress. I know a little HTML and CSS, but I don’t know anything about My SQL or PHP, sysadmin tasks, or any of the underlying parts of either site. But my smattering of HTML and CSS made Micro.blog seem like the better choice, because I would know how to begin modifying themes and tinkering. Tinkering in WordPress code had always been a disaster.\nInitially, Micro.blog was hard for me beacause I couldn’t have comments from outside Micro.blog. I understand there is a thing called Brid.gy but I don’t fully understand how it works, and no one I know who isn’t in a tech field or has tech as one of their major hobbies (this describes 75% of my circle of friends), knows what web mentions are or how to use them.\nThis means that if I meet some nice people in, say, an online sewing group, and I give them a link to the latest skirt I just made, they will have no way to comment on the post I made. If the point of having a blog is to connect with people, then a blog that lacks the functionality for comments seems to discourage that.\nBut then ClassicPress turns out to be unsustainable\nThis past week (October, 2022) I was able to get my own installation of ClassicPress up and going. This felt great, I had some initial trouble but a wonderful person in the ClassicPress community hung out with me for about half an hour one night and helped me figure out how to get the database installed. Again - community is so important, in EVERYTHING, and I can’t say enough good things about the community support I’ve received and seen in all three of these places I’ve been exploring, IndieWeb, ClassicPress, and Micro.blog.\nI installed some IndieWeb plug-ins that I barely understood, but after a page I made about my chronic illness received some nice comments on Twitter, those comments did show up on my ClassicPress blog, which was pretty cool. Woot!\nBut then…\nHowever the problem with ClassicPress is that apparently most web hosts see it as an outdated version of WordPress. As it was explained to me, this makes sense from a security standpoint. Outdated apps offer up vulnerabilities that, when exploited, might affect more on the server than your site alone.\nThere are apparently a few web hosts who have an installer called Softaculous, which will install and maintain ClassicPress properly, eliminating these concerns, but from what I understand, these web hosts are hard to find. My web host is SiteGround, and they don’t have a Softaculous installer, and instead have an unfortunate history of auto-updating ClassicPress installations with the current version of WordPress, as happened to this guy a few months ago.\nI read this thread but was encouraged by the fact that apparently he contacted SiteGround support, and got them to remove his site from auto-updates? That seemed easy enough. So after futzing around with my own ClassicPress installation at holliebutler.net and getting everything just the way I liked it, I contacted SiteGround.\nBut I got a totally different story. I wrote about that exchange in the ClassicPress forums, but the gist of it is, they won’t remove my site from auto-updates:\nWe strongly discourage hosting outdated installations for extended periods of time, which is why the Autoupdate tool allows for a WP version update to be skipped, but does not allow for the installation to be completely excluded from the autoupdate system.\nThis seems to go against that the other guy was told, but there didn’t seem to be anything I could do. This means my only option was to keep track of any WordPress version updates on my own, and then go into my settings buried in my SiteGround account, and turn off each individual update as it approached. This just isn’t sustainable. I’m coping with a chronic illness, my brain is often a bit fogged and I’m routinely out of energy to deal with mundane details like this; there’s no way I will remember to do this.\nAnd as it turns out, I had already missed one! In my SiteGround settings, when I went to see how to turn off the updates, it had already updated my site to WordPress 6.0.1. BAH.\nBack to Micro.blog I go\nI was so frustrated when I saw this, at midnight last night, that I went to my domain host (here I will make a plug for Porkbun.com, I just moved my domains here and I’m loving them - great tech support!) and moved my domain to point to my Micro.blog. I moved over the couple pages that I’d made so those links would still work. Once it was moved, I felt relief. I don’t have to stress about Micro.blog. I can add posts, I can tinker when I want or leave it alone for months, and it’s going to keep working whether I’m staring at it or not. The community around here is vibrant and the crew in charge is always thinking up new ways to make it better.\nThe only downside to Micro.blog, for me personally, is that lack of comments from outside the system. I was able to set up Reply by Email, a great plug-in by @sod, and I’m hoping that will get some use.\nBut my perspective on comments has changed a bit through all this. I remember when we were all blogging fifteen years ago, I knew dozens of folks at the time with WordPress blogs similar to mine, and it was true that we had a great time posting comments to each other. But spam - and occasionally harassing comments - was also a problem that had to be dealt with, and that took time I didn’t enjoy giving up. These days, with fewer blogs and fewer people commenting to them, it doesn’t feel as urgent to have that functionality. In my sewing group example, it’s likely that someone would comment on my link within the group rather than at the blog, anyway. So overall I’ve become less concerned about whether a lack of comments will necessarily mean a lack of connection.\nOther upsides include:\n\nMuch less expensive than SiteGround ($10/month for my Premium plan at Micro.blog vs. $25/month at SiteGround)\nEasy to use MarsEdit for publishing (I could never get MarsEdit to work with my WordPress installations)\nWith the Premium account, friends and family can subscribe to my newsletter (once I’d lost JetPack I couldn’t find a way to enable that functionality with ClassicPress)\nThe option of podcasting if I ever want to play with that idea (part of the Premium account)\nTinkerable code\n\nSo here I am!\nI’m hoping I can get some friends interested in blogging and getting their own Micro.blog accounts. :)"
        ],
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://holliebutler.net/"
              ]
            },
            "value": "https://holliebutler.net/"
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "name": [
          "Inktober Day 11"
        ],
        "summary": [
          "Okay this is hastily done in every sense of the word, but in my defense I spent the better part of the day dealing with a benign but still stressful medical event and I find hospitals exhausting (just the experience; not the staff who were all wonderful), so I did this while drooping with fatigue at 8:30 pm.\nI used  this photo as a model, and it’s supposed to be shrieking  “INKTOBER #11” and then “Happy National Coming Out Day!” I’ve never used watercolors in a Molskine sketchbook though and wow, that didn’t take very well.\nAh well! Tomorrow’s Inktober theme is FORGET, so we can forget about Tuesday.\n "
        ],
        "content": [
          {
            "html": "Okay this is hastily done in every sense of the word, but in my defense I spent the better part of the day dealing with a benign but still stressful medical event and I find hospitals exhausting (just the experience; not the staff who were all <em>wonderful</em>), so I did this while drooping with fatigue at 8:30 pm.\n<p>I used  <a href=\"https://www.eagles.org/wp-content/uploads/2020/07/MG_7021-176-scaled.jpg\">this photo</a> as a model, and it’s supposed to be shrieking  “INKTOBER #11” and then “Happy <a href=\"https://en.wikipedia.org/wiki/National_Coming_Out_Day\">National Coming Out Day</a>!” I’ve never used watercolors in a Molskine sketchbook though and wow, that didn’t take very well.</p>\n<p>Ah well! Tomorrow’s Inktober theme is FORGET, so we can forget about Tuesday.</p>\n<p> </p>\n<p><img class=\"alignnone wp-image-71\" src=\"https://holliebutler.net/wp-content/uploads/2022/10/2022-inktober-11-768x1024.jpg\" alt=\"\" width=\"464\" height=\"619\" srcset=\"https://holliebutler.net/wp-content/uploads/2022/10/2022-inktober-11-768x1024.jpg 768w, https://holliebutler.net/wp-content/uploads/2022/10/2022-inktober-11-225x300.jpg 225w, https://holliebutler.net/wp-content/uploads/2022/10/2022-inktober-11-1200x1600.jpg 1200w\" sizes=\"(max-width: 464px) 85vw, 464px\"></p>",
            "value": "Okay this is hastily done in every sense of the word, but in my defense I spent the better part of the day dealing with a benign but still stressful medical event and I find hospitals exhausting (just the experience; not the staff who were all wonderful), so I did this while drooping with fatigue at 8:30 pm.\nI used  this photo as a model, and it’s supposed to be shrieking  “INKTOBER #11” and then “Happy National Coming Out Day!” I’ve never used watercolors in a Molskine sketchbook though and wow, that didn’t take very well.\nAh well! Tomorrow’s Inktober theme is FORGET, so we can forget about Tuesday.\n "
          }
        ],
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://holliebutler.net/"
              ]
            },
            "value": "https://holliebutler.net/"
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "name": [
          "ClassicPress is fun!"
        ],
        "summary": [
          "This is me messing around with ClassicPress. Yes, I’ve gone back in time and I’m blogging like it’s 2010 again. If you know me personally, you’re probably asking, “Ha ha, which blog from 2010?”\nThere were several. I had a blog problem. I really liked starting new projects (that hasn’t changed). I’m not sure what this will be, if anything. But here we are.\nI’m interested in the IndieWeb, and I want personal websites to be more accessible to people. You know, in case anyone decides to make one again. I have a lot of thoughts about how difficult that is for the average non-techie person, and I’m interested in making it less difficult.\nI’m not sure how to do that, and I’m not sure ClassicPress is the way to get there – not many non-techie folks I know could figure out how to get this installed without a lot of help. But maybe? I think it could be made easier.\nFor now, it’s an awful lot of fun for me. The original WordPress evokes much nostalgia!"
        ],
        "content": [
          {
            "html": "This is me messing around with <a href=\"http://classicpress.net/\">ClassicPress</a>. Yes, I’ve gone back in time and I’m blogging like it’s 2010 again. If you know me personally, you’re probably asking, “Ha ha, which blog from 2010?”\n<p>There were several. I had a blog problem. I really liked starting new projects (that hasn’t changed). I’m not sure what this will be, if anything. But here we are.</p>\n<p>I’m interested in the <a href=\"http://indieweb.org/\">IndieWeb</a>, and I want personal websites to be more accessible to people. You know, in case anyone decides to make one again. I have a lot of thoughts about how difficult that is for the average non-techie person, and I’m interested in making it less difficult.</p>\n<p>I’m not sure how to do that, and I’m not sure ClassicPress is the way to get there – not many non-techie folks I know could figure out how to get this installed without a lot of help. But maybe? I think it could be made easier.</p>\n<p>For now, it’s an awful lot of fun for me. The original WordPress evokes much nostalgia!</p>",
            "value": "This is me messing around with ClassicPress. Yes, I’ve gone back in time and I’m blogging like it’s 2010 again. If you know me personally, you’re probably asking, “Ha ha, which blog from 2010?”\nThere were several. I had a blog problem. I really liked starting new projects (that hasn’t changed). I’m not sure what this will be, if anything. But here we are.\nI’m interested in the IndieWeb, and I want personal websites to be more accessible to people. You know, in case anyone decides to make one again. I have a lot of thoughts about how difficult that is for the average non-techie person, and I’m interested in making it less difficult.\nI’m not sure how to do that, and I’m not sure ClassicPress is the way to get there – not many non-techie folks I know could figure out how to get this installed without a lot of help. But maybe? I think it could be made easier.\nFor now, it’s an awful lot of fun for me. The original WordPress evokes much nostalgia!"
          }
        ],
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://holliebutler.net/"
              ]
            },
            "value": "https://holliebutler.net/"
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "name": [
          "Typos galore"
        ],
        "summary": [
          "I don’t know what’s happening but I’m making typos over and over today. Last night I (temporarily) stopped using my iMac and moved entirely to my laptop instead, maybe that’s it? I checked and the keyboards are the same size. Maybe different clickablenesses or something (that’s not in the dictionary, but it’s a word)."
        ],
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://holliebutler.net/"
              ]
            },
            "value": "https://holliebutler.net/"
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "name": [
          ""
        ],
        "summary": [
          "Alright my pretties, which one of you wants to be a hat?\n🧶"
        ],
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://holliebutler.net/"
              ]
            },
            "value": "https://holliebutler.net/"
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "name": [
          ""
        ],
        "summary": [
          "I would absolutely swear under oath that this dog plots to wait until my meditation session is well underway to lay down next to me and begin farting for the day.\nHE SAVES IT UP. I SWEAR IT TO YOU.\n📷 🐶"
        ],
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://holliebutler.net/"
              ]
            },
            "value": "https://holliebutler.net/"
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "name": [
          "Fall is stationary season"
        ],
        "summary": [
          "I don’t know what it is about fall, but I get an insatiable craving to start a new journal and/or bullet journal, or a new traveler’s journal, and then of course the fountain pens, and the washi tape. I’ve turned so many people onto jetpens.com during the months of September and October. I love it when I ask someone if they’ve heard of the website and they say no, and I can wax rhapsodic."
        ],
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://holliebutler.net/"
              ]
            },
            "value": "https://holliebutler.net/"
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "name": [
          ""
        ],
        "summary": [
          "Little miss little miss little miss\nFood be gone\nAin’t nobody gonna fill your bowl\nWhen you meow your wrongs\nLittle miss little miss little miss\nFOOD BE GONE\nHow you’re gonna howl\nto get into another one of\nthese “my cat be wrong” songs\n📷 🐈"
        ],
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://holliebutler.net/"
              ]
            },
            "value": "https://holliebutler.net/"
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "name": [
          ""
        ],
        "summary": [
          "It’s the toe beans that get me.\n📷\n🐈"
        ],
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://holliebutler.net/"
              ]
            },
            "value": "https://holliebutler.net/"
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "name": [
          ""
        ],
        "summary": [
          "I love these flowers that go all gothic when autumn comes. Other flowers die off, but this one just sticks around, puts on The Cure and tucks in.\n📷🌱"
        ],
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://holliebutler.net/"
              ]
            },
            "value": "https://holliebutler.net/"
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "name": [
          ""
        ],
        "summary": [
          "My entire family has just converged to enthusiastically discuss game theory while standing in my kitchen as I’m trying to make homemade granola bars, and this is exactly the sort of moments I so love and will so miss having regularly, when the kids move out someday."
        ],
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://holliebutler.net/"
              ]
            },
            "value": "https://holliebutler.net/"
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "name": [
          ""
        ],
        "summary": [
          "“And the armor that should rest upon your shoulders, weighs upon your soul.”\n\nGaladriel, heckin poetic elf"
        ],
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://holliebutler.net/"
              ]
            },
            "value": "https://holliebutler.net/"
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "name": [
          ""
        ],
        "summary": [
          "I’ve been helping a young friend with adulting stuff, and now I want to create a curriculum for high school students with classes like Understanding Taxes, Finding a Doctor, Organizing Email and Other Paperwork, etc. The world is complex when you’re fresh out of high school."
        ],
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://holliebutler.net/"
              ]
            },
            "value": "https://holliebutler.net/"
          }
        ]
      }
    }
  ],
  "rels": {
    "alternate": [
      "https://holliebutler.net/feed.xml",
      "https://holliebutler.net/podcast.xml",
      "https://holliebutler.net/feed.json"
    ],
    "EditURI": [
      "https://holliebutler.net/rsd.xml"
    ],
    "stylesheet": [
      "https://holliebutler.net/assets/css/normalize.css",
      "https://holliebutler.net/assets/css/icons.css",
      "https://holliebutler.net/assets/css/screen.css",
      "https://holliebutler.net/custom.css",
      "https://fonts.googleapis.com/css?family=Bree+Serif|Lato:100,100i,300,300i,400,400i,700,700i|Source+Code+Pro:300,400,500,700",
      "https://holliebutler.net/assets/bigfoot/dist/bigfoot-number.css",
      "https://holliebutler.net/css/all.min.css"
    ],
    "me": [
      "https://micro.blog/hollie",
      "https://twitter.com/holliebutler",
      "https://github.com/holliebutler",
      "https://instagram.com/holliebutler"
    ],
    "authorization_endpoint": [
      "https://micro.blog/indieauth/auth"
    ],
    "token_endpoint": [
      "https://micro.blog/indieauth/token"
    ],
    "micropub": [
      "https://micro.blog/micropub"
    ],
    "microsub": [
      "https://micro.blog/microsub"
    ],
    "webmention": [
      "https://micro.blog/webmention"
    ],
    "subscribe": [
      "https://micro.blog/users/follow"
    ],
    "next": [
      "https://holliebutler.net/page/2/"
    ]
  },
  "rel-urls": {
    "https://holliebutler.net/feed.xml": {
      "rels": [
        "alternate"
      ],
      "title": "Hollie Butler",
      "type": "application/rss+xml"
    },
    "https://holliebutler.net/podcast.xml": {
      "rels": [
        "alternate"
      ],
      "title": "Podcast",
      "type": "application/rss+xml"
    },
    "https://holliebutler.net/feed.json": {
      "rels": [
        "alternate"
      ],
      "title": "Hollie Butler",
      "type": "application/json"
    },
    "https://holliebutler.net/rsd.xml": {
      "rels": [
        "EditURI"
      ],
      "type": "application/rsd+xml"
    },
    "https://holliebutler.net/assets/css/normalize.css": {
      "rels": [
        "stylesheet"
      ],
      "type": "text/css"
    },
    "https://holliebutler.net/assets/css/icons.css": {
      "rels": [
        "stylesheet"
      ],
      "type": "text/css"
    },
    "https://holliebutler.net/assets/css/screen.css": {
      "rels": [
        "stylesheet"
      ],
      "type": "text/css"
    },
    "https://holliebutler.net/custom.css": {
      "rels": [
        "stylesheet"
      ],
      "type": "text/css"
    },
    "https://micro.blog/hollie": {
      "rels": [
        "me"
      ]
    },
    "https://twitter.com/holliebutler": {
      "rels": [
        "me"
      ]
    },
    "https://github.com/holliebutler": {
      "rels": [
        "me"
      ]
    },
    "https://instagram.com/holliebutler": {
      "rels": [
        "me"
      ]
    },
    "https://micro.blog/indieauth/auth": {
      "rels": [
        "authorization_endpoint"
      ]
    },
    "https://micro.blog/indieauth/token": {
      "rels": [
        "token_endpoint"
      ]
    },
    "https://micro.blog/micropub": {
      "rels": [
        "micropub"
      ]
    },
    "https://micro.blog/microsub": {
      "rels": [
        "microsub"
      ]
    },
    "https://micro.blog/webmention": {
      "rels": [
        "webmention"
      ]
    },
    "https://micro.blog/users/follow": {
      "rels": [
        "subscribe"
      ]
    },
    "https://fonts.googleapis.com/css?family=Bree+Serif|Lato:100,100i,300,300i,400,400i,700,700i|Source+Code+Pro:300,400,500,700": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://holliebutler.net/assets/bigfoot/dist/bigfoot-number.css": {
      "rels": [
        "stylesheet"
      ],
      "type": "text/css"
    },
    "https://holliebutler.net/css/all.min.css": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://holliebutler.net/page/2/": {
      "rels": [
        "next"
      ],
      "text": "Older Posts →"
    }
  }
}