{
  "items": [
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "url": [
          "https://jan.krutisch.de/en/2022/10/28/the-end-of-an-era.html"
        ],
        "name": [
          "The End of an Era?"
        ],
        "published": [
          "2022-10-28T00:00:00+02:00"
        ],
        "summary": [
          "So Twitter is now officially the playball of a billionaire with a history of questionable business practices, a strong anti union stance and a self proclaimed free-speech-absolutionism.\n\nSounds like a plan. Not necessarily a good one, but a plan."
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "url": [
          "https://jan.krutisch.de/en/2021/08/12/one-of-the-fundamental-questions.html"
        ],
        "name": [
          "One of the fundamental questions"
        ],
        "published": [
          "2021-08-12T00:00:00+02:00"
        ],
        "summary": [
          "As I write this, almost every single country on this planet is dealing with some sort of “environmental” disaster. Floods and wildfires, both “fueled” by weather patterns pushed to the extreme by, let’s just get this out of the way, human made climate change. The extremes of 2021 may be a very seldom outlier on the historic scales of humankind, but if you have read the IPCC report carefully, we can almost guarantee it won’t be an outlier for very long and the extremes of this year will feel muted to us in the not so far distant future.\n\nWell, let’s talk about something different, something more fun, shall we?\n\nThe corona virus is a global pandemic that has caused, so far, around 4 million deaths (that we know of) globally. It has disrupted our lives in a way only very few events can, and I would go as far to say that it probably has affected more humans (absolutely) than any other previous event. Okay, that’s easy. In 1918, we had probably around 1,6 Billion people - We’re now close to 8 Billion.\n\nSo, what do these events, apart from the horror and pain they stack on top of each other, have in common?"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "url": [
          "https://jan.krutisch.de/en/2020/03/02/fort-europa.html"
        ],
        "name": [
          "Fort Europa"
        ],
        "published": [
          "2020-03-02T00:00:00+01:00"
        ],
        "summary": [
          "The European Union is a fascinating construct. It has brought long standing peace to a region that never had more than a few decades of that at a time. It has brought together former enemies and has produced a young generation of Europeans with a complete disregard for borders and language barriers. I love this part with all of my heart.\n\nFrom very early on, though, Europe, as much as it was about togetherness for those who are on the inside, it was also about the otherness of those outside. Frontex, founded in 2004, is the latest bureaucratic manifestation of that. In 2005, one of my favourite rap groups, swedish “Loop Troop” (they later renamed themselves to “Loop Troop Rockers”), published an album and a single named “Fort Europa”, a strong statement of condemning this fortification of the European continent. More and more legislation, on the other hand, ate away at the human right of taking asylum, putting more and more of the burden on the victims, making it harder and harder to enter the EU as a refugee."
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "url": [
          "https://jan.krutisch.de/en/2020/02/17/the-lesser-of-three-evils.html"
        ],
        "name": [
          "The lesser of three evils"
        ],
        "published": [
          "2020-02-17T00:00:00+01:00"
        ],
        "summary": [
          "So far, I’ve only written on my various other blog-like things about my departure from the Apple eco system. Probably about time to write a “proper” blog post about it, but this is not going to be that post.\n\nDuring the lest few days, I noticed that I became more and more frustrated with my current setup and this brought me back to the original reason why I liked my Apple Macs so much."
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "url": [
          "https://jan.krutisch.de/en/2019/02/16/the-climate-has-changed.html"
        ],
        "name": [
          "The climate has changed"
        ],
        "published": [
          "2019-02-16T00:00:00+01:00"
        ],
        "summary": [
          "I swear, I did try to write a “year in review” for 2019, but again, I was very much failing to compress a year with massive ups and downs (with a mild emphasis on downs, I think) into one cohesive blog post. So I think, what I’ll do instead is try to write several posts on the various themese that dominated 2019 and that will probably dominate 2020 as well for me.\n\nThis first post is, well, you may have guessed it from the title, about our climate crisis. 2019 was, after the foreshadowing by the super hot summer of 2018, the year where nobody could (any longer) deny the existence of a climate crisis. Now, of course, I was aware of climate change for a long time. As a studied environmental engineer and with a somewhat solid base of knowledge in natural sciences, it’s not as if I could have escaped it in any way. In fact, during all of my time at university (1996-2002) this was already an ongoing discussion. Heck, my main work experience project was a thing called “climate network” (Klimanet), a website that educated public schools on how to save energy. My diploma thesis was working on solar chargers for rural Namibia, a project meant to aide rural communities in cutting down on gas lamps and open fires."
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "url": [
          "https://jan.krutisch.de/en/2018/09/08/spring-cleaning.html"
        ],
        "name": [
          "Spring Cleaning in September"
        ],
        "published": [
          "2018-09-08T00:00:00+02:00"
        ],
        "summary": [
          "This has been sitting around for quite some time but after a very hectic spring and a loooong summer, I’m now slowly ramping up my indoor activities.\n\nI’m planning on remodeling my living room / office for quite some time now and one of the reasons I haven’t done it yet that I have way too much “stuff” (in all forms and sizes) to gracefully move it from the living room to my bedroom and still have a livable place.\n\nFor that reason, I need to get rid of a lot of stuff. As I despise working with platforms like Ebay classifieds for stuff like this, I’m trying something different: You can find all of my stuff I want to get rid of on my new “Spring Cleaning” web page. If this works, I will add a lot more stuff to that list.\n\nIf you’re interested in something, let me know. There’s some really weird and interesting stuff in there.\n\nI’ll also probably will start to add some books to it."
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "url": [
          "https://jan.krutisch.de/en/2018/01/08/a-new-year-some-new-things.html"
        ],
        "name": [
          "A new year, some new things"
        ],
        "published": [
          "2018-01-08T00:00:00+01:00"
        ],
        "summary": [
          "Between the years I started to work on a “year in review” post but I couldn’t finish it. There are  a couple of things I simply can’t write about that were so dominant throughout the last year that if I wouldn’t have written about them it wouldn’t have felt right. And still, no, sorry. So, yeah, 2017 had it’s ups and downs like every year, but I’m afraid the ups were largely drowned out by the downs. And unfortunately (the main reason I can’t really write about it) the most important downs were personal. But, of course, the state of the world has something to do with it. And, reflecting on my own behaviour and especially my media consumption while trying to write that retrospective, I realized that I needed to change things a bit."
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "url": [
          "https://jan.krutisch.de/en/2017/08/23/this-thing-called-depfu.html"
        ],
        "name": [
          "This thing called Depfu"
        ],
        "published": [
          "2017-08-23T00:00:00+02:00"
        ],
        "summary": [
          "Ugh, I didn’t exactly blog much here lately have I? I did blog in this other place, though, and this other place, called Depfu, is our latest try\nto actually build our own product.\n\nDepfu helps teams that use Ruby and Rails to keep their dependencies up to date by creating Pull Requests on your Repos on GitHub with the updates\nthat are coming in via rubygems.org. It is inspired by greenkeeper, which does the same thing for JavaScrip projects using npm.\n\nToday, Depfu is on ProductHunt. If you want to support us, me or Depfu (or ideally: All of them), you probably know what to do.\n\nThis day is an experiment, as we have temporarily borrowed some really loud loudspeakers and want to create as much buzz as possible. If we can get that done,\nit will probably help us a great deal in bringing Depfu forward on the path to sustainability, which is, of course, our long term goal."
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "url": [
          "https://jan.krutisch.de/en/2016/12/22/the-most-stupid-product-review-ever.html"
        ],
        "name": [
          "The most stupid product review ever"
        ],
        "published": [
          "2016-12-22T00:00:00+01:00"
        ],
        "summary": [
          "Ten days ago, I got myself a Pebble. Yes, a Pebble. In the light of the recent announcements of the now-ex-manufacturer of the Pebble, this sounds like one of the most idiotic ideas ever, and it probably was. The thing is, it was never as cheap to get one of these. I paid less than 100 EUR for a Pebble Time. And I was genuinely interested in the ecosystem. I’m not a watch person, for the most part, otherwise I probably would have gotten one earlier. And now, I’m wearing a Pebble for 10 days and even though reviewing it seems kind of pointless right now, as it is not a product with any sort of future (apart from a few faithful hackers trying to rescue the ecosystem), I think it might actually be interesting to share my findings, especially in the light of the company’s demise."
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "url": [
          "https://jan.krutisch.de/en/2016/12/18/reverse-engineering-craft-synth.html"
        ],
        "name": [
          "Reverse Engineering the CRAFT synth sysex messages"
        ],
        "published": [
          "2016-12-18T00:00:00+01:00"
        ],
        "summary": [
          "This may only be of interest to some of you, but it’s something I wanted to have documented somewhere, so that’s why I made a blog post out of it.\n\nI just got my Modal Electronics CRAFT synth, a surprisingly powerful little synthesizer that comes in a very interesting form factor.\n\n(Update: Today, the app(s) came out and I updated some information in the gist and in this article)."
        ]
      }
    },
    {
      "type": [
        "h-card"
      ],
      "properties": {
        "email": [
          "mailto:jan+www@krutisch.de"
        ],
        "url": [
          "http://twitter.com/halfbyte",
          "http://ruby.social/@halfbyte"
        ],
        "tel": [
          "+49-175-2935345"
        ]
      }
    }
  ],
  "rels": {
    "stylesheet": [
      "https://jan.krutisch.de/css/screen.css"
    ],
    "openid2.provider": [
      "https://openid.stackexchange.com/openid/provider"
    ],
    "openid2.local_id": [
      "https://openid.stackexchange.com/user/8a2dd437-b3d3-4382-87b1-d2c861579ca4"
    ],
    "openid.server": [
      "https://openid.stackexchange.com/openid/provider"
    ],
    "openid.delegate": [
      "https://openid.stackexchange.com/user/8a2dd437-b3d3-4382-87b1-d2c861579ca4"
    ],
    "me": [
      "https://twitter.com/halfbyte",
      "https://soundcloud.com/halfbyte",
      "https://github.com/halfbyte",
      "https://www.flickr.com/photos/jankrutisch/",
      "https://ruby.social/@halfbyte",
      "https://write.halfbyte.org/",
      "mailto:jan+www@krutisch.de",
      "http://twitter.com/halfbyte",
      "http://ruby.social/@halfbyte",
      "tel:+49-175-2935345"
    ],
    "pingback": [
      "https://webmention.io/jan.krutisch.de/xmlrpc"
    ],
    "webmention": [
      "https://webmention.io/jan.krutisch.de/webmention"
    ],
    "alternate": [
      "https://jan.krutisch.de/atom.xml",
      "https://jan.krutisch.de/rss.xml",
      "https://jan.krutisch.de/feed.json"
    ],
    "license": [
      "https://creativecommons.org/licenses/by-sa/3.0/de/",
      "http://creativecommons.org/licenses/by-sa/3.0/de/"
    ],
    "dc:type": [
      "http://purl.org/dc/dcmitype/Text"
    ]
  },
  "rel-urls": {
    "https://jan.krutisch.de/css/screen.css": {
      "rels": [
        "stylesheet"
      ],
      "media": "screen",
      "type": "text/css"
    },
    "https://openid.stackexchange.com/openid/provider": {
      "rels": [
        "openid2.provider"
      ]
    },
    "https://openid.stackexchange.com/user/8a2dd437-b3d3-4382-87b1-d2c861579ca4": {
      "rels": [
        "openid2.local_id"
      ]
    },
    "https://twitter.com/halfbyte": {
      "rels": [
        "me"
      ]
    },
    "https://soundcloud.com/halfbyte": {
      "rels": [
        "me"
      ]
    },
    "https://github.com/halfbyte": {
      "rels": [
        "me"
      ]
    },
    "https://www.flickr.com/photos/jankrutisch/": {
      "rels": [
        "me"
      ]
    },
    "https://ruby.social/@halfbyte": {
      "rels": [
        "me"
      ]
    },
    "https://write.halfbyte.org/": {
      "rels": [
        "me"
      ]
    },
    "https://webmention.io/jan.krutisch.de/xmlrpc": {
      "rels": [
        "pingback"
      ]
    },
    "https://webmention.io/jan.krutisch.de/webmention": {
      "rels": [
        "webmention"
      ]
    },
    "https://jan.krutisch.de/atom.xml": {
      "rels": [
        "alternate"
      ],
      "title": "ATOM Feed",
      "type": "application/atom+xml"
    },
    "https://jan.krutisch.de/rss.xml": {
      "rels": [
        "alternate"
      ],
      "title": "RSS Feed",
      "type": "application/rss+xml"
    },
    "https://jan.krutisch.de/feed.json": {
      "rels": [
        "alternate"
      ],
      "title": "JSON Feed",
      "type": "application/json"
    },
    "mailto:jan+www@krutisch.de": {
      "rels": [
        "me"
      ],
      "text": "via Email"
    },
    "http://twitter.com/halfbyte": {
      "rels": [
        "me"
      ],
      "text": "on Twitter"
    },
    "http://ruby.social/@halfbyte": {
      "rels": [
        "me"
      ],
      "text": "on the Fediverse"
    },
    "tel:+49-175-2935345": {
      "rels": [
        "me"
      ],
      "text": "+49-175-2935345"
    },
    "https://creativecommons.org/licenses/by-sa/3.0/de/": {
      "rels": [
        "license"
      ]
    },
    "http://purl.org/dc/dcmitype/Text": {
      "rels": [
        "dc:type"
      ],
      "text": "Text"
    },
    "http://creativecommons.org/licenses/by-sa/3.0/de/": {
      "rels": [
        "license"
      ],
      "text": "Creative Commons-License"
    }
  }
}