{
  "items": [
    {
      "type": [
        "h-feed"
      ],
      "properties": {},
      "children": [
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "content": [
              {
                "html": "<p><strong>Happy New Year!</strong> I wish for us all that 2023 will be a great year with joy, success, and whatever other wishes are on your mind. A year is just a number and a new page on the calendar, but we still like to use them as a mental model to structure time and understand ourselves. A new year is a time to look forward and make plans. It’s time to be optimistic.</p>\n\n<p>In December 2021, a bit more than a year ago, <a href=\"https://lukasrosenstock.net/2021/12/27/its-the-time.html\">I wrote a post laying out goals for 2022</a>. It wasn’t a set of resolutions, just questions I wanted to explore and the commitment to regular review practice. Rereading this post, I could have written it just yesterday. It appears I’m no further than I was a year ago. I didn’t implement the review practice last year, but I’m trying again for 2023.</p>\n\n<p>I attended a <a href=\"https://lu.ma/annual-review\">yearly review workshop</a> hosted online by my friend <a href=\"https://www.vensy.me/\">Vensy</a>. She had a fantastic review template with many great questions for analyzing the previous year and visualizing the next. The workshop lasted one hour, and it was expected that we could only do the first iteration of our answers. Doing a full review should take at least thrice the time. Still, I was shocked by the number of blank fields at the end of the hour. When we talked about this in the workshop, I said that the lack of a regular review made it so that looking at the whole year was too much at one time, which Vensy also confirmed and stressed the importance of reviewing your life regularly.</p>\n\n<p>However, two more things made it hard for me to fill in the blanks in Vensy’s worksheets. There are questions that I find tough to answer, especially when I’m asked to name, rate, or compare things. Writing down my favorite X or the top 3 Y in black on white makes me very uncomfortable. I don’t usually think in superlatives or comparatives. Such statements express a level of confidence I don’t feel, and they seem unfair to those being rated, even if X and Y are things and not people with feelings and may never learn how I rate them.</p>\n\n<p>The other interpretation of my difficulty in doing a yearly review could be that there wasn’t just a lot that I deem great about the year. I can’t confidently say I have progressed. Maybe 2022 was a year of stagnancy. Some notable things happened this year, such as <a href=\"https://designapis.com/\">the release of a published book</a>, but that doesn’t count as a 2022 achievement because the work that went into it started in 2020 and primarily happened in 2021. All my major work projects were continuations of projects I started in the previous year. I had a solid URL-to-IRL pipeline (for those not chronically online, it means meeting people in person that you got to know through social networks or online communities), but that was also the result of online interactions in the previous years. I can’t think of anything I truly started anew in 2022 or unique first experiences. And I’m unaware if I’m just unaware of those, unable to celebrate them, or if I’ve become stagnant. I just turned 38 last month, and while that’s not exactly very young, it’s way too young to believe your life can’t change and you can’t make new first experiences or improve yourself.</p>\n\n<p>I made some preparations for a new take on self-improvement. In November, I participated in the <a href=\"https://nesslabs.com/masterclass\">Mindful Productivity Masterclass hosted by Anne-Laure LeCunff of Ness Labs</a>. As part of the course exercises, I created a <em>mindful productivity map</em>, planning and outlining my current direction, anchor ritual, support system, metacognition practice, and indicators of success. However, I still need to implement this in my life. I had a good excuse for December because there was almost no daily routine. I first fell ill with a cold and the side effects of dental surgery, then COVID hit, and when I barely tested negative again, I went on two business trips. First, I visited a client in Vienna, then attended the API Days conference in Paris. Afterward, it was already time for the holiday season. But I have no excuse for January, where I expect a lot more daily routine that I can optimize. I also started reading <a href=\"https://jamesclear.com/atomic-habits\">Atomic Habits by James Clear</a> after seeing it recommended in every corner of the Internet I frequent.</p>\n\n<p><em>Goal setting:</em> I aim to implement and adapt the mindful productivity map for January and get back into some more tiny habit improvements. I will also post a summary of the map on this blog.</p>",
                "value": "Happy New Year! I wish for us all that 2023 will be a great year with joy, success, and whatever other wishes are on your mind. A year is just a number and a new page on the calendar, but we still like to use them as a mental model to structure time and understand ourselves. A new year is a time to look forward and make plans. It’s time to be optimistic.\n\nIn December 2021, a bit more than a year ago, I wrote a post laying out goals for 2022. It wasn’t a set of resolutions, just questions I wanted to explore and the commitment to regular review practice. Rereading this post, I could have written it just yesterday. It appears I’m no further than I was a year ago. I didn’t implement the review practice last year, but I’m trying again for 2023.\n\nI attended a yearly review workshop hosted online by my friend Vensy. She had a fantastic review template with many great questions for analyzing the previous year and visualizing the next. The workshop lasted one hour, and it was expected that we could only do the first iteration of our answers. Doing a full review should take at least thrice the time. Still, I was shocked by the number of blank fields at the end of the hour. When we talked about this in the workshop, I said that the lack of a regular review made it so that looking at the whole year was too much at one time, which Vensy also confirmed and stressed the importance of reviewing your life regularly.\n\nHowever, two more things made it hard for me to fill in the blanks in Vensy’s worksheets. There are questions that I find tough to answer, especially when I’m asked to name, rate, or compare things. Writing down my favorite X or the top 3 Y in black on white makes me very uncomfortable. I don’t usually think in superlatives or comparatives. Such statements express a level of confidence I don’t feel, and they seem unfair to those being rated, even if X and Y are things and not people with feelings and may never learn how I rate them.\n\nThe other interpretation of my difficulty in doing a yearly review could be that there wasn’t just a lot that I deem great about the year. I can’t confidently say I have progressed. Maybe 2022 was a year of stagnancy. Some notable things happened this year, such as the release of a published book, but that doesn’t count as a 2022 achievement because the work that went into it started in 2020 and primarily happened in 2021. All my major work projects were continuations of projects I started in the previous year. I had a solid URL-to-IRL pipeline (for those not chronically online, it means meeting people in person that you got to know through social networks or online communities), but that was also the result of online interactions in the previous years. I can’t think of anything I truly started anew in 2022 or unique first experiences. And I’m unaware if I’m just unaware of those, unable to celebrate them, or if I’ve become stagnant. I just turned 38 last month, and while that’s not exactly very young, it’s way too young to believe your life can’t change and you can’t make new first experiences or improve yourself.\n\nI made some preparations for a new take on self-improvement. In November, I participated in the Mindful Productivity Masterclass hosted by Anne-Laure LeCunff of Ness Labs. As part of the course exercises, I created a mindful productivity map, planning and outlining my current direction, anchor ritual, support system, metacognition practice, and indicators of success. However, I still need to implement this in my life. I had a good excuse for December because there was almost no daily routine. I first fell ill with a cold and the side effects of dental surgery, then COVID hit, and when I barely tested negative again, I went on two business trips. First, I visited a client in Vienna, then attended the API Days conference in Paris. Afterward, it was already time for the holiday season. But I have no excuse for January, where I expect a lot more daily routine that I can optimize. I also started reading Atomic Habits by James Clear after seeing it recommended in every corner of the Internet I frequent.\n\nGoal setting: I aim to implement and adapt the mindful productivity map for January and get back into some more tiny habit improvements. I will also post a summary of the map on this blog."
              }
            ],
            "url": [
              "https://lukasrosenstock.net/2023/01/02/happy-new-year.html"
            ],
            "published": [
              "2023-01-02 18:37:19 +0100"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "content": [
              {
                "html": "<p>My social media strategy for 2023 still needs to be defined. <a href=\"https://lukasrosenstock.net/2022/12/27/when-elon-musk.html\">In my previous post, I wrote about Twitter and Mastodon and how the future of Twitter looks unclear</a>. I’m interested in decentralized networks, so I should use Mastodon more. But I was also thinking about investing more in Twitter and using it strategically for my business and personal goals, trying out new social media marketing tools. I should also post more regularly on LinkedIn to reach those who don’t hang out on Twitter. There are other networks that I’ve joined but don’t use. And overall, I need to ensure that my usage of these sites is healthy and that <a href=\"https://lukasrosenstock.net/2021/02/16/my-friend-clo.html\">I don’t end up doom-scrolling or procrasti-reading</a>.</p>\n\n<p>However, for now, I have decided on a <em>wait-and-see</em> approach. More specifically, I have added figuring out social media to the <em>not-to-do</em> list for January. My reasoning is as follows.</p>\n\n<p>At the moment, the situation with Twitter is in flux. What will Elon Musk do next? I assume things will stabilize, and he will put someone else in charge, but the company’s strategy needs to be clarified. And Mastodon is growing, but I’m curious if it will become a target for social media marketing and if third-party tools like schedulers will support that or if the Fediverse will actively resist this commercial side of social media. In about a month, I can be more confident about the state of things and see where they’re going.</p>\n\n<p>The other reason is that I should focus on something other than marketing and personal brand building right now. I have a few long-term and returning clients and projects in the pipeline, so I can wait to sell more. I need to establish goals first. <a href=\"https://lukasrosenstock.net/2019/11/22/im-happy-to.html\">Three years ago, I created a website focused on selling developer content production</a>. However, that was only one aspect of my work since then, and I’ve worked on many other things.</p>\n\n<p>I’m often thinking about whether I should add more focus to my work and establish myself better in a niche or continue doing what I’m doing right now. Focusing would mean saying “No” to current projects I enjoy - <a href=\"https://lukasrosenstock.net/2020/09/08/i-wanted-to.html\">and I don’t like saying “No”</a>. But the path to growth from freelancer to an entrepreneur is productizing services, which requires some focus. So, there’s a lot on my mind that I need to figure out finally. The social network on which I announce the result has yet to have priority.</p>\n\n<p>I’ll end with <a href=\"https://twitter.com/TomFrankly/status/1607555884229734402\">a Twitter thread by Thomas Frank, who claims that regularly posting on social media is insignificant</a>. What matters more is working in seasons. Sometimes you need to go into hermit mode and create great things. Then, start “touring season” and reap the rewards. Now is my time for hermit mode.</p>",
                "value": "My social media strategy for 2023 still needs to be defined. In my previous post, I wrote about Twitter and Mastodon and how the future of Twitter looks unclear. I’m interested in decentralized networks, so I should use Mastodon more. But I was also thinking about investing more in Twitter and using it strategically for my business and personal goals, trying out new social media marketing tools. I should also post more regularly on LinkedIn to reach those who don’t hang out on Twitter. There are other networks that I’ve joined but don’t use. And overall, I need to ensure that my usage of these sites is healthy and that I don’t end up doom-scrolling or procrasti-reading.\n\nHowever, for now, I have decided on a wait-and-see approach. More specifically, I have added figuring out social media to the not-to-do list for January. My reasoning is as follows.\n\nAt the moment, the situation with Twitter is in flux. What will Elon Musk do next? I assume things will stabilize, and he will put someone else in charge, but the company’s strategy needs to be clarified. And Mastodon is growing, but I’m curious if it will become a target for social media marketing and if third-party tools like schedulers will support that or if the Fediverse will actively resist this commercial side of social media. In about a month, I can be more confident about the state of things and see where they’re going.\n\nThe other reason is that I should focus on something other than marketing and personal brand building right now. I have a few long-term and returning clients and projects in the pipeline, so I can wait to sell more. I need to establish goals first. Three years ago, I created a website focused on selling developer content production. However, that was only one aspect of my work since then, and I’ve worked on many other things.\n\nI’m often thinking about whether I should add more focus to my work and establish myself better in a niche or continue doing what I’m doing right now. Focusing would mean saying “No” to current projects I enjoy - and I don’t like saying “No”. But the path to growth from freelancer to an entrepreneur is productizing services, which requires some focus. So, there’s a lot on my mind that I need to figure out finally. The social network on which I announce the result has yet to have priority.\n\nI’ll end with a Twitter thread by Thomas Frank, who claims that regularly posting on social media is insignificant. What matters more is working in seasons. Sometimes you need to go into hermit mode and create great things. Then, start “touring season” and reap the rewards. Now is my time for hermit mode."
              }
            ],
            "url": [
              "https://lukasrosenstock.net/2022/12/29/my-social-media.html"
            ],
            "published": [
              "2022-12-29 13:17:50 +0100"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "content": [
              {
                "html": "<p>When Elon Musk bought Twitter, I had very few expectations about the impact on the service. I’m neither a Musk fanboy nor an Elon hater (as the meme goes, I’m a third, more complex thing). He deserves credit for his entrepreneurial activities, including bringing electric cars to the mainstream car lover and reviving space travel. On the other hand, I knew some of his behavior and opinions were questionable, at the very least. And I’m generally wary of billionaires accumulating too much power, including control over an essential communication and media platform. However, I didn’t expect that Twitter would change significantly under Musk’s leadership. Now I have to admit I was wrong.</p>\n\n<p>After he entered the Twitter headquarters (with a sink, just for a pun’s sake), Musk quickly changed the culture into “move fast and break things”, a motto that might work for an early startup but not for an established platform. Things have gotten chaotic, making many people worry about the long-term stability and viability of the service. I don’t want to recount everything he did and subsequently roll back. However, I’m pondering how to use Twitter in the future.</p>\n\n<p>The chaos at Twitter has been great for alternative social networks. <a href=\"https://www.tumblr.com/\">Tumblr</a> appears to make a comeback. New competitors like <a href=\"https://cohost.org/\">CoHost</a> are appearing. The biggest benefactor is <a href=\"https://joinmastodon.org/\">Mastodon</a>, though, along with the whole cosmos of <a href=\"https://en.wikipedia.org/wiki/ActivityPub\">ActivityPub</a>-powered federated platforms often referred to as <em>the Fediverse</em>. There have been exodus waves from old social media sites into new networks, but they have yet to be sustainable. It could be different this time. I don’t expect Twitter to die or claim the Fediverse is already a complete replacement. Still, Mastodon might be the first federated network since email to graduate from geek toy to mainstream endorsement. There might have never been a better time to migrate.</p>\n\n<p>From seeing the first drafts of <a href=\"https://openid.net/\">OpenID</a> to being a participant at <a href=\"https://indieweb.org/\">IndieWebCamp</a>, I’ve always been interested in federated and decentralized technology. Hence, observing these developments is interesting. However, I’m also worried about the financial and administrative sustainability of the Fediverse. Decentralization has a lot of advantages, but it’s neither a business model nor a panacea that solves all problems inherent to social media. In <a href=\"https://steadyhq.com/en/digital-garden/posts/aefe96a5-5a56-4fa3-80c7-4b9cfb81ca78\">“Smoke alarm and snowfall”</a>, Julia Racsko shares similar sentiments. Decentralized social media is an experiment that can fail, and we may find that centralization is better.</p>\n\n<p>While Elon Musk seems erratic as the head of Twitter, his general idea of emphasizing the Twitter Blue subscription model over funding from ads seems intriguing. It’s another experiment that I want to see played out. It could change the overall vibe when Twitter rewards paid users more attention. The most active and visible Twitter users could be those who can justify Twitter Blue as a business expense, engaging more in promotion than conversation. Maybe we see a split where Twitter becomes even more of a broadcast network, and regular discussions move to Mastodon. Also, if the paid model works, <a href=\"https://lukasrosenstock.net/2020/04/26/this-blog-youre.html\">Twitter could become what app.net tried to be</a>. Of course, this is all speculation.</p>\n\n<p>As I’m observing and speculating, I need to develop my social media strategy. I have <a href=\"https://indieweb.social/@lukas\">two Mastodon accounts</a>, but I rarely post on either. That should change because I don’t want the Fediverse to be a ghost town. <a href=\"https://twitter.com/LukasRosenstock\">On Twitter</a>, I promote my business and <a href=\"https://designapis.com/\">my book</a> and drive the conversation with the tech community around APIs and Developer Experience. I also engage in discussions around a broad range of interests with a vast community of active Twitter users. Doing both from the same account seems challenging, but setting up an “alt” account seems overkill, and I know there will be analysis paralysis if a tweet could fit both, and I can’t decide where to post. On top of that, I should spend less time on social media and more time creating stuff and engaging with people in the real world or more intimate virtual spaces.</p>\n\n<p>While figuring mine out, I’m curious to hear about your goals and plans for social media usage in 2023 and how you deal with the Twitter situation.</p>",
                "value": "When Elon Musk bought Twitter, I had very few expectations about the impact on the service. I’m neither a Musk fanboy nor an Elon hater (as the meme goes, I’m a third, more complex thing). He deserves credit for his entrepreneurial activities, including bringing electric cars to the mainstream car lover and reviving space travel. On the other hand, I knew some of his behavior and opinions were questionable, at the very least. And I’m generally wary of billionaires accumulating too much power, including control over an essential communication and media platform. However, I didn’t expect that Twitter would change significantly under Musk’s leadership. Now I have to admit I was wrong.\n\nAfter he entered the Twitter headquarters (with a sink, just for a pun’s sake), Musk quickly changed the culture into “move fast and break things”, a motto that might work for an early startup but not for an established platform. Things have gotten chaotic, making many people worry about the long-term stability and viability of the service. I don’t want to recount everything he did and subsequently roll back. However, I’m pondering how to use Twitter in the future.\n\nThe chaos at Twitter has been great for alternative social networks. Tumblr appears to make a comeback. New competitors like CoHost are appearing. The biggest benefactor is Mastodon, though, along with the whole cosmos of ActivityPub-powered federated platforms often referred to as the Fediverse. There have been exodus waves from old social media sites into new networks, but they have yet to be sustainable. It could be different this time. I don’t expect Twitter to die or claim the Fediverse is already a complete replacement. Still, Mastodon might be the first federated network since email to graduate from geek toy to mainstream endorsement. There might have never been a better time to migrate.\n\nFrom seeing the first drafts of OpenID to being a participant at IndieWebCamp, I’ve always been interested in federated and decentralized technology. Hence, observing these developments is interesting. However, I’m also worried about the financial and administrative sustainability of the Fediverse. Decentralization has a lot of advantages, but it’s neither a business model nor a panacea that solves all problems inherent to social media. In “Smoke alarm and snowfall”, Julia Racsko shares similar sentiments. Decentralized social media is an experiment that can fail, and we may find that centralization is better.\n\nWhile Elon Musk seems erratic as the head of Twitter, his general idea of emphasizing the Twitter Blue subscription model over funding from ads seems intriguing. It’s another experiment that I want to see played out. It could change the overall vibe when Twitter rewards paid users more attention. The most active and visible Twitter users could be those who can justify Twitter Blue as a business expense, engaging more in promotion than conversation. Maybe we see a split where Twitter becomes even more of a broadcast network, and regular discussions move to Mastodon. Also, if the paid model works, Twitter could become what app.net tried to be. Of course, this is all speculation.\n\nAs I’m observing and speculating, I need to develop my social media strategy. I have two Mastodon accounts, but I rarely post on either. That should change because I don’t want the Fediverse to be a ghost town. On Twitter, I promote my business and my book and drive the conversation with the tech community around APIs and Developer Experience. I also engage in discussions around a broad range of interests with a vast community of active Twitter users. Doing both from the same account seems challenging, but setting up an “alt” account seems overkill, and I know there will be analysis paralysis if a tweet could fit both, and I can’t decide where to post. On top of that, I should spend less time on social media and more time creating stuff and engaging with people in the real world or more intimate virtual spaces.\n\nWhile figuring mine out, I’m curious to hear about your goals and plans for social media usage in 2023 and how you deal with the Twitter situation."
              }
            ],
            "url": [
              "https://lukasrosenstock.net/2022/12/27/when-elon-musk.html"
            ],
            "published": [
              "2022-12-27 16:13:18 +0100"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "content": [
              {
                "html": "<p><a href=\"https://interintellect.com/salon/how-to-flirt-with-the-world/\">“How to flirt with the world”</a> was the name of the Interintellect salon I attended tonight. <a href=\"https://twitter.com/pragueyerrr\">Pragya G.</a>, who I’ve been following on Twitter for a few months now, hosted it as her debut salon. I want to give a personal recount of my experience at the salon and why I attended it in the first place.</p>\n\n<p>“Flirting” isn’t a word that’s been part of my regular vocabulary, and I’ve long had a lot of negative connotations. I would mostly think of cheesy pick-up lines and people (primarily men) aggressively forcing a sexual or romantic layer into a conversation instead of letting it flow naturally. It wasn’t until I came across an article (to which I sadly don’t have a link anymore) that my perspective changed. It described flirting in different terms. It doesn’t have to be sexual or romantic at all. It’s mostly just an open-minded, cheerful, light, and playful way to interact with the people you meet. It’s certainly not something I’m good at or do regularly, but I deem it positive and desirable. According to her tweets and the salon description, Pragya’s idea of flirting seems to be similar. She’s also someone I admire for her capability to feel gratitude for other people and the mundane aspects of life, something I’m not good at either.</p>\n\n<p>Having <a href=\"https://lukasrosenstock.net/2021/06/27/mishka-orakzai-is.html\">attended</a> <a href=\"https://lukasrosenstock.net/2021/06/26/dominic-duffins-recent.html\">multiple</a> Interintellect salons, I observed that various hosts have different hosting styles. For Pragya, I noticed that she practiced what she preaches and flirted with all the attendees. But most of all, she cared a lot about all her attendees. She didn’t take that we took the time to join her for granted. Gratitude doesn’t always appear authentic when it seems over the top, but I could accept it as genuine from her. Maybe it’s because she told the story about one of her friends who did this for her, and she wants to carry it into the world, making others feel recognized. There’s <a href=\"https://www.youtube.com/watch?v=2Biz0KHadk4\">an interview with Tasshin Fogleman</a> that I listened to a while ago, which helped me understand from where she’s coming.</p>\n\n<p>When the salon started, Pragya asked us to think of a situation in which we were involved in a successful flirt and what words and thoughts come into our minds when we think of it. One attendee came up with the term <em>“benevolent transgressions”</em>, which continued to be a theme throughout the salon. Flirting is always a play with boundaries; we also described it as a “dance of small steps” or “making small bets”.</p>\n\n<p>Interestingly, Pragya, who does one-on-one flirt coaching, mentioned that the number one fear of her male clients is crossing too many boundaries and, thus, appearing creepy. This fear seems primarily male-coded, whereas women worry more about leading on and sending the wrong signs. In this context, most attendees agreed that indicating interest isn’t creepy, but only when someone cannot process disinterest from the other side. The conversation reminded me of <a href=\"https://twitter.com/Clo__S/status/1580114810318262274\">a recent tweet from Clo S.</a>, who said it’s usually the “wholesome dudes” who worry about creepiness. The problem is that you cannot fully take responsibility for another person’s feelings. Yes, nobody should be a creep, but it’s practically impossible to live a life where the amount of discomfort you trigger in other people is zero because that would mean excluding yourself from potentially positive interactions. I think this is something I still need to learn and internalize. Making people just a tiny bit uncomfortable is okay as long as you are willing to admit mistakes, back off, and move on.</p>\n\n<p>We touched on various other topics, such as the distinction between general and more romantic flirting. An interesting framing was that you could start with undirected flirting and then continually make it more directed to a person if they respond. People can flirt or be the receiver of a flirtatious approach without noticing it. It’s also possible to extend the definition of flirting by including things beyond people or even ideas. You can flirt with friends, but not everybody responds well, so you need to adapt. Most people like recognition and compliments, but people with low confidence may question their motives and not always take them positively.</p>\n\n<p>The primary motivation for flirting should be generosity, the desire to make other people feel good. It is where Pragya’s idea of “flirting with the world” comes from, and many attendees can relate, even if there are additional ulterior motives behind the action.</p>\n\n<p>It was a delightful salon; as I mentioned before, Pragya tried to make it a wonderful experience for everyone. It was also quite emotional for me, although I’m unsure if it was the room’s topic, host, or general vibe. I hope she’ll host more Interintellect salons in the future.</p>",
                "value": "“How to flirt with the world” was the name of the Interintellect salon I attended tonight. Pragya G., who I’ve been following on Twitter for a few months now, hosted it as her debut salon. I want to give a personal recount of my experience at the salon and why I attended it in the first place.\n\n“Flirting” isn’t a word that’s been part of my regular vocabulary, and I’ve long had a lot of negative connotations. I would mostly think of cheesy pick-up lines and people (primarily men) aggressively forcing a sexual or romantic layer into a conversation instead of letting it flow naturally. It wasn’t until I came across an article (to which I sadly don’t have a link anymore) that my perspective changed. It described flirting in different terms. It doesn’t have to be sexual or romantic at all. It’s mostly just an open-minded, cheerful, light, and playful way to interact with the people you meet. It’s certainly not something I’m good at or do regularly, but I deem it positive and desirable. According to her tweets and the salon description, Pragya’s idea of flirting seems to be similar. She’s also someone I admire for her capability to feel gratitude for other people and the mundane aspects of life, something I’m not good at either.\n\nHaving attended multiple Interintellect salons, I observed that various hosts have different hosting styles. For Pragya, I noticed that she practiced what she preaches and flirted with all the attendees. But most of all, she cared a lot about all her attendees. She didn’t take that we took the time to join her for granted. Gratitude doesn’t always appear authentic when it seems over the top, but I could accept it as genuine from her. Maybe it’s because she told the story about one of her friends who did this for her, and she wants to carry it into the world, making others feel recognized. There’s an interview with Tasshin Fogleman that I listened to a while ago, which helped me understand from where she’s coming.\n\nWhen the salon started, Pragya asked us to think of a situation in which we were involved in a successful flirt and what words and thoughts come into our minds when we think of it. One attendee came up with the term “benevolent transgressions”, which continued to be a theme throughout the salon. Flirting is always a play with boundaries; we also described it as a “dance of small steps” or “making small bets”.\n\nInterestingly, Pragya, who does one-on-one flirt coaching, mentioned that the number one fear of her male clients is crossing too many boundaries and, thus, appearing creepy. This fear seems primarily male-coded, whereas women worry more about leading on and sending the wrong signs. In this context, most attendees agreed that indicating interest isn’t creepy, but only when someone cannot process disinterest from the other side. The conversation reminded me of a recent tweet from Clo S., who said it’s usually the “wholesome dudes” who worry about creepiness. The problem is that you cannot fully take responsibility for another person’s feelings. Yes, nobody should be a creep, but it’s practically impossible to live a life where the amount of discomfort you trigger in other people is zero because that would mean excluding yourself from potentially positive interactions. I think this is something I still need to learn and internalize. Making people just a tiny bit uncomfortable is okay as long as you are willing to admit mistakes, back off, and move on.\n\nWe touched on various other topics, such as the distinction between general and more romantic flirting. An interesting framing was that you could start with undirected flirting and then continually make it more directed to a person if they respond. People can flirt or be the receiver of a flirtatious approach without noticing it. It’s also possible to extend the definition of flirting by including things beyond people or even ideas. You can flirt with friends, but not everybody responds well, so you need to adapt. Most people like recognition and compliments, but people with low confidence may question their motives and not always take them positively.\n\nThe primary motivation for flirting should be generosity, the desire to make other people feel good. It is where Pragya’s idea of “flirting with the world” comes from, and many attendees can relate, even if there are additional ulterior motives behind the action.\n\nIt was a delightful salon; as I mentioned before, Pragya tried to make it a wonderful experience for everyone. It was also quite emotional for me, although I’m unsure if it was the room’s topic, host, or general vibe. I hope she’ll host more Interintellect salons in the future."
              }
            ],
            "url": [
              "https://lukasrosenstock.net/2022/10/22/how-to-flirt.html"
            ],
            "published": [
              "2022-10-22 21:45:28 +0100"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "content": [
              {
                "html": "<p>When I was in Lisbon for a month in 2019, I leveraged almost every opportunity to meet new people. One of the events I attended was called <a href=\"http://highfivefriending.com/\">High Five Friending</a>. It was a variant of a concept known as speed dating but taken out of the dating context to support a broader range of connections. A large group got together in a rooftop bar and had to install a mobile app that would ring every ten minutes to show you the picture of a person you should find as your next conversation partner. It was the first time I had participated in something like this, and I found it very enjoyable, even though it required a lot of energy to have so many conversations in a single night. This event gave me the confidence to participate in an actual speed dating event later that year, but that’s a different story.</p>\n\n<p>Events facilitating one-on-one conversations are perfect, especially if you consider yourself shy or introverted. It may sound counter-intuitive initially, but I’ve noticed that I often tend to go quiet and listen without speaking in group settings. I find it hard to assert dominance and keep up with the speed of the conversation. A few people end up dominating the group. Having the undivided attention of another person, even just for ten minutes, means you can talk more and thus get more out of the encounter. Unsurprisingly, the Effective Altruism (EA) movement emphasizes one-on-one in its community-building strategy.</p>\n\n<p>Local events like “High Five Friending” help find people in your vicinity. What can you do if you want to meet friends worldwide?! Luckily, a speed-dating setup works well with video chat applications like Zoom. For the Interintellect community, mingling salons have always been part of the other, along with the topic-based salons. Community members Brian Ahuja and Katrina Dela Cruz have hosted them a few times, but lately, the events happened at hours optimized for a primarily American audience. <a href=\"https://lu.ma/angrigoryan\">Anna Grigoryan</a> and I wanted to attend the last one and voiced our discomfort with the scheduling in Discord. Instead of complaining or swallowing the pill of attending in the middle of the night, we spontaneously decided to team up and host our own mingle salon.</p>\n\n<p>After that long-winded introduction, all that’s left for me to say is that I would love to see you <a href=\"https://interintellect.com/salon/the-great-european-interintellect-friend-finding-self-discovering-mingle/\">at our salon</a>. It will occur on Sunday, September 18th, at 18:00 CET. You don’t have to be an Interintellect member to come; you can <a href=\"https://interintellect.com/salon/the-great-european-interintellect-friend-finding-self-discovering-mingle/\">book a ticket directly through their website</a>.</p>",
                "value": "When I was in Lisbon for a month in 2019, I leveraged almost every opportunity to meet new people. One of the events I attended was called High Five Friending. It was a variant of a concept known as speed dating but taken out of the dating context to support a broader range of connections. A large group got together in a rooftop bar and had to install a mobile app that would ring every ten minutes to show you the picture of a person you should find as your next conversation partner. It was the first time I had participated in something like this, and I found it very enjoyable, even though it required a lot of energy to have so many conversations in a single night. This event gave me the confidence to participate in an actual speed dating event later that year, but that’s a different story.\n\nEvents facilitating one-on-one conversations are perfect, especially if you consider yourself shy or introverted. It may sound counter-intuitive initially, but I’ve noticed that I often tend to go quiet and listen without speaking in group settings. I find it hard to assert dominance and keep up with the speed of the conversation. A few people end up dominating the group. Having the undivided attention of another person, even just for ten minutes, means you can talk more and thus get more out of the encounter. Unsurprisingly, the Effective Altruism (EA) movement emphasizes one-on-one in its community-building strategy.\n\nLocal events like “High Five Friending” help find people in your vicinity. What can you do if you want to meet friends worldwide?! Luckily, a speed-dating setup works well with video chat applications like Zoom. For the Interintellect community, mingling salons have always been part of the other, along with the topic-based salons. Community members Brian Ahuja and Katrina Dela Cruz have hosted them a few times, but lately, the events happened at hours optimized for a primarily American audience. Anna Grigoryan and I wanted to attend the last one and voiced our discomfort with the scheduling in Discord. Instead of complaining or swallowing the pill of attending in the middle of the night, we spontaneously decided to team up and host our own mingle salon.\n\nAfter that long-winded introduction, all that’s left for me to say is that I would love to see you at our salon. It will occur on Sunday, September 18th, at 18:00 CET. You don’t have to be an Interintellect member to come; you can book a ticket directly through their website."
              }
            ],
            "url": [
              "https://lukasrosenstock.net/2022/09/13/when-i-was.html"
            ],
            "published": [
              "2022-09-13 12:17:30 +0100"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "content": [
              {
                "html": "<p>Just nine euros to travel throughout the country! It was probably the most-liked policy the German government introduced this year, designed to help with rising energy costs. A highly subsidized monthly ticket granted access to the entire public transportation network in Germany, only excluding long-distance trains. You could buy it for June, July, and August, so it is currently the last month where it’s available. In <a href=\"https://lukasrosenstock.net/2022/08/09/the-climate-crisis.html\">our fight against the climate crisis</a>, changing modes of traffic is a crucial building block. There was hope that it would move some commuter traffic from individual cars to buses and trains, but the effect seems small, probably because it was a temporary measure. However, the ticket supported local tourism and granted the financially poorer members of society the ability to travel.</p>\n\n<p>One of the ticket’s effects was that it rekindled the discussion about public transportation prices. There has always been this idea it should be free for all. No tickets, no restrictions. Some countries or cities have already implemented it. The German government said they couldn’t afford to prolong the policy, but they want to evaluate and look into future approaches to make public transport more accessible. Political parties, transport groups, and NGOs have come up with suggestions such as a yearly 365€ ticket (1€ per day) or a tiered system with 29€/month for regional and 49€/month for national network access.</p>\n\n<p>For me, the idea of whether public transport should be free or not is one for which I found it hard to form a clear opinion. As the discussion is ongoing, I’d like to share my thoughts. First, I find it hard to argue that something is too expensive when the price doesn’t even cover the cost. Long-distance train services are usually profitable, but local transport tickets sometimes cover as little as half the service’s actual cost; the rest is tax subsidies. If we further reduce ticket prices, we will eventually reach a point where the expense of running a ticket system (vending machines, etc.) exceeds the revenue. There is still an advantage to selling tickets, such as the ability to do yield management. For example, monthly passes only valid after 9:00 are often cheaper to dedicate earlier trains and buses to commuters who have to be in them and incentivize other passengers to wait till later in the day. It shouldn’t be the only reason to make people pay, though.</p>\n\n<p>I have a general belief that makes me not too fond of subsidies: if there’s a person or group X that cannot afford a product or service Y, but we believe they should, we shouldn’t ask how to make Y more affordable; we should make sure X has more money (for example, by reducing taxes, increasing social security benefits or eventually through <a href=\"https://lukasrosenstock.net/2021/07/18/universal-basic-income.html\">universal basic income</a>). The problem with lowering prices through subsidies is that we minimize transparency and disguise the actual costs from the public. It also means that the government establishes preferences about the products and services it wants its citizens to purchase. It goes against free markets, so we should use it sparingly and only for good reasons. Of course, improving traffic and its climate impact could be a perfect reason. Finally, if people can’t afford or don’t want to pay even the subsidized price, they still pay for the subsidies with their taxes without getting access to the goods.</p>\n\n<p>Due to the reasons laid out in the previous paragraphs, my reasoning is mainly between two alternatives: one is the current system or an even more expensive one, and the other is entirely free, ticket-less public transport. With the first option, we’d only focus on making buses and trains more attractive to use. I presume people who can get anywhere they want without a car will do so, and it will probably still be cheaper than the total cost of ownership of an individual vehicle. The second option begets the question of who will pay for it and how we can align demand and supply.</p>\n\n<p>I assume we all agree that shifting traffic from cars to buses and trains is a desirable outcome because it reduces emissions and uses less urban space. However, we also know that public transport cannot cover every use case, especially in rural areas with lower population density. We still need cars, ideally small and electric, and we need to include walkability, bike lanes, and micro-mobility (think e-scooters) in the mix. Carsharing, ridesharing, hailed shared taxis, etc., can all help people get around. Which leads to another question: if all these other forms of transport (except walking) cost money, why should buses and trains be free? It would undoubtedly express a strong preference for them over any different mode of transportation. Our primary focus should be cars, though, since they are the most problematic form of transport.</p>\n\n<p>One thing about privately owned cars is that they incur mostly fixed costs: purchase price or leasing rates, taxes, insurance, and checkups. The only cost that entirely depends on kilometers driven is gas or electricity cost. Still, the average car spends over 90% of its life in a parking spot, losing resale value and only 10% on the road. As a result, car owners are incentivized to use their car as the primary option to get around, and it will be mostly the cheapest option as well, as they already paid the fixed costs. If we want to minimize the use of cars, we have to reduce car ownership or move to usage-based models like carsharing, shifting from fixed costs to flexible costs. Those should be ideal for people who don’t need a car daily. The advantage is we also have to produce fewer cars because their utilization is higher. Alternatively, we need to make other forms of transport cheaper than the car you own. When we figure in the barrier of ticket purchase, I’m sure there’s only one price that works: zero.</p>\n\n<p>Alternatives to car ownership, combining micro-mobility, public transport, and carsharing when you need it, already exist for those who want to use them. If we want more people to use them, we must make car ownership and use less attractive or the alternatives more attractive. The problem with the former is that it is politically hard to do. Car lobbyists and conservative politicians will frame it as <em>“the war on cars”</em>. Also, it will hurt people with no alternatives available who can’t afford more expensive vehicle use. Making other options more attractive, like introducing free public transportation, will likely meet less opposition. Therefore, let’s focus on this strategy. While charging for using buses and trains is fair, considering that all other options cost money and there’s no right to free mobility, I think it’s a viable way to lead the transition.</p>\n\n<p>Some concerns remain when it comes to a free, tax-funded system. First, it will be considered unfair by those who cannot use it but still have to pay for it. Second, there’s a lack of incentive to improve the availability and quality of the system. Hence, I want to suggest an alternative approach.</p>\n\n<p>Local public transport will be free, and there are no tickets or other access controls. However, it won’t be taxpayer-funded. Instead, there will be a mandatory fee for households and businesses connected to the network. This type of funding is not without precedence. In Germany, every home pays a media fee, separate from taxes, to fund public TV and radio channels. It is justified because everyone benefits from the existence of these media. In other countries, a TV license is mandatory for TV ownership, independent of the consumption of publicly-funded channels. There are also schemes where homeowners must pay for street maintenance in front of their homes. Why not apply something similar to public transportation? Everyone benefits from a good network, including car owners. A national government could define tiers of services, setting expectations on the quality of service. For example, a tier one household or business would have a bus stop within 300 m, from which buses run every 15 minutes during peak hours and every 30 minutes otherwise. Upon meeting the conditions, households pay a fixed fee for access to the network, and businesses might pay a minor percentage of their revenue. Another way to frame this is that the bus stop is a perk that justifies a higher rent.</p>\n\n<p>The advantage of the system I described is that it doesn’t make households outside the network pay for something they can’t use, decreasing the likelihood of opposition. On the other hand, it incentivizes local governments and transport companies to extend their services to include more households and businesses and earn more money by capturing higher tier fees from more participants. The downside, however, is that some car-heavy suburbs might lobby for exclusion from the network to save money. Those who would otherwise lobby against public transportation, in general, may be the same, so at least the damage is contained within their neighborhood.</p>\n\n<p>I’m not saying my system is perfect, but I think it’s at the very least an interesting thought experiment about funding public services. Let me know what you think! I’m curious to see how the discussion continues.</p>",
                "value": "Just nine euros to travel throughout the country! It was probably the most-liked policy the German government introduced this year, designed to help with rising energy costs. A highly subsidized monthly ticket granted access to the entire public transportation network in Germany, only excluding long-distance trains. You could buy it for June, July, and August, so it is currently the last month where it’s available. In our fight against the climate crisis, changing modes of traffic is a crucial building block. There was hope that it would move some commuter traffic from individual cars to buses and trains, but the effect seems small, probably because it was a temporary measure. However, the ticket supported local tourism and granted the financially poorer members of society the ability to travel.\n\nOne of the ticket’s effects was that it rekindled the discussion about public transportation prices. There has always been this idea it should be free for all. No tickets, no restrictions. Some countries or cities have already implemented it. The German government said they couldn’t afford to prolong the policy, but they want to evaluate and look into future approaches to make public transport more accessible. Political parties, transport groups, and NGOs have come up with suggestions such as a yearly 365€ ticket (1€ per day) or a tiered system with 29€/month for regional and 49€/month for national network access.\n\nFor me, the idea of whether public transport should be free or not is one for which I found it hard to form a clear opinion. As the discussion is ongoing, I’d like to share my thoughts. First, I find it hard to argue that something is too expensive when the price doesn’t even cover the cost. Long-distance train services are usually profitable, but local transport tickets sometimes cover as little as half the service’s actual cost; the rest is tax subsidies. If we further reduce ticket prices, we will eventually reach a point where the expense of running a ticket system (vending machines, etc.) exceeds the revenue. There is still an advantage to selling tickets, such as the ability to do yield management. For example, monthly passes only valid after 9:00 are often cheaper to dedicate earlier trains and buses to commuters who have to be in them and incentivize other passengers to wait till later in the day. It shouldn’t be the only reason to make people pay, though.\n\nI have a general belief that makes me not too fond of subsidies: if there’s a person or group X that cannot afford a product or service Y, but we believe they should, we shouldn’t ask how to make Y more affordable; we should make sure X has more money (for example, by reducing taxes, increasing social security benefits or eventually through universal basic income). The problem with lowering prices through subsidies is that we minimize transparency and disguise the actual costs from the public. It also means that the government establishes preferences about the products and services it wants its citizens to purchase. It goes against free markets, so we should use it sparingly and only for good reasons. Of course, improving traffic and its climate impact could be a perfect reason. Finally, if people can’t afford or don’t want to pay even the subsidized price, they still pay for the subsidies with their taxes without getting access to the goods.\n\nDue to the reasons laid out in the previous paragraphs, my reasoning is mainly between two alternatives: one is the current system or an even more expensive one, and the other is entirely free, ticket-less public transport. With the first option, we’d only focus on making buses and trains more attractive to use. I presume people who can get anywhere they want without a car will do so, and it will probably still be cheaper than the total cost of ownership of an individual vehicle. The second option begets the question of who will pay for it and how we can align demand and supply.\n\nI assume we all agree that shifting traffic from cars to buses and trains is a desirable outcome because it reduces emissions and uses less urban space. However, we also know that public transport cannot cover every use case, especially in rural areas with lower population density. We still need cars, ideally small and electric, and we need to include walkability, bike lanes, and micro-mobility (think e-scooters) in the mix. Carsharing, ridesharing, hailed shared taxis, etc., can all help people get around. Which leads to another question: if all these other forms of transport (except walking) cost money, why should buses and trains be free? It would undoubtedly express a strong preference for them over any different mode of transportation. Our primary focus should be cars, though, since they are the most problematic form of transport.\n\nOne thing about privately owned cars is that they incur mostly fixed costs: purchase price or leasing rates, taxes, insurance, and checkups. The only cost that entirely depends on kilometers driven is gas or electricity cost. Still, the average car spends over 90% of its life in a parking spot, losing resale value and only 10% on the road. As a result, car owners are incentivized to use their car as the primary option to get around, and it will be mostly the cheapest option as well, as they already paid the fixed costs. If we want to minimize the use of cars, we have to reduce car ownership or move to usage-based models like carsharing, shifting from fixed costs to flexible costs. Those should be ideal for people who don’t need a car daily. The advantage is we also have to produce fewer cars because their utilization is higher. Alternatively, we need to make other forms of transport cheaper than the car you own. When we figure in the barrier of ticket purchase, I’m sure there’s only one price that works: zero.\n\nAlternatives to car ownership, combining micro-mobility, public transport, and carsharing when you need it, already exist for those who want to use them. If we want more people to use them, we must make car ownership and use less attractive or the alternatives more attractive. The problem with the former is that it is politically hard to do. Car lobbyists and conservative politicians will frame it as “the war on cars”. Also, it will hurt people with no alternatives available who can’t afford more expensive vehicle use. Making other options more attractive, like introducing free public transportation, will likely meet less opposition. Therefore, let’s focus on this strategy. While charging for using buses and trains is fair, considering that all other options cost money and there’s no right to free mobility, I think it’s a viable way to lead the transition.\n\nSome concerns remain when it comes to a free, tax-funded system. First, it will be considered unfair by those who cannot use it but still have to pay for it. Second, there’s a lack of incentive to improve the availability and quality of the system. Hence, I want to suggest an alternative approach.\n\nLocal public transport will be free, and there are no tickets or other access controls. However, it won’t be taxpayer-funded. Instead, there will be a mandatory fee for households and businesses connected to the network. This type of funding is not without precedence. In Germany, every home pays a media fee, separate from taxes, to fund public TV and radio channels. It is justified because everyone benefits from the existence of these media. In other countries, a TV license is mandatory for TV ownership, independent of the consumption of publicly-funded channels. There are also schemes where homeowners must pay for street maintenance in front of their homes. Why not apply something similar to public transportation? Everyone benefits from a good network, including car owners. A national government could define tiers of services, setting expectations on the quality of service. For example, a tier one household or business would have a bus stop within 300 m, from which buses run every 15 minutes during peak hours and every 30 minutes otherwise. Upon meeting the conditions, households pay a fixed fee for access to the network, and businesses might pay a minor percentage of their revenue. Another way to frame this is that the bus stop is a perk that justifies a higher rent.\n\nThe advantage of the system I described is that it doesn’t make households outside the network pay for something they can’t use, decreasing the likelihood of opposition. On the other hand, it incentivizes local governments and transport companies to extend their services to include more households and businesses and earn more money by capturing higher tier fees from more participants. The downside, however, is that some car-heavy suburbs might lobby for exclusion from the network to save money. Those who would otherwise lobby against public transportation, in general, may be the same, so at least the damage is contained within their neighborhood.\n\nI’m not saying my system is perfect, but I think it’s at the very least an interesting thought experiment about funding public services. Let me know what you think! I’m curious to see how the discussion continues."
              }
            ],
            "url": [
              "https://lukasrosenstock.net/2022/08/18/just-nine-euros.html"
            ],
            "published": [
              "2022-08-18 14:15:08 +0100"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "content": [
              {
                "html": "<p>The <a href=\"https://lukasrosenstock.net/2020/09/27/system-change-not.html\">climate crisis</a> is here, and to prevent the average temperature from rising further, we need to stop increasing the amount of carbon dioxide and other greenhouse gases in the atmosphere. Doing so requires us to transition our energy system. In discussions about this transition in public forums like Twitter, I feel that many people don’t have a deep understanding of the topic. They might say things like “it’s impossible to produce enough electricity” for electric cars while suggesting synthetic fuels as an alternative or insist that we can’t store electricity from renewables and need a complete fossil fuel backup. I don’t claim to be an expert on the topic, but I’ve read quite a bit and will try to reproduce my understanding in a short blog article that aims to clarify some misconceptions. I may also make some mistakes along the way, so if you see any, let me know.</p>\n\n<p>In a nutshell, modern civilization requires energy. We can save some of it through increased efficiency or sufficiency, but we can’t do without it. Our society uses energy in roughly two forms: <em>fuels</em> and <em>electricity</em>. For this purpose, “fuel” shall mean liquids, gases, and solids (e.g., wood and coal) that we burn. Let’s look at the origins of these two forms separately.</p>\n\n<p>The vast amount of fuels is fossils, meaning we burn substances stored in the ground for a very long time. The problem: our current climate relies on their carbon remaining buried instead of released into the atmosphere. There is a consensus that we eventually need to stop burning them. The two alternatives are biofuels and synthetic fuels. Biofuels come from plants that bind CO2 from the atmosphere during growth, making them climate-neutral. We can create some of those from organic waste products, but to produce them at a large scale, we need to grow monocultures of fuel crops which take up a lot of space. Hence, experts generally consider it impossible to replace all fossil fuels with biofuels. For synthetic fuels, we use electrolysis, which requires electrical energy as its input. We’ll get back to those in a bit.</p>\n\n<p>Electricity can come from three sources: we can burn fuels, we can harvest energy from nature (e.g., in the form of sunlight, wind, or streaming water), or we can split atoms. Burning fossil and organic fuels comes with the abovementioned problems, so they are no longer an option. Renewables like solar and wind aren’t reliable because their output depends on the weather. Nuclear power is climate-neutral, but it’s considered risky because of radioactive radiation in its waste products or released by accident. Outside of climate denier circles, there seem to be two groups: those who want to implement a fully renewable system and those who prefer to add nuclear power to the mix. I don’t want to argue in favor or against nuclear in this article, but I want to focus on overcoming the challenges of renewables.</p>\n\n<p>Our electricity demands aren’t constant but follow a curve throughout the day and the year. Electricity production for the public grid must ensure that the production curve matches the consumption curve. If production is higher than consumption, we need to either decrease it or store the excess energy. If production is lower than consumption, we need to either increase it, release energy from storage or reduce consumption (I’ll get to that point later).</p>\n\n<p>We cannot control the production curve for renewables (though we can make some predictions), and we cannot easily handle it for coal and nuclear, which only work efficiently with a steady output. However, natural gas plants can usually ramp up and down production quickly. The combination of renewables and gas works like this: renewables have immediate access to the grid. If their output isn’t enough, we switch on gas-burning plants (called “peakers”) to produce the remaining electricity demand. Our electrical system already does this. And ideally, the more renewables we add to the grid, the less fossil gas we need to burn because there will be smaller peaks to fill. Our current electrical grids already do this, which is why gas considers itself a “transition technology,” and the EU taxonomy for sustainability includes it.</p>\n\n<p>Now, wait, you may now say that the argument that renewables need a fossil backup is indeed correct. However, you don’t need a full backup, and that’s for two reasons. First, renewable availability fluctuates, but not too much, especially if you combine a lot of solar and wind on a large, geographically distributed grid and include running-water and geothermal plants. The latter two provide constant output, and there’s always wind somewhere, especially offshore. So you don’t need to plan for zero. Second, this works with the assumption that we have no storage, which isn’t true. Even today, we have an extensive pump storage system. Admittedly, there is limited space to expand it, but other storage technologies exist, including, but not limited to, electrolysis and fuel production.</p>\n\n<p>You may think we need to build more storage right now, but I’d argue it’s not yet the right time. We must first focus on building additional renewables and expanding the grid to bring them across vast distances from sunny and windy regions to consumers. Storing electricity is expensive and generally incurs losses, meaning you don’t get back the same amount of energy. It is always better to use it immediately, in other words, to control consumption. I understand this can invoke dystopian thoughts of power rationing and blackouts for crucial systems like medical infrastructure. Do we need to drop the idea that we can plug appliances into a power socket whenever we want?!</p>\n\n<p>Control of consumption can comprise pricing strategies that make electricity cheaper when more renewables are available and expensive when there are fewer, ideally shifting loads. It’s called yield management, and it’s pretty standard in a market economy. For industrial use, it can make economic sense to implement the ability to stop production lines in exchange for cheaper electricity prices occasionally. Cars spend a lot of their time parked. They can charge whenever it is most affordable if you keep them plugged in. There are other examples, and a smart grid can manage them without inconveniencing consumers. Cars and commercial applications could probably cover it, so private households have no change (unless they want to leverage it as a discount). However, let’s get back to storage once more.</p>\n\n<p>Due to the losses I’ve mentioned, storage doesn’t make much sense as long as there are fossil peaker plants on the grid. Please read that again because it’s essential. Burning fuel to produce electricity for storage requires more than if you just kept it and burned it later when needed. It’s neither economically nor ecologically sound. It also means that if you build an electrolyzer to produce green hydrogen and synthetic fuel, you should only turn it on when there’s an excess of renewable (or nuclear) energy and switch off all fossil fuel plants first. With the currently deployed renewables, this situation does occur, but it happens so rarely that it wouldn’t be viable to build electrolyzers and other storage systems for those occasions. At worst, we disconnect the electricity surplus and let it go to waste. We likely move through a phase where we have enough excess that it seems we’re wasting it but not yet enough to make it economically viable to deploy more storage. It’s the nature of transition, though, and not a flaw in the system. At some point, storage becomes more viable than fuel-burning plants, and we can dismantle the latter.</p>\n\n<p>After talking so much about electricity, what about the situations where we use fuels directly? One option is synthetic fuels, but they are a form of electricity storage that incurs losses, so it seems evident that using electricity directly is the better option whenever possible. That’s why we should replace gas heaters with electric heat pumps and petrol and diesel cars with electric cars. Often this seems counterintuitive because if, on the one hand, we want to increase efficiency and save electricity whenever possible, why should we add more consumers to the electric grid?</p>\n\n<p>The answer is straightforward, though. Yes, we add electric consumers, but at the same time, we reduce fuel-based energy consumption. Once we’ve accepted that fossil fuels are no longer an option and we don’t have enough biofuels to replace them, we can only choose between using electricity directly or producing fuels from electricity. In this battle, electricity wins practically all the time. Even when disconnected from the grid, such as in vehicles, batteries seem to be more efficient storage than fuels. There are exceptions where the higher energy density and lower fuel weight probably win over batteries, such as in jet fuel for airplanes. For cars and likely for trucks, the decision for batteries is clear.</p>\n\n<p>In summary, to decarbonize our energy system, we need to electrify whatever we can and build a well-connected smart grid. We first must deploy as many renewables as possible on the grid to get regular excess energy. At that point, we need additional storage methods to capture the surplus and feed it back during low production. They gradually replace fossil gas peakers (if the form of storage is hydrogen or another gas, we can repurpose the same plants). The better we keep consumption aligned with production (e.g., through dynamic pricing), the less storage we need. If we decide to keep nuclear power alongside renewables, it can also provide some baseload. It doesn’t mean it solves the challenges in building the renewable-centered system because nuclear is not a peaker technology.</p>\n\n<p>This post outlines my understanding of the coming energy transition. As I said in the beginning, I’m not an expert, just a curious mind. I hope it was helpful. If you find any flaws in my reasoning, please point them out.</p>",
                "value": "The climate crisis is here, and to prevent the average temperature from rising further, we need to stop increasing the amount of carbon dioxide and other greenhouse gases in the atmosphere. Doing so requires us to transition our energy system. In discussions about this transition in public forums like Twitter, I feel that many people don’t have a deep understanding of the topic. They might say things like “it’s impossible to produce enough electricity” for electric cars while suggesting synthetic fuels as an alternative or insist that we can’t store electricity from renewables and need a complete fossil fuel backup. I don’t claim to be an expert on the topic, but I’ve read quite a bit and will try to reproduce my understanding in a short blog article that aims to clarify some misconceptions. I may also make some mistakes along the way, so if you see any, let me know.\n\nIn a nutshell, modern civilization requires energy. We can save some of it through increased efficiency or sufficiency, but we can’t do without it. Our society uses energy in roughly two forms: fuels and electricity. For this purpose, “fuel” shall mean liquids, gases, and solids (e.g., wood and coal) that we burn. Let’s look at the origins of these two forms separately.\n\nThe vast amount of fuels is fossils, meaning we burn substances stored in the ground for a very long time. The problem: our current climate relies on their carbon remaining buried instead of released into the atmosphere. There is a consensus that we eventually need to stop burning them. The two alternatives are biofuels and synthetic fuels. Biofuels come from plants that bind CO2 from the atmosphere during growth, making them climate-neutral. We can create some of those from organic waste products, but to produce them at a large scale, we need to grow monocultures of fuel crops which take up a lot of space. Hence, experts generally consider it impossible to replace all fossil fuels with biofuels. For synthetic fuels, we use electrolysis, which requires electrical energy as its input. We’ll get back to those in a bit.\n\nElectricity can come from three sources: we can burn fuels, we can harvest energy from nature (e.g., in the form of sunlight, wind, or streaming water), or we can split atoms. Burning fossil and organic fuels comes with the abovementioned problems, so they are no longer an option. Renewables like solar and wind aren’t reliable because their output depends on the weather. Nuclear power is climate-neutral, but it’s considered risky because of radioactive radiation in its waste products or released by accident. Outside of climate denier circles, there seem to be two groups: those who want to implement a fully renewable system and those who prefer to add nuclear power to the mix. I don’t want to argue in favor or against nuclear in this article, but I want to focus on overcoming the challenges of renewables.\n\nOur electricity demands aren’t constant but follow a curve throughout the day and the year. Electricity production for the public grid must ensure that the production curve matches the consumption curve. If production is higher than consumption, we need to either decrease it or store the excess energy. If production is lower than consumption, we need to either increase it, release energy from storage or reduce consumption (I’ll get to that point later).\n\nWe cannot control the production curve for renewables (though we can make some predictions), and we cannot easily handle it for coal and nuclear, which only work efficiently with a steady output. However, natural gas plants can usually ramp up and down production quickly. The combination of renewables and gas works like this: renewables have immediate access to the grid. If their output isn’t enough, we switch on gas-burning plants (called “peakers”) to produce the remaining electricity demand. Our electrical system already does this. And ideally, the more renewables we add to the grid, the less fossil gas we need to burn because there will be smaller peaks to fill. Our current electrical grids already do this, which is why gas considers itself a “transition technology,” and the EU taxonomy for sustainability includes it.\n\nNow, wait, you may now say that the argument that renewables need a fossil backup is indeed correct. However, you don’t need a full backup, and that’s for two reasons. First, renewable availability fluctuates, but not too much, especially if you combine a lot of solar and wind on a large, geographically distributed grid and include running-water and geothermal plants. The latter two provide constant output, and there’s always wind somewhere, especially offshore. So you don’t need to plan for zero. Second, this works with the assumption that we have no storage, which isn’t true. Even today, we have an extensive pump storage system. Admittedly, there is limited space to expand it, but other storage technologies exist, including, but not limited to, electrolysis and fuel production.\n\nYou may think we need to build more storage right now, but I’d argue it’s not yet the right time. We must first focus on building additional renewables and expanding the grid to bring them across vast distances from sunny and windy regions to consumers. Storing electricity is expensive and generally incurs losses, meaning you don’t get back the same amount of energy. It is always better to use it immediately, in other words, to control consumption. I understand this can invoke dystopian thoughts of power rationing and blackouts for crucial systems like medical infrastructure. Do we need to drop the idea that we can plug appliances into a power socket whenever we want?!\n\nControl of consumption can comprise pricing strategies that make electricity cheaper when more renewables are available and expensive when there are fewer, ideally shifting loads. It’s called yield management, and it’s pretty standard in a market economy. For industrial use, it can make economic sense to implement the ability to stop production lines in exchange for cheaper electricity prices occasionally. Cars spend a lot of their time parked. They can charge whenever it is most affordable if you keep them plugged in. There are other examples, and a smart grid can manage them without inconveniencing consumers. Cars and commercial applications could probably cover it, so private households have no change (unless they want to leverage it as a discount). However, let’s get back to storage once more.\n\nDue to the losses I’ve mentioned, storage doesn’t make much sense as long as there are fossil peaker plants on the grid. Please read that again because it’s essential. Burning fuel to produce electricity for storage requires more than if you just kept it and burned it later when needed. It’s neither economically nor ecologically sound. It also means that if you build an electrolyzer to produce green hydrogen and synthetic fuel, you should only turn it on when there’s an excess of renewable (or nuclear) energy and switch off all fossil fuel plants first. With the currently deployed renewables, this situation does occur, but it happens so rarely that it wouldn’t be viable to build electrolyzers and other storage systems for those occasions. At worst, we disconnect the electricity surplus and let it go to waste. We likely move through a phase where we have enough excess that it seems we’re wasting it but not yet enough to make it economically viable to deploy more storage. It’s the nature of transition, though, and not a flaw in the system. At some point, storage becomes more viable than fuel-burning plants, and we can dismantle the latter.\n\nAfter talking so much about electricity, what about the situations where we use fuels directly? One option is synthetic fuels, but they are a form of electricity storage that incurs losses, so it seems evident that using electricity directly is the better option whenever possible. That’s why we should replace gas heaters with electric heat pumps and petrol and diesel cars with electric cars. Often this seems counterintuitive because if, on the one hand, we want to increase efficiency and save electricity whenever possible, why should we add more consumers to the electric grid?\n\nThe answer is straightforward, though. Yes, we add electric consumers, but at the same time, we reduce fuel-based energy consumption. Once we’ve accepted that fossil fuels are no longer an option and we don’t have enough biofuels to replace them, we can only choose between using electricity directly or producing fuels from electricity. In this battle, electricity wins practically all the time. Even when disconnected from the grid, such as in vehicles, batteries seem to be more efficient storage than fuels. There are exceptions where the higher energy density and lower fuel weight probably win over batteries, such as in jet fuel for airplanes. For cars and likely for trucks, the decision for batteries is clear.\n\nIn summary, to decarbonize our energy system, we need to electrify whatever we can and build a well-connected smart grid. We first must deploy as many renewables as possible on the grid to get regular excess energy. At that point, we need additional storage methods to capture the surplus and feed it back during low production. They gradually replace fossil gas peakers (if the form of storage is hydrogen or another gas, we can repurpose the same plants). The better we keep consumption aligned with production (e.g., through dynamic pricing), the less storage we need. If we decide to keep nuclear power alongside renewables, it can also provide some baseload. It doesn’t mean it solves the challenges in building the renewable-centered system because nuclear is not a peaker technology.\n\nThis post outlines my understanding of the coming energy transition. As I said in the beginning, I’m not an expert, just a curious mind. I hope it was helpful. If you find any flaws in my reasoning, please point them out."
              }
            ],
            "url": [
              "https://lukasrosenstock.net/2022/08/09/the-climate-crisis.html"
            ],
            "published": [
              "2022-08-09 10:30:45 +0100"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "content": [
              {
                "html": "<p>I’m on a train to Berlin right now. Today I will make a stop on the way in Göttingen to visit a friend for her birthday. Then I’ll stay in Berlin for one night, before moving on to a small rural village approximately one hour away from Berlin. In that village, which is called Bad Belzig, there’s the <a href=\"https://coconat-space.com/\">Coconat Workation Retreat</a>. The name “Coconat” stands for “coliving and concentrated work in nature”. Due to my interest in remote work and “workations” I’ve known and followed this place for a long while, but this is the first time I’m actually going there, and I’m excited how it will be like. The photos on <a href=\"https://coconat-space.com/\">their website</a> and <a href=\"https://instagram.com/coconat.workation.retreat/\">their Instagram account</a> make it seem like beautiful spot with a very friendly community. I’ll certainly give you an update. Probably I’ll also do another day trip to Berlin from Bad Belzig mid-week. After one week of working from a different location I’ll go and see a friend who lives in another rural village outside Berlin next weekend, before coming back to my hometown. So, my time in Berlin is quite limited during this trip, but if you want to meet while I’m there I might be able to squeeze it in. Feel free to reach out.</p>",
                "value": "I’m on a train to Berlin right now. Today I will make a stop on the way in Göttingen to visit a friend for her birthday. Then I’ll stay in Berlin for one night, before moving on to a small rural village approximately one hour away from Berlin. In that village, which is called Bad Belzig, there’s the Coconat Workation Retreat. The name “Coconat” stands for “coliving and concentrated work in nature”. Due to my interest in remote work and “workations” I’ve known and followed this place for a long while, but this is the first time I’m actually going there, and I’m excited how it will be like. The photos on their website and their Instagram account make it seem like beautiful spot with a very friendly community. I’ll certainly give you an update. Probably I’ll also do another day trip to Berlin from Bad Belzig mid-week. After one week of working from a different location I’ll go and see a friend who lives in another rural village outside Berlin next weekend, before coming back to my hometown. So, my time in Berlin is quite limited during this trip, but if you want to meet while I’m there I might be able to squeeze it in. Feel free to reach out."
              }
            ],
            "url": [
              "https://lukasrosenstock.net/2022/07/16/im-on-a.html"
            ],
            "published": [
              "2022-07-16 09:31:04 +0100"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "content": [
              {
                "html": "<p>Once in a while, you see a tweet that triggers all kinds of thoughts and deserves more than a like, retweet, or 280 characters reply. <a href=\"https://www.annagat.com/\">Anna Gát</a>, the founder of <a href=\"https://interintellect.com/\">Interintellect</a>, wrote <a href=\"https://twitter.com/TheAnnaGat/status/1534507299682787329\">such a tweet</a> for me lately. Here’s a quote: <em>“I organise most of the things that exist in my life. Social, professional, intellectual events and impulses all come to me at my own effort. I’d love to be invited to other people’s parties, initiatives, idea-sharing as a guest sometimes.”</em> Although I’m nowhere near Anna, who literally runs a community that is about organizing and hosting events for others, I felt this is relatable. Let me try and articulate my thoughts.</p>\n\n<p>First, it’s a general rule of any community that most of its members are lurkers. Only a subset of the community actively participates in activities. And an even smaller group initiates anything in the first place. In fact, everything in the world exists because people are willing to take the initiative. We owe these people a lot, and it would be great to see more of them, but we can’t expect everyone to take on these roles. It takes effort and persistence, there’s always a risk involved that your thing fails, and you will face rejection and must not take it personally. On the flip side, you can be the one that makes the thing happen that you wish to exist.</p>\n\n<p>Second, I feel I often enjoy initiating things more than participating in things others organize. It’s for two, probably related, reasons: One is that I like to be in control of what’s happening, and being in the lead lets you do that better. The other is that I sometimes find it hard to navigate social situations regarding roles and hierarchies and find my position in them. Being a leader or initiator gives you a predefined part, which helps. So … it’s all great, right?!</p>\n\n<p>Although I’ve said that organizing things can be better than just participating, sometimes it’s nice to invest less effort into it. Also,  sometimes not knowing what is happening is precisely the point. However, the sentiment of the original tweet that I can relate to isn’t about just that. It’s about being invited in the first place. Or, instead, not being invited.</p>\n\n<p>When people attend events or activities you organized, you may start wondering why they showed up. Are they interested in the thing itself? Are they showing up because of you? Or are they just happy that something is happening that they can attend? It would be awkward to ask. I’d assume many people wouldn’t be fully aware of their combination of reasons anyway. But why does it matter?\nSomeone showing up but not inviting you in return feels like rejection, just a different kind. Yes, the other person may be one who never initiates, but what if they do but not invite you? You start realizing you’re having a one-way relationship with that person, where you care about including them, but they simply don’t care about you at all, or, worse, they don’t like you. If they followed your invitation, they didn’t do so because of you, but despite you. Ouch!</p>\n\n<p>The above paragraph may sound full of ego, but it’s the truth that humans, or at least most of them, are social creatures and want to be liked. Or even before they are liked, at least their existence and relevance wants acknowledgment. We want others to care about us. Some of it may seem superficial, like worrying about “likes” or follower-to-following ratio on social media. Still, these are just modern expressions of deeply human desires.</p>\n\n<p>(A consolation for people who are already well-networked and lead a visible social life: others think you are already fully booked and wouldn’t accept an invitation anyway. So, they don’t receive invitations due to anticipation of rejection. If you are one of those others: don’t be afraid! Yes, these somewhat famous people receive many requests and invites and may likely turn you down, but there’s still nothing wrong with asking.)</p>\n\n<p>In the past years I’ve increasingly spent time trying to build connections and participate in communities, both personally and for business (and at the intersection of both). I believe in the importance of a network of strong and weak ties to get ahead in life and work. I’ve invested some time in reaching out, following up, and building <a href=\"https://lukasrosenstock.net/2021/04/11/making-friends-and.html\">a personal CRM</a>. Sometimes I wonder why I did this and whether these efforts pay off. Then, at some point, it hit me that one of the big reasons why I’m doing this is so I can receive the same in return. Again, this may sound shallow and self-centered, but I want to be honest. Every outbound connection is made in anticipation of an inbound connection. Every introduction creates the desire to be introduced to someone in return.</p>\n\n<p>(To avoid misunderstanding, I have wishful goals for myself, and there’s nothing wrong with you having similar purposes. Still, I don’t think you should communicate these as expectations or attempt to run your social life in a tit-for-tat mode. For multiple reasons, including my first thought in this article, there will never be a perfect balance. Some people are natural givers, making others natural takers. And there can be a lot of joy in giving even if you get no return.)</p>\n\n<p>A north star goal could be a life in “inbound mode”, where you stopped doing the work of reaching out and still have a pool of people who reach out to you instead. And I feel the tweet captures the sentiment for me. Yes, being invited to things is about experiencing new things and meeting new people that aren’t part of what you’re doing so far. However, it’s also about the safety of knowing that you still had an active social life even if you ceased any investments in it. The confidence of having people caring about you.</p>\n\n<p>I am unsure if it’s possible or even desirable to live in “inbound mode”, because you will also receive a lot of unwanted attention and people aren’t taking rejections nicely. But it would be nice to get even part of the way there. Until then, let’s continue making the things happen that we want to happen and reach out to the people we want to include.</p>",
                "value": "Once in a while, you see a tweet that triggers all kinds of thoughts and deserves more than a like, retweet, or 280 characters reply. Anna Gát, the founder of Interintellect, wrote such a tweet for me lately. Here’s a quote: “I organise most of the things that exist in my life. Social, professional, intellectual events and impulses all come to me at my own effort. I’d love to be invited to other people’s parties, initiatives, idea-sharing as a guest sometimes.” Although I’m nowhere near Anna, who literally runs a community that is about organizing and hosting events for others, I felt this is relatable. Let me try and articulate my thoughts.\n\nFirst, it’s a general rule of any community that most of its members are lurkers. Only a subset of the community actively participates in activities. And an even smaller group initiates anything in the first place. In fact, everything in the world exists because people are willing to take the initiative. We owe these people a lot, and it would be great to see more of them, but we can’t expect everyone to take on these roles. It takes effort and persistence, there’s always a risk involved that your thing fails, and you will face rejection and must not take it personally. On the flip side, you can be the one that makes the thing happen that you wish to exist.\n\nSecond, I feel I often enjoy initiating things more than participating in things others organize. It’s for two, probably related, reasons: One is that I like to be in control of what’s happening, and being in the lead lets you do that better. The other is that I sometimes find it hard to navigate social situations regarding roles and hierarchies and find my position in them. Being a leader or initiator gives you a predefined part, which helps. So … it’s all great, right?!\n\nAlthough I’ve said that organizing things can be better than just participating, sometimes it’s nice to invest less effort into it. Also,  sometimes not knowing what is happening is precisely the point. However, the sentiment of the original tweet that I can relate to isn’t about just that. It’s about being invited in the first place. Or, instead, not being invited.\n\nWhen people attend events or activities you organized, you may start wondering why they showed up. Are they interested in the thing itself? Are they showing up because of you? Or are they just happy that something is happening that they can attend? It would be awkward to ask. I’d assume many people wouldn’t be fully aware of their combination of reasons anyway. But why does it matter?\nSomeone showing up but not inviting you in return feels like rejection, just a different kind. Yes, the other person may be one who never initiates, but what if they do but not invite you? You start realizing you’re having a one-way relationship with that person, where you care about including them, but they simply don’t care about you at all, or, worse, they don’t like you. If they followed your invitation, they didn’t do so because of you, but despite you. Ouch!\n\nThe above paragraph may sound full of ego, but it’s the truth that humans, or at least most of them, are social creatures and want to be liked. Or even before they are liked, at least their existence and relevance wants acknowledgment. We want others to care about us. Some of it may seem superficial, like worrying about “likes” or follower-to-following ratio on social media. Still, these are just modern expressions of deeply human desires.\n\n(A consolation for people who are already well-networked and lead a visible social life: others think you are already fully booked and wouldn’t accept an invitation anyway. So, they don’t receive invitations due to anticipation of rejection. If you are one of those others: don’t be afraid! Yes, these somewhat famous people receive many requests and invites and may likely turn you down, but there’s still nothing wrong with asking.)\n\nIn the past years I’ve increasingly spent time trying to build connections and participate in communities, both personally and for business (and at the intersection of both). I believe in the importance of a network of strong and weak ties to get ahead in life and work. I’ve invested some time in reaching out, following up, and building a personal CRM. Sometimes I wonder why I did this and whether these efforts pay off. Then, at some point, it hit me that one of the big reasons why I’m doing this is so I can receive the same in return. Again, this may sound shallow and self-centered, but I want to be honest. Every outbound connection is made in anticipation of an inbound connection. Every introduction creates the desire to be introduced to someone in return.\n\n(To avoid misunderstanding, I have wishful goals for myself, and there’s nothing wrong with you having similar purposes. Still, I don’t think you should communicate these as expectations or attempt to run your social life in a tit-for-tat mode. For multiple reasons, including my first thought in this article, there will never be a perfect balance. Some people are natural givers, making others natural takers. And there can be a lot of joy in giving even if you get no return.)\n\nA north star goal could be a life in “inbound mode”, where you stopped doing the work of reaching out and still have a pool of people who reach out to you instead. And I feel the tweet captures the sentiment for me. Yes, being invited to things is about experiencing new things and meeting new people that aren’t part of what you’re doing so far. However, it’s also about the safety of knowing that you still had an active social life even if you ceased any investments in it. The confidence of having people caring about you.\n\nI am unsure if it’s possible or even desirable to live in “inbound mode”, because you will also receive a lot of unwanted attention and people aren’t taking rejections nicely. But it would be nice to get even part of the way there. Until then, let’s continue making the things happen that we want to happen and reach out to the people we want to include."
              }
            ],
            "url": [
              "https://lukasrosenstock.net/2022/06/10/once-in-a.html"
            ],
            "published": [
              "2022-06-10 14:42:33 +0100"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "content": [
              {
                "html": "<p>Scott Stevenson’s article <a href=\"https://medium.com/@scott.stevenson/how-to-finally-make-something-a16c8db7ba2a\">“How To Finally Make Something”</a> came up in a Twitter conversation that started with <a href=\"https://twitter.com/sashachapin/status/1507133559219187723\">a tweet on problems with most productivity stuff by Sasha Chapin</a>. In the article, <a href=\"(https://twitter.com/scottastevenson)\">Scott</a> claims that people struggle in their creative process and their most important work because they engage in so-called fantasy games. These games seem to help us progress towards goals, but they can often be a distraction and become a method of <a href=\"https://lukasrosenstock.net/2021/10/17/procrastination-is-one.html\">procrastination</a>. Scott identifies learning syndrome, tool syndrome, process syndrome, and maintenance syndrome. In a nutshell, people spend time learning (e.g., reading books, taking courses), improving their setup and toolchain, figuring out the best productivity system, and getting bogged down in small maintenance tasks (that they could probably delegate, automate, or remove). If you want to read more about them, <a href=\"https://medium.com/@scott.stevenson/how-to-finally-make-something-a16c8db7ba2a\">check out Scott’s article</a>.</p>\n\n<p>I want to extend his thoughts around these fantasy games, focusing on why we engage in them. A common explanation is that they are easy, and doing the real work is hard. When the real work is creative, we’re putting ourselves out there, making us vulnerable. Our work can be a hit or fail, and unpredictability can be hard to swallow. If we’re unsure about the goals, there may be negative emotions associated with it (which <a href=\"https://twitter.com/sashachapin/status/1507133559219187723\">was Sashas point in the original tweet</a>). These are all great points, and I have observed them within myself. Around a year ago, I wrote about “exploration and exploitation”. I <a href=\"https://lukasrosenstock.net/2021/01/09/exploration-and-exploitation.html\">connected exploration to procrastination, communities, and the self-help industry</a> (in a follow-up post, I talked about <a href=\"https://lukasrosenstock.net/2021/01/10/yesterdays-post-on.html\">exploration and FOMO as a trap</a>). Reading Scott’s article somehow gave me an epiphany and a new perspective on them.</p>\n\n<p>Let’s talk about the industry first. People understand the value of education and good tooling, so it’s evident that we sell them. Authors, toolmakers, and course creators typically make profits selling their products and not through the outcomes of their buyers and students. Yes, they need success stories or testimonials, but buyers who don’t follow up on their intentions have still brought them money. And those addicted to buying tools and learning material drive down prices for everyone. There’s no criticism of anyone involved here, but we need to understand that there are economic incentives that drive these fantasy games as well. Even if you’re not in the business of selling information, if you want a visible personal brand and be known for something, the best way is to curate information. Your work doesn’t provide enough content to get started (and likely under NDA anyway).</p>\n\n<p>Now let’s talk about community. Of course, commercial communities around exploration are a part of the industry. But even if we remove the profit incentive, humans are (generally speaking) social creatures who like to be part of a network of like-minded peers. Now, there’s the catch. Social connection relies on conversations, but what should the subject of these conversations be? Work is a prominent topic with people in a similar field, and you joined a professional community for that purpose.</p>\n\n<p>Talking about your work to show what you’ve done and asking for feedback can be challenging and makes you vulnerable. It can also appear selfish if everybody talks about that. And now we’re back to the fantasy games. Tools and processes can provide unlimited fuel for conversation and create bonds and sub-identities, all without the discomfort that comes with revealing too much of what you do. A tech industry veteran and a recent boot camp graduate can fight or bond over whether <em>vi</em> or <em>emacs</em> is the better text editor or whether you should indent code with tabs or spaces. If you’re not in tech, I think you can find plenty of examples in your industry or creative field. As I already said earlier, your work doesn’t provide enough talking points, and you don’t want to appear full of yourself, so it’s essential to consume a lot of stuff not just for its own sake but also so you have things to talk about that others may know as well.</p>\n\n<p>Now here’s the flip side of the coin. If you want to build community and bond with peers in your field, it can be instrumental to geek out over tools and processes. The minimal investment you need to make in these areas to do your work may not be sufficient for contributing to a community that rewards knowledgeable members and opinionated takes. Of course, you don’t need to be a top community contributor. You can be happy and productive toiling for yourself and not care about status games and peer recognition, but I believe it makes it harder to socialize. It’s a trade-off.</p>\n\n<p>This realization (which makes sense, I hope) is vital for me. I think I am not very prone to these fantasy games. Sometimes I feel that I should learn more stuff, but I quickly understand that it won’t help me with my goals because I need to put what I already know into action. I also realize that the tools aren’t what is holding me back. If anything is stopping me, it’s <a href=\"https://lukasrosenstock.net/2021/01/03/perfectionism-is-a.html\">perfectionism</a> or lack of resources (due to trying <a href=\"https://lukasrosenstock.net/2020/08/30/in-my-last.html\">to do too much</a>). I feel I’m now on the other extreme, and sometimes investing a little more into processes and maintenance could be beneficial, but that’s a topic for another day.</p>\n\n<p>For now, I’m getting at the following: I feel I’m not good at socializing and connecting with peers because I’m focused too much on myself and my work and don’t pay enough attention to the talk of the town. Yes, this talk might be just gossip that’s distracting me, but I still feel I want to join the conversation. However, doing so would demand making myself more dependent and connected to what others do and think, something I generally avoid and that would feel inauthentic to me.</p>\n\n<p>I wish I could offer a conclusion to this blog post, but I don’t have any yet. It’s just a point that has gotten clearer to me, and I’d love to hear your thoughts.</p>",
                "value": "Scott Stevenson’s article “How To Finally Make Something” came up in a Twitter conversation that started with a tweet on problems with most productivity stuff by Sasha Chapin. In the article, Scott claims that people struggle in their creative process and their most important work because they engage in so-called fantasy games. These games seem to help us progress towards goals, but they can often be a distraction and become a method of procrastination. Scott identifies learning syndrome, tool syndrome, process syndrome, and maintenance syndrome. In a nutshell, people spend time learning (e.g., reading books, taking courses), improving their setup and toolchain, figuring out the best productivity system, and getting bogged down in small maintenance tasks (that they could probably delegate, automate, or remove). If you want to read more about them, check out Scott’s article.\n\nI want to extend his thoughts around these fantasy games, focusing on why we engage in them. A common explanation is that they are easy, and doing the real work is hard. When the real work is creative, we’re putting ourselves out there, making us vulnerable. Our work can be a hit or fail, and unpredictability can be hard to swallow. If we’re unsure about the goals, there may be negative emotions associated with it (which was Sashas point in the original tweet). These are all great points, and I have observed them within myself. Around a year ago, I wrote about “exploration and exploitation”. I connected exploration to procrastination, communities, and the self-help industry (in a follow-up post, I talked about exploration and FOMO as a trap). Reading Scott’s article somehow gave me an epiphany and a new perspective on them.\n\nLet’s talk about the industry first. People understand the value of education and good tooling, so it’s evident that we sell them. Authors, toolmakers, and course creators typically make profits selling their products and not through the outcomes of their buyers and students. Yes, they need success stories or testimonials, but buyers who don’t follow up on their intentions have still brought them money. And those addicted to buying tools and learning material drive down prices for everyone. There’s no criticism of anyone involved here, but we need to understand that there are economic incentives that drive these fantasy games as well. Even if you’re not in the business of selling information, if you want a visible personal brand and be known for something, the best way is to curate information. Your work doesn’t provide enough content to get started (and likely under NDA anyway).\n\nNow let’s talk about community. Of course, commercial communities around exploration are a part of the industry. But even if we remove the profit incentive, humans are (generally speaking) social creatures who like to be part of a network of like-minded peers. Now, there’s the catch. Social connection relies on conversations, but what should the subject of these conversations be? Work is a prominent topic with people in a similar field, and you joined a professional community for that purpose.\n\nTalking about your work to show what you’ve done and asking for feedback can be challenging and makes you vulnerable. It can also appear selfish if everybody talks about that. And now we’re back to the fantasy games. Tools and processes can provide unlimited fuel for conversation and create bonds and sub-identities, all without the discomfort that comes with revealing too much of what you do. A tech industry veteran and a recent boot camp graduate can fight or bond over whether vi or emacs is the better text editor or whether you should indent code with tabs or spaces. If you’re not in tech, I think you can find plenty of examples in your industry or creative field. As I already said earlier, your work doesn’t provide enough talking points, and you don’t want to appear full of yourself, so it’s essential to consume a lot of stuff not just for its own sake but also so you have things to talk about that others may know as well.\n\nNow here’s the flip side of the coin. If you want to build community and bond with peers in your field, it can be instrumental to geek out over tools and processes. The minimal investment you need to make in these areas to do your work may not be sufficient for contributing to a community that rewards knowledgeable members and opinionated takes. Of course, you don’t need to be a top community contributor. You can be happy and productive toiling for yourself and not care about status games and peer recognition, but I believe it makes it harder to socialize. It’s a trade-off.\n\nThis realization (which makes sense, I hope) is vital for me. I think I am not very prone to these fantasy games. Sometimes I feel that I should learn more stuff, but I quickly understand that it won’t help me with my goals because I need to put what I already know into action. I also realize that the tools aren’t what is holding me back. If anything is stopping me, it’s perfectionism or lack of resources (due to trying to do too much). I feel I’m now on the other extreme, and sometimes investing a little more into processes and maintenance could be beneficial, but that’s a topic for another day.\n\nFor now, I’m getting at the following: I feel I’m not good at socializing and connecting with peers because I’m focused too much on myself and my work and don’t pay enough attention to the talk of the town. Yes, this talk might be just gossip that’s distracting me, but I still feel I want to join the conversation. However, doing so would demand making myself more dependent and connected to what others do and think, something I generally avoid and that would feel inauthentic to me.\n\nI wish I could offer a conclusion to this blog post, but I don’t have any yet. It’s just a point that has gotten clearer to me, and I’d love to hear your thoughts."
              }
            ],
            "url": [
              "https://lukasrosenstock.net/2022/03/27/scott-stevensons-article.html"
            ],
            "published": [
              "2022-03-27 18:07:34 +0100"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "content": [
              {
                "html": "<p>Unit testing is mainly used to test smaller parts of your code, like a single class or function. But you can repurpose unit testing frameworks into API testing frameworks with libraries that combine an HTTP client with assertion functions that cover things you typically expect from an API response, such as status codes and headers. <a href=\"https://github.com/Blazemeter/apiritif\">Apiritif</a> is one such library for the Python language. My latest guest post for BlazeMeter is <a href=\"https://www.blazemeter.com/blog/writing-api-tests-python-apiritif\">a quick tutorial that shows you how to build an API test with Python, nose, and Apiritif</a>. Check it out <a href=\"https://www.blazemeter.com/blog/writing-api-tests-python-apiritif\">on the BlazeMeter blog</a>. You can also find <a href=\"https://www.thiscodeworks.com/minimal-test-example-for-apiritif-api-testing-python-apiritif/61e189d8ddff800015669cbd\">a small code snippet on thiscodeWorks</a>.</p>\n\n<p><em>Disclosure: This work was paid for by BlazeMeter.</em></p>",
                "value": "Unit testing is mainly used to test smaller parts of your code, like a single class or function. But you can repurpose unit testing frameworks into API testing frameworks with libraries that combine an HTTP client with assertion functions that cover things you typically expect from an API response, such as status codes and headers. Apiritif is one such library for the Python language. My latest guest post for BlazeMeter is a quick tutorial that shows you how to build an API test with Python, nose, and Apiritif. Check it out on the BlazeMeter blog. You can also find a small code snippet on thiscodeWorks.\n\nDisclosure: This work was paid for by BlazeMeter."
              }
            ],
            "url": [
              "https://lukasrosenstock.net/2022/01/25/unit-testing-is.html"
            ],
            "published": [
              "2022-01-25 18:12:46 +0100"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "content": [
              {
                "html": "<p><a href=\"https://moxie.org/\">Moxie Marlinspike</a>, the founder of the Signal messaging app, wrote a widely shared piece called <a href=\"https://moxie.org/2022/01/07/web3-first-impressions.html\">“My first impressions of web3”</a>. The article explains how many things around blockchain, cryptocurrencies, and NFTs aren’t as decentralized as people think. Running blockchain nodes requires computation power, so crypto wallets and “dApps” need an intermediary that provides a traditional client-server API between them and the blockchain. According to Moxies observations, the ecosystem is highly centralized around just a few of these intermediaries. They have the power to moderate and censor the ecosystem, such as blocking access to NFTs that still exist somewhere on the blockchain.</p>\n\n<p>He starts the blog post with two statements. The first is that people don’t want to run servers, and the second is that platforms move faster than protocols.</p>\n\n<p>I want to address the second statement first. It reiterates <a href=\"https://signal.org/blog/the-ecosystem-is-moving/\">a previous post in which Moxie justifies that Signal is centralized</a>. Being centralized allows them to move fast, while open-source and cryptography provide the necessary trust and insight in the platform and guarantee privacy. Apart from end-to-end encrypted messengers like Signal and Threema, <a href=\"https://lukasrosenstock.net/2020/05/10/one-of-the.html\">Keybase</a> is an excellent example of this model. I agree with him, and I disagree with decentralization purists who believe decentralized systems are always better. Not to be mistaken, I like distributed and federated systems and would love to see more for reasons I’ll get into soon. Still, centralization isn’t evil by definition and can sometimes work well, especially when there are measures to ensure that the interests of all stakeholders are aligned.</p>\n\n<p>Going back to the first statement, I think Moxie makes the common mistake of a false dichotomy. It’s not a choice between everyone running a server or participating in a centralized platform. There’s a lot of middle ground. Think of managed hosting for open-source software—hundreds of companies of all sizes offer this. Smaller SaaS providers that interoperate with each other don’t even need to be open-source to interact with other small SaaS; open protocols are enough. Yes, protocols make change harder, but there’s still potential to innovate at the edge as <a href=\"https://www.hey.com/\">Hey.com</a> did with email. An intermediary between the end-user and a somewhat messy distributed protocol can do excellent business. It’s a level playing field for different companies competing at the edge without suffering from network effects that let consumers stick with incumbents due to lock-in. It’s my idea of an actual free-market economy.</p>\n\n<p>In other words, it’s not wrong or hurting the decentralization of public blockchains to interact with them through a mediator. Problems start when one of these mediators becomes a monopoly or so strong that it could also be a centralized service. According to Moxie, this is what happens, but web3 proponents generally dismiss the concern because, in theory, there are other mediators. So, why are we seeing so few competitors? And why does the entirety of managed hosting services and micro-SaaS look like a dwarf compared to large cloud computing infrastructures or productivity suites from companies like Google, Microsoft, and Amazon?</p>\n\n<p>Any price for a product on the market contains the R&amp;D and marginal costs for each piece. For software, marginal costs are minimal, even for SaaS, because hosting has gotten cheap. The more you sell, the fewer R&amp;D costs each copy includes. And because dominating a market is both possible and rewarding, venture capitalists are willing to fund unsustainable free products that outcompete bootstrappers trying to build sustainable businesses. Hosting has similar scale effects. Running a website for a few hundred visitors is easy because you only need a single server. Once traffic grows, you need to think about separating web and database instances, vertical and horizontal scaling, and other deployment and operations issues. Getting from a hundred to a million visitors is challenging. However, going to ten million is easier because you probably already have the necessary systems in place. You only need to deploy more instances. Neither markets nor technology rewards beings medium-sized, even though that could be the healthiest option.</p>\n\n<p>Moxie ends his piece with two suggestions on improving our relationship with technology. The first is finding more ways to distribute trust without distributing infrastructure, effectively pushing the Signal/Keybase model. The second is making it easier to build. He claims that creating software has become harder in recent years and that distributed systems could accelerate the trend. I don’t think creating software has become harder per se or continues to do so. It could become even more accessible with better (AI-assisted) developer tools and <a href=\"https://lukasrosenstock.net/2020/05/06/there-is-a.html\">the proliferation of no-code and low-code</a> platforms that help people become citizen developers. Better technical writing for developer content can also lead people on this journey. In my opinion, one reason building software feels harder is that there are increasingly more tech stacks to choose from, which leads to analysis paralysis. There’s also a tendency to overengineer, such as believing you need to build a React app when static HTML with two lines of jQuery also does the trick. And not every app needs a sophisticated build and deployment pipeline. Finally, our expectations for good software have risen.</p>\n\n<p><a href=\"https://lukasrosenstock.net/2021/01/16/one-of-the.html\">APIs are essential for (no-code) creators</a> as they can be an abstraction layer for complexity, whether from underlying protocols and distributed systems or advanced algorithms like machine learning. The crucial question that we need to address is how we can make sure that not everyone relies on the same API and makes the API provider the gatekeeper it shouldn’t be. We need to determine how to build resilience into the API ecosystem by making it easier for upstarts to provide APIs and harder for incumbents to outcompete everyone and dominate the market. I don’t have answers to these questions yet, but a healthy API ecosystem needs to find them eventually.</p>\n\n<p>Moxies piece is valuable because it helps people understand how the crypto and blockchain world works. It’s also refreshing to see more nuanced takes that go beyond uncritical web3 cheerleading on one side and complete naysaying or dismissing it as a scam on the other side.</p>",
                "value": "Moxie Marlinspike, the founder of the Signal messaging app, wrote a widely shared piece called “My first impressions of web3”. The article explains how many things around blockchain, cryptocurrencies, and NFTs aren’t as decentralized as people think. Running blockchain nodes requires computation power, so crypto wallets and “dApps” need an intermediary that provides a traditional client-server API between them and the blockchain. According to Moxies observations, the ecosystem is highly centralized around just a few of these intermediaries. They have the power to moderate and censor the ecosystem, such as blocking access to NFTs that still exist somewhere on the blockchain.\n\nHe starts the blog post with two statements. The first is that people don’t want to run servers, and the second is that platforms move faster than protocols.\n\nI want to address the second statement first. It reiterates a previous post in which Moxie justifies that Signal is centralized. Being centralized allows them to move fast, while open-source and cryptography provide the necessary trust and insight in the platform and guarantee privacy. Apart from end-to-end encrypted messengers like Signal and Threema, Keybase is an excellent example of this model. I agree with him, and I disagree with decentralization purists who believe decentralized systems are always better. Not to be mistaken, I like distributed and federated systems and would love to see more for reasons I’ll get into soon. Still, centralization isn’t evil by definition and can sometimes work well, especially when there are measures to ensure that the interests of all stakeholders are aligned.\n\nGoing back to the first statement, I think Moxie makes the common mistake of a false dichotomy. It’s not a choice between everyone running a server or participating in a centralized platform. There’s a lot of middle ground. Think of managed hosting for open-source software—hundreds of companies of all sizes offer this. Smaller SaaS providers that interoperate with each other don’t even need to be open-source to interact with other small SaaS; open protocols are enough. Yes, protocols make change harder, but there’s still potential to innovate at the edge as Hey.com did with email. An intermediary between the end-user and a somewhat messy distributed protocol can do excellent business. It’s a level playing field for different companies competing at the edge without suffering from network effects that let consumers stick with incumbents due to lock-in. It’s my idea of an actual free-market economy.\n\nIn other words, it’s not wrong or hurting the decentralization of public blockchains to interact with them through a mediator. Problems start when one of these mediators becomes a monopoly or so strong that it could also be a centralized service. According to Moxie, this is what happens, but web3 proponents generally dismiss the concern because, in theory, there are other mediators. So, why are we seeing so few competitors? And why does the entirety of managed hosting services and micro-SaaS look like a dwarf compared to large cloud computing infrastructures or productivity suites from companies like Google, Microsoft, and Amazon?\n\nAny price for a product on the market contains the R&D and marginal costs for each piece. For software, marginal costs are minimal, even for SaaS, because hosting has gotten cheap. The more you sell, the fewer R&D costs each copy includes. And because dominating a market is both possible and rewarding, venture capitalists are willing to fund unsustainable free products that outcompete bootstrappers trying to build sustainable businesses. Hosting has similar scale effects. Running a website for a few hundred visitors is easy because you only need a single server. Once traffic grows, you need to think about separating web and database instances, vertical and horizontal scaling, and other deployment and operations issues. Getting from a hundred to a million visitors is challenging. However, going to ten million is easier because you probably already have the necessary systems in place. You only need to deploy more instances. Neither markets nor technology rewards beings medium-sized, even though that could be the healthiest option.\n\nMoxie ends his piece with two suggestions on improving our relationship with technology. The first is finding more ways to distribute trust without distributing infrastructure, effectively pushing the Signal/Keybase model. The second is making it easier to build. He claims that creating software has become harder in recent years and that distributed systems could accelerate the trend. I don’t think creating software has become harder per se or continues to do so. It could become even more accessible with better (AI-assisted) developer tools and the proliferation of no-code and low-code platforms that help people become citizen developers. Better technical writing for developer content can also lead people on this journey. In my opinion, one reason building software feels harder is that there are increasingly more tech stacks to choose from, which leads to analysis paralysis. There’s also a tendency to overengineer, such as believing you need to build a React app when static HTML with two lines of jQuery also does the trick. And not every app needs a sophisticated build and deployment pipeline. Finally, our expectations for good software have risen.\n\nAPIs are essential for (no-code) creators as they can be an abstraction layer for complexity, whether from underlying protocols and distributed systems or advanced algorithms like machine learning. The crucial question that we need to address is how we can make sure that not everyone relies on the same API and makes the API provider the gatekeeper it shouldn’t be. We need to determine how to build resilience into the API ecosystem by making it easier for upstarts to provide APIs and harder for incumbents to outcompete everyone and dominate the market. I don’t have answers to these questions yet, but a healthy API ecosystem needs to find them eventually.\n\nMoxies piece is valuable because it helps people understand how the crypto and blockchain world works. It’s also refreshing to see more nuanced takes that go beyond uncritical web3 cheerleading on one side and complete naysaying or dismissing it as a scam on the other side."
              }
            ],
            "url": [
              "https://lukasrosenstock.net/2022/01/09/moxie-marlinspike-the.html"
            ],
            "published": [
              "2022-01-09 15:05:48 +0100"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "content": [
              {
                "html": "<p>It’s the time of the year that we Germans call “zwischen den Jahren”, which means “between the years”. One week bridging two holidays - Christmas and New Year’s Eve - the old year seems already over, but the new one hasn’t begun. A little bubble outside of normal time. An excellent opportunity to review and reflect on your life.</p>\n\n<p>However, this isn’t one of those yearly review blog posts that others have written. I’ve decided against doing an annual review, neither publicly on this blog nor privately for myself. The reason is that I don’t see the point right now. That may sound overly negative, but the truth is I didn’t have set specific goals, so I’m not sure against what I should compare the past year. I laid out a few thoughts <a href=\"https://lukasrosenstock.net/2021/01/02/happy-new-year.html\">in</a> <a href=\"https://lukasrosenstock.net/2021/01/10/yesterdays-post-on.html\">my</a> <a href=\"https://lukasrosenstock.net/2021/01/09/exploration-and-exploitation.html\">blog</a> <a href=\"https://lukasrosenstock.net/2021/01/04/stepping-away-from.html\">posts</a> in January, but I didn’t check in further, and they weren’t actionable enough. Also, the ongoing COVID pandemic still influences our lives, and I don’t want to blame myself for not doing things that the virus prevented. Instead of looking backward, I’d rather look forward.</p>\n\n<p>One of the risks with New Year’s resolutions is that people write down huge lists and believe that a number on the calendar can change their entire personalities and routines overnight. As lovely as that might be, human beings don’t work that way. We need to establish tiny habits and constantly reflect on our progress to compound results. Hence, this blog post isn’t a list of resolutions either.</p>\n\n<p>At this point, I’m setting one single goal for next year. I will bring back something I did a few years ago, a monthly review and goal setting for the next month. I want to get more mindfulness and self-reflection into my life regularly. So yes, there will be goals and resolutions and probably a few experiments with self-improvement in terms of productivity and other areas of life, but on a shorter timescale. Maybe I’ll even add a quarterly review on top of it, but I only commit to the monthly assessment for now.</p>\n\n<p>Still, I want to share a few general thoughts about a few things I want to look at and improve in the future without setting actionable goals at the moment. I want to revisit them in my monthly review sessions.</p>\n\n<p>Many of the things I’m interested in are related to my work. The rest of them fit the labels of either “intellectual” (politics and current affairs, effective altruism, <a href=\"https://lukasrosenstock.net/2021/07/18/universal-basic-income.html\">basic income</a>, <a href=\"https://lukasrosenstock.net/2021/08/21/polywork-is-a.html\">future of work</a>, etc.) or “nerdy” (board and roleplaying games, sci-fi shows). Time spent with these interests can be solitary (reading, writing, thinking) or social (reading and discussion groups, <a href=\"https://lukasrosenstock.net/2021/06/26/dominic-duffins-recent.html\">salons</a>, and meetups). And here are two problems with that: one problem is that all of this stimulates (and strains) my brain, but nothing makes use of my body. A healthy mind can only exist in a healthy body, and I’m sure if I don’t take care of my body - which probably means taking away some time from serving my brain - I will regret that in the long run. And the other problem is that even though I spend time socializing around these interests, I won’t improve in social situations outside structured interactions around topics.</p>\n\n<p>The other theme is mindfully living in the moment and experiencing gratitude for tiny day-to-day experiences. I tend to walk through the world, and my mind is mostly somewhere else, processing thoughts and ideas that are already there instead of soaking up the surroundings. Also, I hardly appreciate the things I’m doing and experiencing. Instead, I often think about what I’m missing out on or what I should have done instead. Sometimes I see tweets and posts from people who seem to be capable of enjoying their life’s moments much better, and I tend to get jealous.</p>\n\n<p>To end this post, let’s reframe these thoughts as questions:</p>\n\n<ul>\n<li>How can I exercise and experience my body?</li>\n<li>How can I find and enjoy different kinds of social interactions?</li>\n<li>How can I be more present in each moment?</li>\n<li>How can I appreciate these moments more?</li>\n</ul>\n\n<p>I’m looking forward to finding some answers to those in 2022!</p>",
                "value": "It’s the time of the year that we Germans call “zwischen den Jahren”, which means “between the years”. One week bridging two holidays - Christmas and New Year’s Eve - the old year seems already over, but the new one hasn’t begun. A little bubble outside of normal time. An excellent opportunity to review and reflect on your life.\n\nHowever, this isn’t one of those yearly review blog posts that others have written. I’ve decided against doing an annual review, neither publicly on this blog nor privately for myself. The reason is that I don’t see the point right now. That may sound overly negative, but the truth is I didn’t have set specific goals, so I’m not sure against what I should compare the past year. I laid out a few thoughts in my blog posts in January, but I didn’t check in further, and they weren’t actionable enough. Also, the ongoing COVID pandemic still influences our lives, and I don’t want to blame myself for not doing things that the virus prevented. Instead of looking backward, I’d rather look forward.\n\nOne of the risks with New Year’s resolutions is that people write down huge lists and believe that a number on the calendar can change their entire personalities and routines overnight. As lovely as that might be, human beings don’t work that way. We need to establish tiny habits and constantly reflect on our progress to compound results. Hence, this blog post isn’t a list of resolutions either.\n\nAt this point, I’m setting one single goal for next year. I will bring back something I did a few years ago, a monthly review and goal setting for the next month. I want to get more mindfulness and self-reflection into my life regularly. So yes, there will be goals and resolutions and probably a few experiments with self-improvement in terms of productivity and other areas of life, but on a shorter timescale. Maybe I’ll even add a quarterly review on top of it, but I only commit to the monthly assessment for now.\n\nStill, I want to share a few general thoughts about a few things I want to look at and improve in the future without setting actionable goals at the moment. I want to revisit them in my monthly review sessions.\n\nMany of the things I’m interested in are related to my work. The rest of them fit the labels of either “intellectual” (politics and current affairs, effective altruism, basic income, future of work, etc.) or “nerdy” (board and roleplaying games, sci-fi shows). Time spent with these interests can be solitary (reading, writing, thinking) or social (reading and discussion groups, salons, and meetups). And here are two problems with that: one problem is that all of this stimulates (and strains) my brain, but nothing makes use of my body. A healthy mind can only exist in a healthy body, and I’m sure if I don’t take care of my body - which probably means taking away some time from serving my brain - I will regret that in the long run. And the other problem is that even though I spend time socializing around these interests, I won’t improve in social situations outside structured interactions around topics.\n\nThe other theme is mindfully living in the moment and experiencing gratitude for tiny day-to-day experiences. I tend to walk through the world, and my mind is mostly somewhere else, processing thoughts and ideas that are already there instead of soaking up the surroundings. Also, I hardly appreciate the things I’m doing and experiencing. Instead, I often think about what I’m missing out on or what I should have done instead. Sometimes I see tweets and posts from people who seem to be capable of enjoying their life’s moments much better, and I tend to get jealous.\n\nTo end this post, let’s reframe these thoughts as questions:\n\n\nHow can I exercise and experience my body?\nHow can I find and enjoy different kinds of social interactions?\nHow can I be more present in each moment?\nHow can I appreciate these moments more?\n\n\nI’m looking forward to finding some answers to those in 2022!"
              }
            ],
            "url": [
              "https://lukasrosenstock.net/2021/12/27/its-the-time.html"
            ],
            "published": [
              "2021-12-27 18:02:44 +0100"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "content": [
              {
                "html": "<p>Procrastination is one of the most annoying human behaviors. Even though we realize that it’s often small tasks that we’ve been putting off, and we’d probably feel better if we did them earlier, we can’t seem to go against our tendency to procrastinate. Understanding how procrastination works doesn’t mean we can stop it. At least not immediately. I still believe that understanding how and why we procrastinate may help improve our habits in the long run.</p>\n\n<p>Anne-Laure LeCunff of <a href=\"https://nesslabs.com/\">Ness Labs</a> has published two articles lately, sharing research around procrastination and introducing mental models for understanding the reasons behind this behavior. <a href=\"https://nesslabs.com/dust-procrastination\">The DUST model</a> contains four adjectives to describe tasks that we put off: difficult, unclear, scary, or tedious. <a href=\"https://nesslabs.com/procrastination-triggers\">Another model goes beyond that</a> and includes eight procrastination triggers: boring, frustrating, difficult, stressful, ambiguous, unstructured, unrewarding, and meaningless.</p>\n\n<p>I wanted to write this article to explain my personal experience with procrastination because I found both models not fitting well with what I experienced. I can relate to “unclear” and “ambiguous/unstructured” because I’ve found myself procrastinating when I don’t know exactly how to get started. Apart from that, I found others that I would like to explain.</p>\n\n<p>For me, the main procrastination trigger seems to be a mismatch between the time I would like to spend on a task and the time that I should reasonably spend on it. It’s the choice between building a solution that works or a perfectly engineered solution. It’s the trade-off between executing a process or optimizing the process in ways that take more time now but could eventually (but not guaranteed) save time later. In other words, it’s <a href=\"https://lukasrosenstock.net/2021/01/03/perfectionism-is-a.html\">a perfectionist’s problem</a>—the fear of doing something in a mediocre way results in not doing it (maybe this fits “scary” from the DUST model). My difference is that I’m confident that I would have the skills to do it better, but I don’t have enough time (or the client doesn’t have enough budget). It may be a delusion, but I think it’s an interesting angle that I haven’t seen anywhere else yet.</p>\n\n<p>In some cases, you can deliver what appears to be the same result with a perfect process or one that barely holds together. Whoever asked for the result may not care about the process, and I’m not sure how much the better one pays off in the long run. In these cases, “unrewarding/meaningless” may be good words because I’m doing something just for myself. I may care, but do I care enough to invest extra effort?</p>\n\n<p>Another procrastination trigger is that when it’s apparent that I will miss a deadline or have already missed it, I find it even harder to get started. At least partly, this is the same perfectionism and time problem because I have to do something fast rather than doing it well in those cases. On the other hand, it requires facing yourself and your mistake. It’s easier to forget the looming deadline when you’re distracting yourself than when working on the project with that deadline itself. You may feel like whoever set that deadline, e.g., a client, might appear at every moment, and you have to explain yourself. Luckily, this is relatively easy to solve: ask for an extension of the deadline. Own your failure of delivering on time, and the stress dissolves. Then, you can focus on completing the task for the new deadline.</p>\n\n<p>There’s another trigger that one could consider a combination of the previous two. I assume that I share this problem with other freelancers, entrepreneurs, and people who have a lot of priorities to juggle without clear order or who don’t like saying “no”. When you’re doing multiple projects in parallel, you will often end up overcommitting, and you will not be able to fulfill everything. It means you may have to deliver a flawed product or deliver too late, and you have to choose who you’re going to disappoint in which way. In these cases, I find that perfectionism leads to resignation. If I can’t satisfy all requirements, what’s the point in doing anything at all? I often find that I end up being tired, and I’m not sure if I’ve genuinely run out of steam or if it’s just a convenient excuse. However, once I’ve entirely accepted the situation that I’m in and then take a good rest, it’s easier to get back to my tasks the next day without procrastination.</p>\n\n<p>I’m interested in your feedback! Can you relate to my experiences, or have you noticed some others for yourself?</p>",
                "value": "Procrastination is one of the most annoying human behaviors. Even though we realize that it’s often small tasks that we’ve been putting off, and we’d probably feel better if we did them earlier, we can’t seem to go against our tendency to procrastinate. Understanding how procrastination works doesn’t mean we can stop it. At least not immediately. I still believe that understanding how and why we procrastinate may help improve our habits in the long run.\n\nAnne-Laure LeCunff of Ness Labs has published two articles lately, sharing research around procrastination and introducing mental models for understanding the reasons behind this behavior. The DUST model contains four adjectives to describe tasks that we put off: difficult, unclear, scary, or tedious. Another model goes beyond that and includes eight procrastination triggers: boring, frustrating, difficult, stressful, ambiguous, unstructured, unrewarding, and meaningless.\n\nI wanted to write this article to explain my personal experience with procrastination because I found both models not fitting well with what I experienced. I can relate to “unclear” and “ambiguous/unstructured” because I’ve found myself procrastinating when I don’t know exactly how to get started. Apart from that, I found others that I would like to explain.\n\nFor me, the main procrastination trigger seems to be a mismatch between the time I would like to spend on a task and the time that I should reasonably spend on it. It’s the choice between building a solution that works or a perfectly engineered solution. It’s the trade-off between executing a process or optimizing the process in ways that take more time now but could eventually (but not guaranteed) save time later. In other words, it’s a perfectionist’s problem—the fear of doing something in a mediocre way results in not doing it (maybe this fits “scary” from the DUST model). My difference is that I’m confident that I would have the skills to do it better, but I don’t have enough time (or the client doesn’t have enough budget). It may be a delusion, but I think it’s an interesting angle that I haven’t seen anywhere else yet.\n\nIn some cases, you can deliver what appears to be the same result with a perfect process or one that barely holds together. Whoever asked for the result may not care about the process, and I’m not sure how much the better one pays off in the long run. In these cases, “unrewarding/meaningless” may be good words because I’m doing something just for myself. I may care, but do I care enough to invest extra effort?\n\nAnother procrastination trigger is that when it’s apparent that I will miss a deadline or have already missed it, I find it even harder to get started. At least partly, this is the same perfectionism and time problem because I have to do something fast rather than doing it well in those cases. On the other hand, it requires facing yourself and your mistake. It’s easier to forget the looming deadline when you’re distracting yourself than when working on the project with that deadline itself. You may feel like whoever set that deadline, e.g., a client, might appear at every moment, and you have to explain yourself. Luckily, this is relatively easy to solve: ask for an extension of the deadline. Own your failure of delivering on time, and the stress dissolves. Then, you can focus on completing the task for the new deadline.\n\nThere’s another trigger that one could consider a combination of the previous two. I assume that I share this problem with other freelancers, entrepreneurs, and people who have a lot of priorities to juggle without clear order or who don’t like saying “no”. When you’re doing multiple projects in parallel, you will often end up overcommitting, and you will not be able to fulfill everything. It means you may have to deliver a flawed product or deliver too late, and you have to choose who you’re going to disappoint in which way. In these cases, I find that perfectionism leads to resignation. If I can’t satisfy all requirements, what’s the point in doing anything at all? I often find that I end up being tired, and I’m not sure if I’ve genuinely run out of steam or if it’s just a convenient excuse. However, once I’ve entirely accepted the situation that I’m in and then take a good rest, it’s easier to get back to my tasks the next day without procrastination.\n\nI’m interested in your feedback! Can you relate to my experiences, or have you noticed some others for yourself?"
              }
            ],
            "url": [
              "https://lukasrosenstock.net/2021/10/17/procrastination-is-one.html"
            ],
            "published": [
              "2021-10-17 16:39:27 +0100"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "content": [
              {
                "html": "<p>Our book’s pre-release (MEAP) received two more updates since <a href=\"https://lukasrosenstock.net/2021/08/05/i-have-news.html\">my last post</a>. Now the missing chapters 18, 19, 20, and 21 for <a href=\"https://www.manning.com/books/designing-apis-with-swagger-and-openapi\">“Designing APIs with Swagger and OpenAPI”</a> have been published as well. In chapters 18, 19, and 20, we’re looking at various advanced OpenAPI topics that help API designers refine their API definition and include as much machine-readable meta information as possible.</p>\n\n<p>Chapter 18 is about filters, pagination, and sorting, topics of utmost importance for any API that provides access to an extensive dataset. Chapter 19 covers error handling. Finally, chapter 20 gives an excellent overview of the data validation capabilities of JSON schema that API providers can use for input validation. All three extend the PetSitter sample API that we use <a href=\"https://lukasrosenstock.net/2021/05/03/its-time-for.html\">throughout the second and third parts of the book</a>.</p>\n\n<p>Our final chapter, 21, covers the next steps you have to take once you make a private or partner API available to the general public. We highlight the most critical API design issues and introduce the “API exposure index” as a way to decide and describe how much of your API you want to publish and which parts you want to keep private.</p>\n\n<p>We’re getting closer and closer to the finish line. We only need to complete the final review and add the appendix(es). Then, the book enters production.</p>\n\n<p>If you haven’t preordered the book yet, <a href=\"https://www.manning.com/books/designing-apis-with-swagger-and-openapi\">it’s a good time to do so</a>. I am looking forward to your thoughts on these topics as well.</p>",
                "value": "Our book’s pre-release (MEAP) received two more updates since my last post. Now the missing chapters 18, 19, 20, and 21 for “Designing APIs with Swagger and OpenAPI” have been published as well. In chapters 18, 19, and 20, we’re looking at various advanced OpenAPI topics that help API designers refine their API definition and include as much machine-readable meta information as possible.\n\nChapter 18 is about filters, pagination, and sorting, topics of utmost importance for any API that provides access to an extensive dataset. Chapter 19 covers error handling. Finally, chapter 20 gives an excellent overview of the data validation capabilities of JSON schema that API providers can use for input validation. All three extend the PetSitter sample API that we use throughout the second and third parts of the book.\n\nOur final chapter, 21, covers the next steps you have to take once you make a private or partner API available to the general public. We highlight the most critical API design issues and introduce the “API exposure index” as a way to decide and describe how much of your API you want to publish and which parts you want to keep private.\n\nWe’re getting closer and closer to the finish line. We only need to complete the final review and add the appendix(es). Then, the book enters production.\n\nIf you haven’t preordered the book yet, it’s a good time to do so. I am looking forward to your thoughts on these topics as well."
              }
            ],
            "url": [
              "https://lukasrosenstock.net/2021/09/13/our-books-prerelease.html"
            ],
            "published": [
              "2021-09-13 14:12:41 +0100"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "content": [
              {
                "html": "<p><strong>Polywork</strong> is a new term that describes the concept of choosing multiple part-time jobs or freelance contracts over a single full-time job, primarily when those jobs or gigs cover various areas of interest. I first heard the term when the namesake social network <a href=\"https://www.polywork.com/\">Polywork</a> launched, which considers itself an alternative to traditional business networks like LinkedIn, designed with “poly workers” in mind. The term appears beyond the company, for example, <a href=\"https://nevilleamehra.com/never-normal-newsletter/polywork-personal-brands-and-jobs-of-the-future/\">in Neville A Mehra’s “Polywork, Personal Brands, and Jobs of the Future”</a>. It also describes what I do, being a freelance entrepreneur who always works for different clients at the same time and covers various tasks such as software development, technical writing, and consulting.</p>\n\n<p>Last night I saw <a href=\"https://twitter.com/AlanRMacLeod/status/1428815361219125256\">a tweet that triggered writing this article. It featured two screenshots of articles describing polywork as a new trend embraced by millennials and Gen Z, captioned with: “They’ve come up with a new word for desperately working multiple jobs just to be able to afford rent.”</a> Many of the comments agree with the original tweet, adding other words like “exploitation” in the mix. Now, what’s the truth about polywork? <a href=\"https://www.forbes.com/sites/ashleystahl/2021/08/04/the-truth-about-polywork-desire-or-necessity/\">Is it “desire or necessity”, as a Forbes article titled it?</a></p>\n\n<p>We live in exciting times with a lot of things changing around us due to digital transformation. We further live in times of rising economic inequality and insecurity in a lot of countries. There’s also a vast diversity of (sub-)cultures and lifestyles. One of the problems with this world is that it makes it increasingly difficult to throw large parts of the population together and describe them accurately. Any attempt to define millennials or Gen Z (or any other generation) as a whole is an oversimplification that ignores different economic realities and levels of privilege.</p>\n\n<p>The truth is that one person can be forced into something that is a choice for another. You can be a freelancer because nobody wants to give you a full-time job, or you can choose it because you value freedom and diversity and don’t want to make yourself dependent on a single employer. Of course, the economic reality of the first person is terrible, and we should improve it, but that doesn’t mean that the choice of the second person is invalid. It’s wrong to assume that they’ve just been gaslit into believing they made a choice and they’d be happier with stable employment.</p>\n\n<p>There’s the widespread belief among some in the political left, especially those closely aligned with worker’s unions, that the best way to end economic precarity is to make sure that everybody has a 9-5 job with strong worker protections. While I welcome the availability of jobs for those who want them, I believe it’s challenging to organize the whole economy around them. The necessities of modern companies require on-demand expertise that flexible contractors can bring to the table. Instead of forcing the 9-5 model on everyone, we should have different ways of social protection for freelancers and other poly workers, such as a <a href=\"https://lukasrosenstock.net/2021/07/18/universal-basic-income.html\">universal basic income</a>.</p>\n\n<p>The whole concept doesn’t just apply to work but also to consumption habits. Let me tell you a story from my childhood. Our neighbors used to go on a skiing vacation every winter. Once, their son came to us and said: “I feel sorry for you that you can’t afford to go on vacation.” This child’s assessment was wrong because my parents could well afford it. They were just not interested in skiing.</p>\n\n<p>One of the reasons for overconsumption is that people want to signal their purchase power. There are counter-movements like minimalism, but they’re still a niche. Again, some people may want to own a single-family home, a car, etc. but can’t afford one. Others prefer to rent an apartment or use carsharing for flexibility and avoid the responsibility of ownership, even though they could own more stuff. It’s crucial, however, to not mistake one for the other. We must improve the economic circumstances of the poor, but at the same time, there are benefits when the rich choose to work and consume less or differently. Having to do things due to poverty is not a “trend”, but neither is it helpful to force the middle-class and the rich into a “normal” lifestyle of overwork and overconsumption.</p>",
                "value": "Polywork is a new term that describes the concept of choosing multiple part-time jobs or freelance contracts over a single full-time job, primarily when those jobs or gigs cover various areas of interest. I first heard the term when the namesake social network Polywork launched, which considers itself an alternative to traditional business networks like LinkedIn, designed with “poly workers” in mind. The term appears beyond the company, for example, in Neville A Mehra’s “Polywork, Personal Brands, and Jobs of the Future”. It also describes what I do, being a freelance entrepreneur who always works for different clients at the same time and covers various tasks such as software development, technical writing, and consulting.\n\nLast night I saw a tweet that triggered writing this article. It featured two screenshots of articles describing polywork as a new trend embraced by millennials and Gen Z, captioned with: “They’ve come up with a new word for desperately working multiple jobs just to be able to afford rent.” Many of the comments agree with the original tweet, adding other words like “exploitation” in the mix. Now, what’s the truth about polywork? Is it “desire or necessity”, as a Forbes article titled it?\n\nWe live in exciting times with a lot of things changing around us due to digital transformation. We further live in times of rising economic inequality and insecurity in a lot of countries. There’s also a vast diversity of (sub-)cultures and lifestyles. One of the problems with this world is that it makes it increasingly difficult to throw large parts of the population together and describe them accurately. Any attempt to define millennials or Gen Z (or any other generation) as a whole is an oversimplification that ignores different economic realities and levels of privilege.\n\nThe truth is that one person can be forced into something that is a choice for another. You can be a freelancer because nobody wants to give you a full-time job, or you can choose it because you value freedom and diversity and don’t want to make yourself dependent on a single employer. Of course, the economic reality of the first person is terrible, and we should improve it, but that doesn’t mean that the choice of the second person is invalid. It’s wrong to assume that they’ve just been gaslit into believing they made a choice and they’d be happier with stable employment.\n\nThere’s the widespread belief among some in the political left, especially those closely aligned with worker’s unions, that the best way to end economic precarity is to make sure that everybody has a 9-5 job with strong worker protections. While I welcome the availability of jobs for those who want them, I believe it’s challenging to organize the whole economy around them. The necessities of modern companies require on-demand expertise that flexible contractors can bring to the table. Instead of forcing the 9-5 model on everyone, we should have different ways of social protection for freelancers and other poly workers, such as a universal basic income.\n\nThe whole concept doesn’t just apply to work but also to consumption habits. Let me tell you a story from my childhood. Our neighbors used to go on a skiing vacation every winter. Once, their son came to us and said: “I feel sorry for you that you can’t afford to go on vacation.” This child’s assessment was wrong because my parents could well afford it. They were just not interested in skiing.\n\nOne of the reasons for overconsumption is that people want to signal their purchase power. There are counter-movements like minimalism, but they’re still a niche. Again, some people may want to own a single-family home, a car, etc. but can’t afford one. Others prefer to rent an apartment or use carsharing for flexibility and avoid the responsibility of ownership, even though they could own more stuff. It’s crucial, however, to not mistake one for the other. We must improve the economic circumstances of the poor, but at the same time, there are benefits when the rich choose to work and consume less or differently. Having to do things due to poverty is not a “trend”, but neither is it helpful to force the middle-class and the rich into a “normal” lifestyle of overwork and overconsumption."
              }
            ],
            "url": [
              "https://lukasrosenstock.net/2021/08/21/polywork-is-a.html"
            ],
            "published": [
              "2021-08-21 12:40:35 +0100"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "content": [
              {
                "html": "<p>Path traversal attacks are a typical attack vector that compromises the security of APIs and web applications. It’s an injection attack where the perpetrator tries to access or modify private files on the webserver. I recently wrote <a href=\"https://www.stackhawk.com/blog/laravel-path-traversal-guide-examples-and-prevention/\">a guest post for Stackhawk about path traversal attacks in PHP applications built with the Laravel framework</a>. In the piece, I’m discussing what path traversal attacks are, how they occur, and how to prevent them. It was the second piece I wrote for Stackhawk <a href=\"https://lukasrosenstock.net/2021/06/20/browsers-restrict-api.html\">after covering CORS in Laravel applications</a>.</p>\n\n<p>API security (and web application security in general) is a crucial topic if you care about the integrity of your systems and the privacy of your users. And still, <a href=\"https://lukasrosenstock.net/2020/04/14/security-is-an.html\">things go wrong</a>, so it’s necessary to raise more awareness, which I’m happy to do.</p>\n\n<p><em>Disclosure: This work was paid for by StackHawk.</em></p>",
                "value": "Path traversal attacks are a typical attack vector that compromises the security of APIs and web applications. It’s an injection attack where the perpetrator tries to access or modify private files on the webserver. I recently wrote a guest post for Stackhawk about path traversal attacks in PHP applications built with the Laravel framework. In the piece, I’m discussing what path traversal attacks are, how they occur, and how to prevent them. It was the second piece I wrote for Stackhawk after covering CORS in Laravel applications.\n\nAPI security (and web application security in general) is a crucial topic if you care about the integrity of your systems and the privacy of your users. And still, things go wrong, so it’s necessary to raise more awareness, which I’m happy to do.\n\nDisclosure: This work was paid for by StackHawk."
              }
            ],
            "url": [
              "https://lukasrosenstock.net/2021/08/16/path-traversal-attacks.html"
            ],
            "published": [
              "2021-08-16 09:50:07 +0100"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "content": [
              {
                "html": "<p>I have news to announce regarding <a href=\"https://lukasrosenstock.net/2021/05/03/its-time-for.html\">the book about designing APIs with OpenAPI and Swagger that I’m writing together with Josh Ponelat</a>. We finished all chapters except for the appendixes and are now in the exciting final review phase. While the whole book is probably still a few weeks from production, this was an important milestone on the way, and we’re proud we made it this far.</p>\n\n<p>Also, <a href=\"https://www.manning.com/books/designing-apis-with-swagger-and-openapi\">the first two chapters of the third part of the book - 16 and 17 - are now available on Manning’s website as part of the Manning Early Access Program (MEAP)</a>. In the third part, we’re taking the API from the sample application we have built during part two and refine it to improve the developer experience for an eventual release of the API. We also extend its functionality and discuss bringing in a new version of API. In chapter 16, we’re outlining the whole process and update our user stories and domain model. In chapter 17, we’re adding a new feature, which leads us to discuss composition keywords in OpenAPI that help design more complex and still reusable schemas.</p>\n\n<p>If that’s something you’re interested in (I bet you are!), please <a href=\"https://www.manning.com/books/designing-apis-with-swagger-and-openapi\">pre-order the book</a>, read the new chapters and let me know your feedback.</p>",
                "value": "I have news to announce regarding the book about designing APIs with OpenAPI and Swagger that I’m writing together with Josh Ponelat. We finished all chapters except for the appendixes and are now in the exciting final review phase. While the whole book is probably still a few weeks from production, this was an important milestone on the way, and we’re proud we made it this far.\n\nAlso, the first two chapters of the third part of the book - 16 and 17 - are now available on Manning’s website as part of the Manning Early Access Program (MEAP). In the third part, we’re taking the API from the sample application we have built during part two and refine it to improve the developer experience for an eventual release of the API. We also extend its functionality and discuss bringing in a new version of API. In chapter 16, we’re outlining the whole process and update our user stories and domain model. In chapter 17, we’re adding a new feature, which leads us to discuss composition keywords in OpenAPI that help design more complex and still reusable schemas.\n\nIf that’s something you’re interested in (I bet you are!), please pre-order the book, read the new chapters and let me know your feedback."
              }
            ],
            "url": [
              "https://lukasrosenstock.net/2021/08/05/i-have-news.html"
            ],
            "published": [
              "2021-08-05 11:03:34 +0100"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "content": [
              {
                "html": "<p><strong>Universal Basic Income (UBI)</strong> is the idea that every citizen should receive a monthly sum of money with no strings attached, regardless of other income sources. The idea isn’t exactly new, and it has supporters and opponents anywhere on the political spectrum. It also <a href=\"https://lukasrosenstock.net/2020/03/16/the-new-coronavirus.html\">featured prominently during the pandemic</a>. So far, no country has implemented it, but there are a variety of experiments. None of these reflect the universality of a basic income, but they’re helpful nonetheless. I <a href=\"https://interintellect.com/salon/free-cah-lets-talk-universal-basic-income/\">hosted an Interintellect salon</a> - my debut as a solo host after <a href=\"https://lukasrosenstock.net/2021/04/11/making-friends-and.html\">my Personal CRM salon co-hosted with Vajresh Balaji</a> - to discuss the idea with fellow curious minds.</p>\n\n<p>As is usual with salons, I asked an intro question, which was: “Who do you think would benefit from UBI?” We talked about cash transfers for low-income countries through charities like <a href=\"https://www.givedirectly.org/\">GiveDirectly</a>, an approach popular in the <a href=\"https://www.effectivealtruism.org/\">Effective Altruism</a> community. We also mentioned creative and innovative people in rich countries who may not currently have the freedom to invent or express their creativity as they’re stuck in their jobs. It reminded me of the description of basic income as <a href=\"https://www.fastcompany.com/40412384/venture-capital-for-the-people-making-the-case-for-a-basic-income\">“venture capital for the people”</a>.</p>\n\n<p>How high should basic income be? Public discussion centers around round numbers like $1000/month or a minimum livable wage equivalent. An alternative would be defining it as the percentage of the average or median income. The definition of what a minimum livable wage is may change, so tying it to existing wages avoids the discussion. Another idea is to look at current government spending per person and pay it out directly. The latter leads to another question, whose answer seems to depend on whether you’re more on the left side of the political spectrum or more libertarian. Which public services can and should basic income replace? Should we even see it as a replacement or more as an add-on to the current services? While large infrastructure projects such as flood defense should probably remain with the government, they could privatize communal services like swimming pools. Of course, it’s too early to propose anything specific, so we didn’t spend a lot of time discussing this point. There should be more research first.</p>\n\n<p>If there was a way to implement basic income on a global scale, it could give people additional opportunities to move around the world and find the life that fits them. Even though it’s a fascinating idea, it’s probably even further away than national basic income. There are, however, exciting approaches for voluntary funded basic income that doesn’t stop at national borders. Most use blockchain and cryptocurrencies. Examples include <a href=\"https://joincircles.net/\">Circles</a> and <a href=\"https://www.gooddollar.org/\">GoodDollar</a>. We’re not yet fully convinced, especially since these often create custom coins that don’t have serious trade value, so they need a lot of trust and buy-in into their currency first. How far can voluntary approaches go anyway, in terms of funding basic income or other worthy causes? High-income countries and businesses could do more to drive people to give to charity, for example, by offering benefits in exchange for (zero-knowledge) proofs of donation. They could also give people more say in where their tax dollars go, although that may be unfair and undemocratic when it gives high-income individuals more influence on the state’s budget.</p>\n\n<p>A common criticism against basic income is that it’s people’s fault when they’re poor. Therefore, we shouldn’t give to “undeserving” people. However, we believe that <a href=\"https://www.ted.com/talks/rutger_bregman_poverty_isn_t_a_lack_of_character_it_s_a_lack_of_cash\">poverty is mostly the cause of bad decisions, not its outcome</a>. We should also look at the future where society benefits when we allow people to recover and grow. Another point of criticism is that, because basic income is a substantial money redistribution machine, it gives too much power to the state. The government might eventually use that as an excuse to increase demands on their citizens. Asking how basic income influences the job market, people are forced to take any job to survive without it. As a result, it currently creates pay rates below market rates, leading to an unfair market. That would change.</p>\n\n<p>Our last point of discussion was whether technological unemployment would become so common that it’s a solid argument to make basic income necessary? We’re unsure. On the one hand, there is no precedence for new technologies destroying more jobs than they create. On the other hand, it’s much more likely now, primarily due to the differences between manual work and knowledge work.</p>\n\n<p>Overall, the salon was a good discussion and exchange of ideas and thoughts. I’m looking forward to continuing the conversation some other time.</p>",
                "value": "Universal Basic Income (UBI) is the idea that every citizen should receive a monthly sum of money with no strings attached, regardless of other income sources. The idea isn’t exactly new, and it has supporters and opponents anywhere on the political spectrum. It also featured prominently during the pandemic. So far, no country has implemented it, but there are a variety of experiments. None of these reflect the universality of a basic income, but they’re helpful nonetheless. I hosted an Interintellect salon - my debut as a solo host after my Personal CRM salon co-hosted with Vajresh Balaji - to discuss the idea with fellow curious minds.\n\nAs is usual with salons, I asked an intro question, which was: “Who do you think would benefit from UBI?” We talked about cash transfers for low-income countries through charities like GiveDirectly, an approach popular in the Effective Altruism community. We also mentioned creative and innovative people in rich countries who may not currently have the freedom to invent or express their creativity as they’re stuck in their jobs. It reminded me of the description of basic income as “venture capital for the people”.\n\nHow high should basic income be? Public discussion centers around round numbers like $1000/month or a minimum livable wage equivalent. An alternative would be defining it as the percentage of the average or median income. The definition of what a minimum livable wage is may change, so tying it to existing wages avoids the discussion. Another idea is to look at current government spending per person and pay it out directly. The latter leads to another question, whose answer seems to depend on whether you’re more on the left side of the political spectrum or more libertarian. Which public services can and should basic income replace? Should we even see it as a replacement or more as an add-on to the current services? While large infrastructure projects such as flood defense should probably remain with the government, they could privatize communal services like swimming pools. Of course, it’s too early to propose anything specific, so we didn’t spend a lot of time discussing this point. There should be more research first.\n\nIf there was a way to implement basic income on a global scale, it could give people additional opportunities to move around the world and find the life that fits them. Even though it’s a fascinating idea, it’s probably even further away than national basic income. There are, however, exciting approaches for voluntary funded basic income that doesn’t stop at national borders. Most use blockchain and cryptocurrencies. Examples include Circles and GoodDollar. We’re not yet fully convinced, especially since these often create custom coins that don’t have serious trade value, so they need a lot of trust and buy-in into their currency first. How far can voluntary approaches go anyway, in terms of funding basic income or other worthy causes? High-income countries and businesses could do more to drive people to give to charity, for example, by offering benefits in exchange for (zero-knowledge) proofs of donation. They could also give people more say in where their tax dollars go, although that may be unfair and undemocratic when it gives high-income individuals more influence on the state’s budget.\n\nA common criticism against basic income is that it’s people’s fault when they’re poor. Therefore, we shouldn’t give to “undeserving” people. However, we believe that poverty is mostly the cause of bad decisions, not its outcome. We should also look at the future where society benefits when we allow people to recover and grow. Another point of criticism is that, because basic income is a substantial money redistribution machine, it gives too much power to the state. The government might eventually use that as an excuse to increase demands on their citizens. Asking how basic income influences the job market, people are forced to take any job to survive without it. As a result, it currently creates pay rates below market rates, leading to an unfair market. That would change.\n\nOur last point of discussion was whether technological unemployment would become so common that it’s a solid argument to make basic income necessary? We’re unsure. On the one hand, there is no precedence for new technologies destroying more jobs than they create. On the other hand, it’s much more likely now, primarily due to the differences between manual work and knowledge work.\n\nOverall, the salon was a good discussion and exchange of ideas and thoughts. I’m looking forward to continuing the conversation some other time."
              }
            ],
            "url": [
              "https://lukasrosenstock.net/2021/07/18/universal-basic-income.html"
            ],
            "published": [
              "2021-07-18 10:51:39 +0100"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "content": [
              {
                "html": "<p><a href=\"https://racket.com/\">Racket</a> is an exciting new social audio platform. Unlike other recently hyped real-time social audio apps such as <a href=\"https://www.joinclubhouse.com/\">Clubhouse</a>, which Twitter copied with its Spaces product, Racket is a fresh take on podcasting. If you wanted to make an “X for Y” pitch for the product, you could call it Twitter for podcasting. Twitter is micro-blogging, and Racket is micro-casting. Every podcast episode, if you even want to call it that, on Racket has a limit of nine minutes. That makes them great to listen to during a short break. They don’t require the time commitment to listen to an hour-long podcast. Recording on Racket is an excellent exercise in bringing your message across in a world with short attention spans, as the medium forces you to be concise with your spoken word.</p>\n\n<p>I have shared my thoughts about Racket and audio as a medium <a href=\"https://racket.com/lr/reafY\">in my first solo recording</a> and <a href=\"https://racket.com/lr/rHy7G\">a conversation with my friend Clo</a>. And that brings me to the second advantage of the platform. It makes recording podcasts with multiple people as easy as it can be. You can record directly on their website with the studio feature, and you can share the URL to that studio page with anyone. When they go to that page, and you approve them, you’re immediately connected. First, you can have an unrecorded conversation to get ready. Then, the studio owner hits the <em>Record</em> button, and the recording starts.</p>\n\n<p>At the end of the recording, your podcast episode goes live immediately. If you recorded with two or more people, it appears on everyone’s profile. The latter feature improves discovery because people following just one of the participants can discover another person and their profile from this recording. It also solves the use case that some people have voiced about finding and listening to interviews with the same person on different podcasts. Of course, it works just within the walled garden that is Racket and not throughout the whole decentralized podcast ecosystem, but it’s a start.</p>\n\n<p>Even though Racket takes out the complexity of recording conversations and interviews, you still have to schedule time for them. That’s where another appealing feature comes in: “Ask me anything”. Every Racket user has an AMA page where others can record a question for them. The user can then decide that they want to answer. Racket stitches question and answer together into one recording. Here’s <a href=\"https://racket.com/lr/ask\">my AMA page</a>, and here’s <a href=\"https://racket.com/lr/rdrag\">the first question I received and the answer I’ve given</a>. There’s also a related feature called “Volley” where multiple people can answer the same question, but I haven’t tried that and won’t comment on it.</p>\n\n<p>My main concern with the platform right now is that I don’t see a business model yet. Will there be pre-roll ads or subscription fees? There’s no information yet, and a conversation I had with <a href=\"https://twitter.com/stuartdsmith\">Stu from Racket</a> wasn’t reassuring. I’m <a href=\"https://lukasrosenstock.net/2020/04/28/if-you-are.html\">generally enthusiastic about new social media platforms (even centralized ones)</a> because they stir things up and provide new means of expression outside the existing platforms like Twitter and Facebook. Without a sustainable business model, though, there’s always the chance that the company will get acquired (and listed on <a href=\"https://ourincrediblejourney.tumblr.com/\">“Our Incredible Journey”</a>), and their network ends up as a feature of a larger platform that boosts its dominant position that way. Although, to be fair, acquisitions happen even for companies that have found their product-market fit and are profitable, so that’s always a risk when you put time into a social network.</p>\n\n<p>If you want to try Racket, please use <a href=\"https://racket.com/lr/ask\">my AMA page</a> or <a href=\"mailto:lukas@rosenstock.email\">contact me</a> if you’d like to record a conversation with me.</p>",
                "value": "Racket is an exciting new social audio platform. Unlike other recently hyped real-time social audio apps such as Clubhouse, which Twitter copied with its Spaces product, Racket is a fresh take on podcasting. If you wanted to make an “X for Y” pitch for the product, you could call it Twitter for podcasting. Twitter is micro-blogging, and Racket is micro-casting. Every podcast episode, if you even want to call it that, on Racket has a limit of nine minutes. That makes them great to listen to during a short break. They don’t require the time commitment to listen to an hour-long podcast. Recording on Racket is an excellent exercise in bringing your message across in a world with short attention spans, as the medium forces you to be concise with your spoken word.\n\nI have shared my thoughts about Racket and audio as a medium in my first solo recording and a conversation with my friend Clo. And that brings me to the second advantage of the platform. It makes recording podcasts with multiple people as easy as it can be. You can record directly on their website with the studio feature, and you can share the URL to that studio page with anyone. When they go to that page, and you approve them, you’re immediately connected. First, you can have an unrecorded conversation to get ready. Then, the studio owner hits the Record button, and the recording starts.\n\nAt the end of the recording, your podcast episode goes live immediately. If you recorded with two or more people, it appears on everyone’s profile. The latter feature improves discovery because people following just one of the participants can discover another person and their profile from this recording. It also solves the use case that some people have voiced about finding and listening to interviews with the same person on different podcasts. Of course, it works just within the walled garden that is Racket and not throughout the whole decentralized podcast ecosystem, but it’s a start.\n\nEven though Racket takes out the complexity of recording conversations and interviews, you still have to schedule time for them. That’s where another appealing feature comes in: “Ask me anything”. Every Racket user has an AMA page where others can record a question for them. The user can then decide that they want to answer. Racket stitches question and answer together into one recording. Here’s my AMA page, and here’s the first question I received and the answer I’ve given. There’s also a related feature called “Volley” where multiple people can answer the same question, but I haven’t tried that and won’t comment on it.\n\nMy main concern with the platform right now is that I don’t see a business model yet. Will there be pre-roll ads or subscription fees? There’s no information yet, and a conversation I had with Stu from Racket wasn’t reassuring. I’m generally enthusiastic about new social media platforms (even centralized ones) because they stir things up and provide new means of expression outside the existing platforms like Twitter and Facebook. Without a sustainable business model, though, there’s always the chance that the company will get acquired (and listed on “Our Incredible Journey”), and their network ends up as a feature of a larger platform that boosts its dominant position that way. Although, to be fair, acquisitions happen even for companies that have found their product-market fit and are profitable, so that’s always a risk when you put time into a social network.\n\nIf you want to try Racket, please use my AMA page or contact me if you’d like to record a conversation with me."
              }
            ],
            "url": [
              "https://lukasrosenstock.net/2021/07/04/racket-is-an.html"
            ],
            "published": [
              "2021-07-04 12:40:45 +0100"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "content": [
              {
                "html": "<p><a href=\"https://mishka.codes/\">Mishka Orakzai</a> is the founder of <a href=\"https://www.thiscodeworks.com/\">thiscodeWorks</a>, a Pinterest-inspired website for developers to share snippets of code. Lately, <a href=\"https://interintellect.com/salon/its-time-to-code/\">she hosted an Interintellect salon about coding</a> to discuss the strong push towards learning to code. That coding literacy movement includes, for example, coding boot camps and events like <a href=\"https://hourofcode.com/\">Hour of Code</a>. In our conversation at the salon, we took a step back first and tried to establish the meaning of coding literacy.</p>\n\n<p>One way to describe coding literacy is thinking of it as a spectrum, with <a href=\"https://lukasrosenstock.net/2020/05/06/there-is-a.html\">no-code</a> being the low floor and advanced software engineering the high ceiling. The first and foremost goal is to demystify computing and develop a judgment of what’s even possible. Also, coding is a way of thinking, which I like to describe as algorithmic (or computational) thinking: being specific enough in your instructions to a dumb machine. Computers are deterministic and cannot understand ambiguity like humans. It’s possible to establish this mindset with a bit of self-taught coding without becoming a developer yourself. One participant mentioned he’s doing a “coder dojo” with his 10- and 12-year old kids. Even “toy programming” (think <a href=\"https://www.roblox.com/\">Roblox</a> and <a href=\"https://scratch.mit.edu/\">Scratch</a>) is still “real programming”, which makes it exciting, especially compared to other forms of building.</p>\n\n<p>We talked about the education system as well. Compared to other subjects, high school computer science is relatively young, and the way it’s taught isn’t always good and sometimes doesn’t even cover coding. It may explain why few kids are excited about coding. On the other hand, maybe we’re expecting too much. Most children learn to pass tests and not because they’re passionate about every subject and want to continue learning in their free time. And nobody should feel guilty about not wanting to code. A more project-based way of teaching could improve education, though.</p>\n\n<p>What’s the benefit of coding? Is the coding literacy movement’s purpose solely filling the demands of the growing tech sector? While that’s possibly true, coding can have additional benefits even when you don’t become a developer. For example, people in marketing can benefit from HTML knowledge. Again, the way of thinking can help in various ways. In the API sector, which is my primary field of work, there’s a lot of conversation about making the technical capabilities of APIs accessible to non-developers and more mainstream (lovely quote: “business developers are developers, too”). These capabilities can go beyond what the API provider intended. Coding can be a creative tool to unlock new possibilities (think of using a cup as a paperweight instead of a cup). However, it’s not the only one.</p>\n\n<p>People like to have a creative outlet. It can be coding, sometimes it’s something else like homemaking, and for others, it’s creating TikTok videos. Sometimes we tend to think that previous generations were more creative, and our modern devices (like the iPad) are primarily consumption machines. For us nerds, it’s often <a href=\"https://lukasrosenstock.net/2021/05/29/interintellect-member-dominic.html\">the nostalgia of 90s websites</a>. It’s important to remember, though, that in any community, it’s always few who create for a majority of consumers (look at <a href=\"https://www.nngroup.com/articles/participation-inequality/\">the 90-9-1 rule</a>). We believe that coding is an excellent outlet for creative building because you don’t need physical tools and material, driving the marginal costs to zero. That makes it accessible. Builders can avert the downside of non-tangible results with hybrid forms where digital things manifest physically, for example, through 3D printing.</p>\n\n<p>Going beyond coding, Mishka had <a href=\"https://a16z.com/2020/04/18/its-time-to-build/\">Marc Andreesen’s article “It’s time to build”</a> on her reading list for the salon. Andreesen complains about a lack of desire to build stuff to solve problems in the world. We believe that there’s certain laziness and comfort in the Western world, and we make things for sufficiency rather than resilience. COVID-19 was a good wake-up call. Countries like Israel who are in a perpetual crisis mode were more capable of handling the pandemic than the West who’s invested in the good-enough status quo. Some people may have thought of themselves and their country as limited in the developing world, but remote work, often including coding, helps them grow out of that.</p>\n\n<p>At the end of the salon, we discussed whether coding would remain an in-demand skill. We believe that digital transformation will change everything. No-code automation may make coding less critical, but related roles like user experience or management are growing. With artificially intelligent systems, new skills will become necessary. One participant described coming up with good prompts for <a href=\"https://openai.com/blog/gpt-3-apps/\">GPT-3</a> as a coding-adjacent skill but more like writing magic spells. Interdisciplinary thinking becomes increasingly important, and the mindset learned through coding can help combine things and assist in learning other skills.</p>\n\n<p>In summary, coding remains an excellent skill to have, but it’s not the most critical skill. Building the future is more than building apps. However, the coding literacy movement could provide a good blueprint for other fields to teach their skillset to a broader public.</p>",
                "value": "Mishka Orakzai is the founder of thiscodeWorks, a Pinterest-inspired website for developers to share snippets of code. Lately, she hosted an Interintellect salon about coding to discuss the strong push towards learning to code. That coding literacy movement includes, for example, coding boot camps and events like Hour of Code. In our conversation at the salon, we took a step back first and tried to establish the meaning of coding literacy.\n\nOne way to describe coding literacy is thinking of it as a spectrum, with no-code being the low floor and advanced software engineering the high ceiling. The first and foremost goal is to demystify computing and develop a judgment of what’s even possible. Also, coding is a way of thinking, which I like to describe as algorithmic (or computational) thinking: being specific enough in your instructions to a dumb machine. Computers are deterministic and cannot understand ambiguity like humans. It’s possible to establish this mindset with a bit of self-taught coding without becoming a developer yourself. One participant mentioned he’s doing a “coder dojo” with his 10- and 12-year old kids. Even “toy programming” (think Roblox and Scratch) is still “real programming”, which makes it exciting, especially compared to other forms of building.\n\nWe talked about the education system as well. Compared to other subjects, high school computer science is relatively young, and the way it’s taught isn’t always good and sometimes doesn’t even cover coding. It may explain why few kids are excited about coding. On the other hand, maybe we’re expecting too much. Most children learn to pass tests and not because they’re passionate about every subject and want to continue learning in their free time. And nobody should feel guilty about not wanting to code. A more project-based way of teaching could improve education, though.\n\nWhat’s the benefit of coding? Is the coding literacy movement’s purpose solely filling the demands of the growing tech sector? While that’s possibly true, coding can have additional benefits even when you don’t become a developer. For example, people in marketing can benefit from HTML knowledge. Again, the way of thinking can help in various ways. In the API sector, which is my primary field of work, there’s a lot of conversation about making the technical capabilities of APIs accessible to non-developers and more mainstream (lovely quote: “business developers are developers, too”). These capabilities can go beyond what the API provider intended. Coding can be a creative tool to unlock new possibilities (think of using a cup as a paperweight instead of a cup). However, it’s not the only one.\n\nPeople like to have a creative outlet. It can be coding, sometimes it’s something else like homemaking, and for others, it’s creating TikTok videos. Sometimes we tend to think that previous generations were more creative, and our modern devices (like the iPad) are primarily consumption machines. For us nerds, it’s often the nostalgia of 90s websites. It’s important to remember, though, that in any community, it’s always few who create for a majority of consumers (look at the 90-9-1 rule). We believe that coding is an excellent outlet for creative building because you don’t need physical tools and material, driving the marginal costs to zero. That makes it accessible. Builders can avert the downside of non-tangible results with hybrid forms where digital things manifest physically, for example, through 3D printing.\n\nGoing beyond coding, Mishka had Marc Andreesen’s article “It’s time to build” on her reading list for the salon. Andreesen complains about a lack of desire to build stuff to solve problems in the world. We believe that there’s certain laziness and comfort in the Western world, and we make things for sufficiency rather than resilience. COVID-19 was a good wake-up call. Countries like Israel who are in a perpetual crisis mode were more capable of handling the pandemic than the West who’s invested in the good-enough status quo. Some people may have thought of themselves and their country as limited in the developing world, but remote work, often including coding, helps them grow out of that.\n\nAt the end of the salon, we discussed whether coding would remain an in-demand skill. We believe that digital transformation will change everything. No-code automation may make coding less critical, but related roles like user experience or management are growing. With artificially intelligent systems, new skills will become necessary. One participant described coming up with good prompts for GPT-3 as a coding-adjacent skill but more like writing magic spells. Interdisciplinary thinking becomes increasingly important, and the mindset learned through coding can help combine things and assist in learning other skills.\n\nIn summary, coding remains an excellent skill to have, but it’s not the most critical skill. Building the future is more than building apps. However, the coding literacy movement could provide a good blueprint for other fields to teach their skillset to a broader public."
              }
            ],
            "url": [
              "https://lukasrosenstock.net/2021/06/27/mishka-orakzai-is.html"
            ],
            "published": [
              "2021-06-27 11:33:48 +0100"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "content": [
              {
                "html": "<p><a href=\"https://dominicduffin.uk/\">Dominic Duffin</a>’s recent Interintellect salon had the title <a href=\"https://interintellect.com/salon/time-versus-space-the-geographies-of-a-digital-world/\">“Time versus Space: The Geographies of a Digital World”</a>. After <a href=\"https://lukasrosenstock.net/2021/05/29/interintellect-member-dominic.html\">having a good time at Dominic’s previous salon about our spaces on the Internet, which I summarized on my blog</a>, I wanted to participate in this follow-up conversation. Once again, it was a smaller group of participants, which I found astonishing, considering how important the topic is, in my opinion. The pandemic has driven us to spend more time in digital spaces. As the world, or at least parts of it, slowly return to normal, it will be fascinating to observe the next transition.</p>\n\n<p>Before writing about the salon, I want to mention another conversation I recently had with members from different effective altruism local groups in the GSA/DACH region. Group events had moved online with COVID-19, and most members can’t wait to meet in person again. On the other hand, there are certain benefits to virtual meetups. You don’t have to find a space, you save time going there, and it’s much easier to bring in guests and speakers from different places. The theory is that interest-based groups will eventually operate in a hybrid model, with events focused on working and learning happening online and social get-togethers happening offline. We see that happen with Interintellect as well. <a href=\"https://interintellect.com/salons/\">Most topic-based salons and series are still online, and the first IRL meetups are less topic-bound and more social.</a> Since some salons are very niche, it may be hard to find enough interested participants in a single location, and you’d lose the benefits of international exchange.</p>\n\n<p>Now back to Dominic’s salon on virtual geographies. His intro question was: “How relevant are your physical location and your timezone to your online life?” Timezones are the big differentiator and remind us that we don’t live in a single global village but on a round planet, even online. A participant from the US west coast remarked that the big political news of the day has always already happened by the time he wakes up. However, timezones can be an advantage, too, by distributing work shifts around the globe and providing 24/7 support even in a small team with everyone having regular workdays. Big global business used to be 24/7 for a while, and now it seems that it’s happening for all, leaving us to wonder why stock markets still have opening hours.</p>\n\n<p>Even though the salon description used the analogy of a city where many activities happened, interestingly, most of our discussion at the salon focused on <a href=\"https://lukasrosenstock.net/2020/08/12/one-of-my.html\">remote work</a>. The pandemic has accelerated the information age. The upcoming significant difference after remote, on-site, and hybrid work is synchronous versus asynchronous work. Not every company can work in either model, but it can have vast advantages to implement the asynchronous model. <a href=\"https://levels.io/async/\">Pieter Levels described the benefits for individuals in one of his articles</a>, and we talked about hand-off between different timezones, which suits the asynchronous model well. It requires other tools and a distinct skillset, mainly writing. That leads us to the next topic, language.</p>\n\n<p>Regarding languages, a participant from India gave us fascinating insights into their country. India has many local languages, and people are proud and protective of their native tongue. That makes it difficult to establish a shared Indian identity, for example, when the prime minister gives speeches in Hindi, a language that not all of his citizens understand. English is the standard business language in metropolitan cities, but language creates a division outside of them. As India’s relevance as a market for international companies grows, they’re increasingly localizing their products in Indian languages instead of just English.</p>\n\n<p>Culture is another crucial aspect. For those spending a lot of time online, the global Internet culture can override local culture for the individual, especially younger generations. It can also influence local culture in general. Currently, global Internet culture’s strongest influences come from the US, but that’s changing as more people from other countries appear online. That change comes from countries with large English-speaking populations, though, like India and Nigeria. So far, we don’t see any attempts from China to push Chinese culture into global culture. They appear more focused on isolating themselves.</p>\n\n<p>Is the Internet a single digital megacity or multiple cities? While there are overlapping spheres, filter bubbles are a real thing. The Internet influences what happens offline, for example, when a Facebook post causes people to form violent mobs in the real world. The division itself isn’t an online thing, though. In the US, self-division happens, and people choose to live in either conservative or liberal areas. How important is it to have diversity, though? Just bringing in different people is not sufficient. They also have to be willing to listen to each other. Something you always have to be aware of is that the loudest voices aren’t necessarily representative.</p>\n\n<p>Later in the salon, we went back to COVID-19 and how it will change things. <a href=\"https://lukasrosenstock.net/2020/03/16/the-new-coronavirus.html\">We believe that the “genie is out of the bottle” for remote work, and nobody can put it back in</a>. There will be more options and more flexibility. However, remote work may affect those who can’t work remotely as well. If white-collar work happens remotely within the same organization, whereas blue-collar work happens on-site, it can create a divide between these groups. However, if we’re honest, often this divide already exists. Outside of work, we believe that arts and culture will go back to taking place in the real world, but movie theaters may no longer be the only place for the first screening of a new movie.</p>\n\n<p>One participant mentioned that he wouldn’t have joined Interintellect salons offline. The online events allow for a broader range of backgrounds and viewpoints, and some conversations and connections probably wouldn’t have happened outside the Internet. However, there is still some division between digital natives and those who feel less comfortable using digital technologies.</p>\n\n<p>At the end of the salon, we briefly mentioned relevant topics that we didn’t touch. Remote worker compensation and digital tools in government are just two of them. Maybe Dominic will host another salon for them. For now, he has planned <a href=\"https://interintellect.com/salon/digital-collectibles-ownership-and-scarcity-infinity-and-ephemerality/\">“Digital Collectibles: Ownership and Scarcity; Infinity and Ephemerality?”</a>.</p>",
                "value": "Dominic Duffin’s recent Interintellect salon had the title “Time versus Space: The Geographies of a Digital World”. After having a good time at Dominic’s previous salon about our spaces on the Internet, which I summarized on my blog, I wanted to participate in this follow-up conversation. Once again, it was a smaller group of participants, which I found astonishing, considering how important the topic is, in my opinion. The pandemic has driven us to spend more time in digital spaces. As the world, or at least parts of it, slowly return to normal, it will be fascinating to observe the next transition.\n\nBefore writing about the salon, I want to mention another conversation I recently had with members from different effective altruism local groups in the GSA/DACH region. Group events had moved online with COVID-19, and most members can’t wait to meet in person again. On the other hand, there are certain benefits to virtual meetups. You don’t have to find a space, you save time going there, and it’s much easier to bring in guests and speakers from different places. The theory is that interest-based groups will eventually operate in a hybrid model, with events focused on working and learning happening online and social get-togethers happening offline. We see that happen with Interintellect as well. Most topic-based salons and series are still online, and the first IRL meetups are less topic-bound and more social. Since some salons are very niche, it may be hard to find enough interested participants in a single location, and you’d lose the benefits of international exchange.\n\nNow back to Dominic’s salon on virtual geographies. His intro question was: “How relevant are your physical location and your timezone to your online life?” Timezones are the big differentiator and remind us that we don’t live in a single global village but on a round planet, even online. A participant from the US west coast remarked that the big political news of the day has always already happened by the time he wakes up. However, timezones can be an advantage, too, by distributing work shifts around the globe and providing 24/7 support even in a small team with everyone having regular workdays. Big global business used to be 24/7 for a while, and now it seems that it’s happening for all, leaving us to wonder why stock markets still have opening hours.\n\nEven though the salon description used the analogy of a city where many activities happened, interestingly, most of our discussion at the salon focused on remote work. The pandemic has accelerated the information age. The upcoming significant difference after remote, on-site, and hybrid work is synchronous versus asynchronous work. Not every company can work in either model, but it can have vast advantages to implement the asynchronous model. Pieter Levels described the benefits for individuals in one of his articles, and we talked about hand-off between different timezones, which suits the asynchronous model well. It requires other tools and a distinct skillset, mainly writing. That leads us to the next topic, language.\n\nRegarding languages, a participant from India gave us fascinating insights into their country. India has many local languages, and people are proud and protective of their native tongue. That makes it difficult to establish a shared Indian identity, for example, when the prime minister gives speeches in Hindi, a language that not all of his citizens understand. English is the standard business language in metropolitan cities, but language creates a division outside of them. As India’s relevance as a market for international companies grows, they’re increasingly localizing their products in Indian languages instead of just English.\n\nCulture is another crucial aspect. For those spending a lot of time online, the global Internet culture can override local culture for the individual, especially younger generations. It can also influence local culture in general. Currently, global Internet culture’s strongest influences come from the US, but that’s changing as more people from other countries appear online. That change comes from countries with large English-speaking populations, though, like India and Nigeria. So far, we don’t see any attempts from China to push Chinese culture into global culture. They appear more focused on isolating themselves.\n\nIs the Internet a single digital megacity or multiple cities? While there are overlapping spheres, filter bubbles are a real thing. The Internet influences what happens offline, for example, when a Facebook post causes people to form violent mobs in the real world. The division itself isn’t an online thing, though. In the US, self-division happens, and people choose to live in either conservative or liberal areas. How important is it to have diversity, though? Just bringing in different people is not sufficient. They also have to be willing to listen to each other. Something you always have to be aware of is that the loudest voices aren’t necessarily representative.\n\nLater in the salon, we went back to COVID-19 and how it will change things. We believe that the “genie is out of the bottle” for remote work, and nobody can put it back in. There will be more options and more flexibility. However, remote work may affect those who can’t work remotely as well. If white-collar work happens remotely within the same organization, whereas blue-collar work happens on-site, it can create a divide between these groups. However, if we’re honest, often this divide already exists. Outside of work, we believe that arts and culture will go back to taking place in the real world, but movie theaters may no longer be the only place for the first screening of a new movie.\n\nOne participant mentioned that he wouldn’t have joined Interintellect salons offline. The online events allow for a broader range of backgrounds and viewpoints, and some conversations and connections probably wouldn’t have happened outside the Internet. However, there is still some division between digital natives and those who feel less comfortable using digital technologies.\n\nAt the end of the salon, we briefly mentioned relevant topics that we didn’t touch. Remote worker compensation and digital tools in government are just two of them. Maybe Dominic will host another salon for them. For now, he has planned “Digital Collectibles: Ownership and Scarcity; Infinity and Ephemerality?”."
              }
            ],
            "url": [
              "https://lukasrosenstock.net/2021/06/26/dominic-duffins-recent.html"
            ],
            "published": [
              "2021-06-26 13:51:55 +0100"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "content": [
              {
                "html": "<p>Browsers restrict API requests to the same origin domain. CORS, or cross-origin-resource-sharing, is a method to overcome this restriction in a well-defined manner. If you’re on the receiving end of a CORS request, or, in other words, if you want your API to receive requests from different origins, you need to configure CORS in your web application framework. Assuming your framework is Laravel, you can read my introduction piece, <a href=\"https://www.stackhawk.com/blog/laravel-cors\">“Laravel CORS Guide: What It Is and How to Enable It”</a>, which I wrote as a guest post for the <a href=\"https://www.stackhawk.com/\">StackHawk</a> blog (my first for them!). In it, I cover what CORS is, whether you need it, whether Laravel is the right place to control it (e.g., instead of a reverse proxy), and where to enable it in different versions of the framework. My emphasis is on minimizing the exposed surface. <a href=\"https://www.stackhawk.com/blog/laravel-cors\">Check out the article now.</a></p>\n\n<p><em>Disclosure: This work was paid for by StackHawk.</em></p>",
                "value": "Browsers restrict API requests to the same origin domain. CORS, or cross-origin-resource-sharing, is a method to overcome this restriction in a well-defined manner. If you’re on the receiving end of a CORS request, or, in other words, if you want your API to receive requests from different origins, you need to configure CORS in your web application framework. Assuming your framework is Laravel, you can read my introduction piece, “Laravel CORS Guide: What It Is and How to Enable It”, which I wrote as a guest post for the StackHawk blog (my first for them!). In it, I cover what CORS is, whether you need it, whether Laravel is the right place to control it (e.g., instead of a reverse proxy), and where to enable it in different versions of the framework. My emphasis is on minimizing the exposed surface. Check out the article now.\n\nDisclosure: This work was paid for by StackHawk."
              }
            ],
            "url": [
              "https://lukasrosenstock.net/2021/06/20/browsers-restrict-api.html"
            ],
            "published": [
              "2021-06-20 12:20:06 +0100"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "content": [
              {
                "html": "<p>Interintellect member <a href=\"https://dominicduffin.uk/\">Dominic Duffin</a> hosted his first salon. The topic was <a href=\"https://interintellect.com/event/our-spaces-on-the-internet-personal-websites-and-social-media-2/\">“Our Spaces on the Internet: Personal Websites and Social Media”</a>. I was curious about this discussion, considering my engagement in various social networking apps, communities, and the <a href=\"https://indieweb.org/\">IndieWeb</a>. We started the salon, one of the smaller ones, by sharing our online spaces. Some of us had websites. Others were active social media users, and some just curious.</p>\n\n<p>Within the group, there seemed to be a trend towards a unification of our online identity. One participant mentioned two websites, another had three Twitter accounts, but they want to combine them. I’m not sure if this trend is general, but people are willing to show a more holistic image instead of limiting them to one aspect. Undoubtedly, the Interintellect, with its emphasis on multifaceted people and interdisciplinary thinking, is to blame.</p>\n\n<p>However, the ability to bring your whole self to the Internet is a privilege and depends on your risk budget. For example, you need to decide whether or not to show less proud parts of your past. There is a cultural difference in how much, for example, employers are will to accept. Also, you’re less likely to experience adverse effects from your non-professional online activities in an in-demand industry.</p>\n\n<p>In other parts, the online presence became more sanitized, more corporate, with people trying to establish a professional identity. That is in stark contrast with the Internet of the 90ies which was a wild west that had no professional aspects for most people. Of course, people still build purely personal websites, but they are comparatively rare. Enormous social media companies, now turned cultural forces, drove standardization of online representation. However, can Facebook and Instagram represent us? And should Silicon Valley have that much power?</p>\n\n<p>The IndieWeb and decentralized social networks like <a href=\"https://joinmastodon.org/\">Mastodon</a> can be a solution. However, it’s almost impossible to avoid mainstream social media in some professions and industries, so you have to use them even if you don’t love them. And there’s value in them for networking because they provide additional context compared to, let’s say, a cold email when reaching out to people. Next, you can leverage these networks and funnel your audience into a place you control. The IndieWeb community, for example, promotes <a href=\"https://indieweb.org/POSSE\">POSSE</a>: Publish On (Your) Own Site, Syndicate Elsewhere.</p>\n\n<p>When it comes to the spaces under our control, we talked about building websites that are fun to explore and feel like the person they represent but are still cohesive. It’s nice to put some fun elements and show off what you can do. However, that begs the question of how website building skills create a divide between those who have them and the rest. Hiring a developer doesn’t seem to have a good track record. Doing it yourself using no-code tools like Squarespace and WordPress seems to be better. It’s also crucial to only build what you can maintain. Otherwise, your website becomes stale.</p>\n\n<p>Our personal spaces also suffer from decreasing attention spans and instant gratification from social media. Asking our audiences to jump from a social media app to our websites can already be too much friction. That’s an unsolved problem.</p>\n\n<p>Finally, we talked about real names and pseudonyms. The loss of pseudo-anonymity has been a massive issue with the expectation of using real names online in public spaces. That’s why the <a href=\"https://maggieappleton.com/cozy-web\">cozy web</a>, the parts of our online lives hidden from the public, is growing as well. To explain the naming shift, I suggested a model of three generations. The first is online-only, a parallel world where the first nerds interacted solely through pseudonyms - from early <a href=\"https://en.wikipedia.org/wiki/Bulletin_board_system\">BBS</a> to <a href=\"https://en.wikipedia.org/wiki/Internet_Relay_Chat\">IRC</a>. The second generation is offline-first, where online spaces primarily represent our offline social circles - think Facebook. The third generation is hybrid communities, where people virtually interact under their real identities and may eventually meet in the real world. Online and offline is no longer a different sphere but just two different modes of interaction.</p>\n\n<p>Dominic may be following up with other salons on related topics, so make sure you <a href=\"https://interintellect.com/\">stay tuned to the Interintellect</a>.</p>",
                "value": "Interintellect member Dominic Duffin hosted his first salon. The topic was “Our Spaces on the Internet: Personal Websites and Social Media”. I was curious about this discussion, considering my engagement in various social networking apps, communities, and the IndieWeb. We started the salon, one of the smaller ones, by sharing our online spaces. Some of us had websites. Others were active social media users, and some just curious.\n\nWithin the group, there seemed to be a trend towards a unification of our online identity. One participant mentioned two websites, another had three Twitter accounts, but they want to combine them. I’m not sure if this trend is general, but people are willing to show a more holistic image instead of limiting them to one aspect. Undoubtedly, the Interintellect, with its emphasis on multifaceted people and interdisciplinary thinking, is to blame.\n\nHowever, the ability to bring your whole self to the Internet is a privilege and depends on your risk budget. For example, you need to decide whether or not to show less proud parts of your past. There is a cultural difference in how much, for example, employers are will to accept. Also, you’re less likely to experience adverse effects from your non-professional online activities in an in-demand industry.\n\nIn other parts, the online presence became more sanitized, more corporate, with people trying to establish a professional identity. That is in stark contrast with the Internet of the 90ies which was a wild west that had no professional aspects for most people. Of course, people still build purely personal websites, but they are comparatively rare. Enormous social media companies, now turned cultural forces, drove standardization of online representation. However, can Facebook and Instagram represent us? And should Silicon Valley have that much power?\n\nThe IndieWeb and decentralized social networks like Mastodon can be a solution. However, it’s almost impossible to avoid mainstream social media in some professions and industries, so you have to use them even if you don’t love them. And there’s value in them for networking because they provide additional context compared to, let’s say, a cold email when reaching out to people. Next, you can leverage these networks and funnel your audience into a place you control. The IndieWeb community, for example, promotes POSSE: Publish On (Your) Own Site, Syndicate Elsewhere.\n\nWhen it comes to the spaces under our control, we talked about building websites that are fun to explore and feel like the person they represent but are still cohesive. It’s nice to put some fun elements and show off what you can do. However, that begs the question of how website building skills create a divide between those who have them and the rest. Hiring a developer doesn’t seem to have a good track record. Doing it yourself using no-code tools like Squarespace and WordPress seems to be better. It’s also crucial to only build what you can maintain. Otherwise, your website becomes stale.\n\nOur personal spaces also suffer from decreasing attention spans and instant gratification from social media. Asking our audiences to jump from a social media app to our websites can already be too much friction. That’s an unsolved problem.\n\nFinally, we talked about real names and pseudonyms. The loss of pseudo-anonymity has been a massive issue with the expectation of using real names online in public spaces. That’s why the cozy web, the parts of our online lives hidden from the public, is growing as well. To explain the naming shift, I suggested a model of three generations. The first is online-only, a parallel world where the first nerds interacted solely through pseudonyms - from early BBS to IRC. The second generation is offline-first, where online spaces primarily represent our offline social circles - think Facebook. The third generation is hybrid communities, where people virtually interact under their real identities and may eventually meet in the real world. Online and offline is no longer a different sphere but just two different modes of interaction.\n\nDominic may be following up with other salons on related topics, so make sure you stay tuned to the Interintellect."
              }
            ],
            "url": [
              "https://lukasrosenstock.net/2021/05/29/interintellect-member-dominic.html"
            ],
            "published": [
              "2021-05-29 16:45:00 +0100"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "content": [
              {
                "html": "<p>It’s time for another update on <a href=\"https://www.manning.com/books/designing-apis-with-swagger-and-openapi\">“Designing APIs with Swagger and OpenAPI”</a>, the upcoming API design book from Manning Publications that I’m writing together with <a href=\"https://twitter.com/jponelat\">Josh Ponelat</a>. Since <a href=\"https://lukasrosenstock.net/2020/09/02/its-time-to.html\">my last update</a>, we’ve made a lot of progress, and we’re near the finish line for the book. We’ve slightly adjusted the table of contents in the previous months and restructured the material into three parts instead of four. While we’re busy working on part three, the second part is now fully published on MEAP (Manning Early Access Program).</p>\n\n<p>At the beginning of the second part, which was part of our previous MEAP release, we introduced a fictional development team and their project. The team decided on an API Design First approach and created their OpenAPI description based on a domain model and user stories. In the remaining chapters of the second part, we’re going on the journey from design to implementation. Our topics range from auto-generating code with OpenAPI to additional crucial issues such as authentication. Throughout, one of our major themes is the workflow for handling API changes to ensure that the OpenAPI description remains the single source of truth upon which every developer can build. Through a great process, frontend and backend developers can work independently, and in the end, their components will still work together.</p>\n\n<p>You can preorder the book <a href=\"https://www.manning.com/books/designing-apis-with-swagger-and-openapi\">“Designing APIs with Swagger and OpenAPI” on Manning’s website</a> now, get immediate access to MEAP and receive a full ebook or physical book later.</p>",
                "value": "It’s time for another update on “Designing APIs with Swagger and OpenAPI”, the upcoming API design book from Manning Publications that I’m writing together with Josh Ponelat. Since my last update, we’ve made a lot of progress, and we’re near the finish line for the book. We’ve slightly adjusted the table of contents in the previous months and restructured the material into three parts instead of four. While we’re busy working on part three, the second part is now fully published on MEAP (Manning Early Access Program).\n\nAt the beginning of the second part, which was part of our previous MEAP release, we introduced a fictional development team and their project. The team decided on an API Design First approach and created their OpenAPI description based on a domain model and user stories. In the remaining chapters of the second part, we’re going on the journey from design to implementation. Our topics range from auto-generating code with OpenAPI to additional crucial issues such as authentication. Throughout, one of our major themes is the workflow for handling API changes to ensure that the OpenAPI description remains the single source of truth upon which every developer can build. Through a great process, frontend and backend developers can work independently, and in the end, their components will still work together.\n\nYou can preorder the book “Designing APIs with Swagger and OpenAPI” on Manning’s website now, get immediate access to MEAP and receive a full ebook or physical book later."
              }
            ],
            "url": [
              "https://lukasrosenstock.net/2021/05/03/its-time-for.html"
            ],
            "published": [
              "2021-05-03 11:12:42 +0100"
            ]
          }
        }
      ]
    }
  ],
  "rels": {
    "stylesheet": [
      "https://fonts.googleapis.com/css?family=Source+Sans+Pro:300,300i,600",
      "https://lukasrosenstock.net/style.css?1659970008",
      "https://lukasrosenstock.net/custom.css?1659970008"
    ],
    "icon": [
      "https://micro.blog/lukas/favicon.png"
    ],
    "shortcut": [
      "https://micro.blog/lukas/favicon.png"
    ],
    "alternate": [
      "https://lukasrosenstock.net/feed.xml",
      "https://lukasrosenstock.net/podcast.xml",
      "https://lukasrosenstock.net/feed.json"
    ],
    "EditURI": [
      "https://lukasrosenstock.net/rsd.xml"
    ],
    "me": [
      "https://micro.blog/lukas",
      "https://twitter.com/LukasRosenstock",
      "https://github.com/lukasros"
    ],
    "authorization_endpoint": [
      "https://micro.blog/indieauth/auth"
    ],
    "token_endpoint": [
      "https://micro.blog/indieauth/token"
    ],
    "micropub": [
      "https://micro.blog/micropub"
    ],
    "microsub": [
      "https://micro.blog/microsub"
    ],
    "webmention": [
      "https://micro.blog/webmention"
    ],
    "subscribe": [
      "https://micro.blog/users/follow"
    ]
  },
  "rel-urls": {
    "https://fonts.googleapis.com/css?family=Source+Sans+Pro:300,300i,600": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://lukasrosenstock.net/style.css?1659970008": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://lukasrosenstock.net/custom.css?1659970008": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://micro.blog/lukas/favicon.png": {
      "rels": [
        "icon",
        "shortcut"
      ],
      "type": "image/x-icon"
    },
    "https://lukasrosenstock.net/feed.xml": {
      "rels": [
        "alternate"
      ],
      "title": "Lukas Rosenstock's Blog",
      "type": "application/rss+xml"
    },
    "https://lukasrosenstock.net/podcast.xml": {
      "rels": [
        "alternate"
      ],
      "title": "Podcast",
      "type": "application/rss+xml"
    },
    "https://lukasrosenstock.net/feed.json": {
      "rels": [
        "alternate"
      ],
      "title": "Lukas Rosenstock's Blog",
      "type": "application/json"
    },
    "https://lukasrosenstock.net/rsd.xml": {
      "rels": [
        "EditURI"
      ],
      "type": "application/rsd+xml"
    },
    "https://micro.blog/lukas": {
      "rels": [
        "me"
      ]
    },
    "https://twitter.com/LukasRosenstock": {
      "rels": [
        "me"
      ]
    },
    "https://github.com/lukasros": {
      "rels": [
        "me"
      ]
    },
    "https://micro.blog/indieauth/auth": {
      "rels": [
        "authorization_endpoint"
      ]
    },
    "https://micro.blog/indieauth/token": {
      "rels": [
        "token_endpoint"
      ]
    },
    "https://micro.blog/micropub": {
      "rels": [
        "micropub"
      ]
    },
    "https://micro.blog/microsub": {
      "rels": [
        "microsub"
      ]
    },
    "https://micro.blog/webmention": {
      "rels": [
        "webmention"
      ]
    },
    "https://micro.blog/users/follow": {
      "rels": [
        "subscribe"
      ]
    }
  }
}