{
  "items": [
    {
      "type": [
        "h-card"
      ],
      "properties": {
        "url": [
          "https://rebelle.micro.blog/"
        ],
        "name": [
          "Rebelle = Love In Action"
        ],
        "note": [
          "Follow @rebelle on Micro.blog."
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "name": [
          ""
        ],
        "summary": [
          "My kind of 5am! Quiet cup of chai + Derek Sivers’ brand new book."
        ],
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://rebelle.micro.blog/"
              ]
            },
            "value": "https://rebelle.micro.blog/"
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "name": [
          "TL;DR is Infuriating*"
        ],
        "summary": [
          "Here’s why.\n\nIf your entire thought stream can be boiled down to a sentence or two, why don’t you make like Derek Sivers, or Seth Godin, and just write a sentence or two? Save us all the trouble, lighten up some server loads, and relieve Mother Earth the burden of cost to support the rest of the junk?\n\nOr be like Mr. Money Mustache, or Colin, who correctly place their short thoughts where they belong: on Twitter. And save their best essays for their blogs. If I came for a Tex Mex smorgasbord and margarita fest, why are you handing me a Fresco bean burrito and pushing me out the door?\n\nIf your entire thought stream can’t be boiled down to a line or two, then I ask this: why are you directing the intelligent human being, who is engaged in reading your writing, straight to the cliff notes section? What presumptions did you make about them? And about your own content?\n\nIf those presumptions are true, do we even need to be here right now?\n\nMost importantly: what human behaviors are you encouraging, by this choice?\n\nAre you shooting for lowest common denominator? Or the highest caliber minds?\n\n#goingmeta\nI would guess it’s a semiotic tribalism key for techie types: used subconsciously by the coders, no-coders, and general geeks.\n\n#goingki\nOn the other hand, it is rather delightful to encounter the semi-colon. Which is a rare species these days in the wilderness of the current internet.\n\nPerhaps that alone explains the popularity of TL;DR!\n\nThat is all.\n\n*Thoughts do not apply to technical reviews, which is the only place I believe TL;DR belongs.\n\n###"
        ],
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://rebelle.micro.blog/"
              ]
            },
            "value": "https://rebelle.micro.blog/"
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "name": [
          "Nina Turner's Grandma: The Three Bones + Two Lynchings"
        ],
        "summary": [
          "In our morning coffee today, my partner shared with me this gutpunching wisdom bomb from Nina Turner’s grandmother. (For those who don’t know, Nina Turner is the burning soul fire of the Bernie campaign.)\n\n#1: The Wish Bone. Holding the vision. “The Dream is the Driver.”\n\n#2: The Jaw Bone. “The courage to Speak Truth to Power.”\n\n#3: Back Bone. None of it matters, unless you have the strength and willpower to stand up for your values.\n\nWatch her 1:11 minute video. Gives me chills.\n\n\n\nTwo black men were lynched this week in California.\n\nRobert Fuller and Malcolm Harsch - #SayTheirNames. Countless more have been murdered by the police.\n\n\n\nTo quote Nina Turner, do we have “the Courage enough, the Hope enough, the Fight enough, the Love enough to do what is necessary?”\n\nDo we, as a country, have The Three Bones?\n\nThank you, Grandma Turner.\n\n###"
        ],
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://rebelle.micro.blog/"
              ]
            },
            "value": "https://rebelle.micro.blog/"
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "name": [
          ""
        ],
        "summary": [
          "Shortlink to Markdown on Micro.blog: help.micro.blog/2017/mark…"
        ],
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://rebelle.micro.blog/"
              ]
            },
            "value": "https://rebelle.micro.blog/"
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "name": [
          "Choosing from a Gazillion Options"
        ],
        "summary": [
          "(aka How to Make Decisions When it Comes to Tech)\n\nThe Internet is exploding, the doors have busted wide open. Thanks to the Makers, the Thinkers, the Creators, and good ol’ Donald Trump, people are awakening to the New Internet. Which resembles greatly, for those of us who were lucky enough to witness the early days, the Old Internet.\n\nIf a friend called me last year and asked, “How do I make a website for my sewing/band/freelance writing career, as quickly and cheaply as possible?” I would have replied with the canned response: “Weebly or Wix. Squarespace if you have a little cash to spare, and more time.”\n\nFast forward to 2020, and those 3 services don’t even come up anymore. People who mention Wordpress to me? I have to hold back the laughter. (I have nothing but respect for the people who developed Wordpress, but nothing but frustration for the plugins, processes… the un-user-friendliness of it all.) But for those of you who don’t live in tech world, do you remember Netscape? AOL? Wordpress is quickly becoming that… a dinosaur. For some perspective, just remember how Tumblr was the hot new thing –x– years ago. Anyone remember Pinterest?\n\nThe truth is, technology has moved light years ahead in the past few years. Very quietly, very lightly, without fanfare. Big Media doesn’t want you to know about it.\n\nThe Maker generation is coming.  And it will be a tidal wave.\n\nBut, I digress! This post is a note-to-self.\n\nHow do you choose, between Landen / Universe / Webflow / Micro.Blog / Substack /etc etc? By the time you read this, some of these platforms may have swept away already. These are FAST MOVING WATERS.\n\nMy answers:\n\n1) Go with your gut.\nIn my experience, it’s rarely wrong. And your gut-brain is smarter than we think.\n(If you don’t know how to tap into your gut, I can show you how to do that here: –z– .)\n\n2) Go with your ethics.\nWho do you want to support? What aligns best, with your beliefs? And most importantly, who aligns best, with your beliefs?\n\nI myself have been caught in the decision quicksand of “which platform??” for months, perhaps years. It’s like the blue jean shopping experience described by –x– . The truth is, almost every solution will cost you between $5 and $20 a month. The truth is, almost every solution can work. The truth is, I probably don’t need the diamond-studded embroidery down the seams and the hidden tag. Or the 10 hours of “storytelling” marketing campaigns about how cool the company is, or how the founders met.\n\nI just need a good pair of blue jeans. Or in this case, a simple, low-noise platform to get my ideas out.\n\nFor me? I’m going with Micro.blog. Because of its ethics. Because of how it came to be. And most importantly, because in this rapidly expanding universe of the interwebs, I keep coming back to Manton Reece, who is a real human being, trying to solve his own problems, and generous enough to share his solutions. I’m choosing to stand in his corner. Can’t wait for his new book to come out!"
        ],
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://rebelle.micro.blog/"
              ]
            },
            "value": "https://rebelle.micro.blog/"
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "name": [
          "Day 4 and 5"
        ],
        "summary": [
          "Day 4: Glory of Certainty.\nI’m sure now that it’s mold.\n\nKnee deep into the study, I spend hours reading all the websites. Toxic black mold. It was all over our bedroom walls. There was a constant puddle of water under our fridge. The bathroom had a leak that was finally repaired the week we left.\n\nSo much moisture, that our kids made a game of drawing with Papa on the sliding glass doors every morning. Condensation art. I thought it was delightful, and we even took videos of the family fun!\n\nOh how different things look, in the rear view mirror…\n\nBut we feel pretty good. We take a bus to a huge park with a killer playground, and the kids have a fantastic time.\n\nWe come home, I take a long nap, and wake up to a home-cooked dinner and we all watch the first half of Lord of the Rings.\n\nI fail the VCS vision test. My love, he passes it. Easily. Does that mean I’m just as toxified, and just not showing it?\n\n—\n\nDay 5: Ughh… Reality.\nI wake up, feeling terrible. Too much sleep? The late-night dinner?\n\nMy morning symptoms:\n-feeling puffy in the face\n-tightened jaw, hard to unclench\n-breathing is shallow\n-lymph nodes are sore\n-awareness is floaty and scattered\n-woozy balance\n-eyes are gluey\n\nI suspect:\n-the pillows, since I slept on the other side of the bed as usual\n-the wheat-based noodles I ate\n-the just-unpacked belongings and clothing are carrying spores\n-it’s part of the detoxing process?\n\nI smell an unusual, unpleasant scent that might be the mold, what they talk about online. Wet sock smell.\n\nAll I want is to go sit in the sunshine. I can’t think, I can’t plan, I can’t do. Only go, and exist in the sun.\n\nReality is setting in. We’re in this for the long haul. A complete transformation in how we live. Not just him, but all of us.\n\nHow far are we willing to go, to heal?\n\nHow much life change can a family of 5 undergo in a year? What more will life ask of us now?"
        ],
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://rebelle.micro.blog/"
              ]
            },
            "value": "https://rebelle.micro.blog/"
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "name": [
          "Day 0, and the First 3 Days"
        ],
        "summary": [
          "As remembered, from the 4th day…\n\nDay 0: Not Again.\nMy partner, my love, returned from Uruguay a mess. Again. He loves it there, he feels so good in the small town environment. In nature.\n\nBut man is he sick. Just like last time.\n\nHe texted me while he was there, something like “Why does the energy always feel so heavy here, like I’m doing something terrible, when I’m trying my best to do right, and spread love?\n\nHe’s there to gather our belongings. And pay bills. Two weeks ago, he went to close up our café. One of the worst life experiences we’ve survived together - a story that I sense will unfold here as the healing continues.\n\nAll that matters to me, is that he gets better. Flu AGAIN, for about the 7th time in one winter, just doesn’t make sense. Not for someone who eats maracuya as a snack, amaranth oatmeal for breakfast and never once misses a morning yoga routine.\n\nAnd my little girl. She doesn’t look right. Cytokines, a word I started associating with her under-eye circles. She had this look when we were in Uruguay, especially at her worst. Too many bananas, and bronchitis. But her spirits are high, she has no cough. Just grabbier and needier than usual.\n\n\n\nDay 1: Holy. Shit.\nHe’s so sick, I decided to look up allergies. A good friend, a vegan mama, told us it was the sycamore trees. Is that what’s wreaking havoc on his system? He’s had allergies most of his life, but since we met they’ve been really mild every early spring. He barely even took a Claritin the past few years.\n\nI decide that sycamore, while certainly possible, hardly sounds like the lump of devastation that is currently laid out on the futon, unable to move. I look up mold again, because that’s the only other allergy I’m aware of.\n\nThe first 30 minutes, I’m reading page after page of how it’s really harmless. How to clean it up with vinegar.\n\nAnd then… a different hit. The word “biotoxin” catches my attention. Not usually one for conspiracy theories, but this page looks legit. Could this be real?!\n\nIt takes me about 3 minutes to realize that his symptoms align perfectly with the description on this site. The entire path of it. How he’s gotten progressively worse, with each exposure to the moldy apartment we lived in for 4 months.\n\nHe insists it’s the flu. I tell him, maybe… but we should know in another day or so because if it’s flu, one of us is guaranteed to get it.\n\nDay 2: Feeling Better!\nMy love is feeling better this morning, and I am relieved. Taking care of 3 kids on your own is pretty much impossible, for someone like me. We decide to walk to Belgrano with the babies, and buy some basic Chinese groceries so we can start cooking more at home. Soy sauce, tofu, hot chili oil… just the essentials. And pick up a fresh juice on the way back.\n\nWe make it there, and totally crash on the way back. Should have taken a cab.\n\nDay 3: Bed and TV.\nTotally useless day. He overdid it. Kids watch tv. Netflix, to be more specific. All food is take out!"
        ],
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://rebelle.micro.blog/"
              ]
            },
            "value": "https://rebelle.micro.blog/"
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "name": [
          "Anticipated Format"
        ],
        "summary": [
          "I’m kind of walking into this blind, so please forgive any tweaks and turns, in advance.\n\nI’m planning to post reflections and stories as I can. Real life experiences from the past few months, as they hit me.\n\nMoving forward, I hope to post a daily log of:\n\n\nAn update of how I’m doing.\nAn update of how family members are doing.\nCuriosities/suspicions, experiments, and new discoveries/findings.\n\n\nI am guessing food and rest will play a big part."
        ],
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://rebelle.micro.blog/"
              ]
            },
            "value": "https://rebelle.micro.blog/"
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "name": [
          "Mold Chose Me"
        ],
        "summary": [
          "This is not a life path I would ever have imagined. Or one I would wish upon anyone else. But it seems somehow, bizarrely, fitting. And it seems to complete a full circle.\n\nI am writing today from Buenos Aires, in a state of shock.\n\nIt has been 8 months since we officially started our journey of slow traveling and world schooling. We started in Uruguay, from an intuitive hit that opened up the possibility of slow travel.\n\nOur family had just survived a tough Colorado winter, my little girl and I sick with swollen, chronically dry lips that took all the pleasure out of eating and speaking. I was longing for a tropical, warm climate. On a whim, I went to the Earthship Global site and discovered they were launching their next training in Uruguay, which was one of our top 5 selections of places to study.\n\nWe talked it over for a week or so, before deciding to just jump in. Our next few months of life would be filled with twists and turns, beyond any curveballs I could ever have imagined. I hope to slowly share some of the misadventures over the course of the next month.\n\nBut coming back to the topic at hand… today, September 22, 2019, we are 3 days into the realization that we have been living in toxic mold for the past 4 months. And woozy from what that means for our lives now, and the radical life-180, the single-minded dedication it will require to heal ourselves now.\n\nLast month, before any of this, I happened to sign up for a 40 day workshop to write a book. I thought I’d be writing a collection of world travel tips for teens & college students. (I’ve been traveling internationally by myself since I was 5.)\n\nBut falling right in line with the theme of hidden surprises, that book will have to wait. All the ideas, all the projects, have taken a back seat. This one topic is suddenly the only priority in my life.\n\nHEALING TOXIC MOLD. As John Cusack would say, straight to the top. With a bullet.\n\nThe health of my family. Nothing else matters."
        ],
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://rebelle.micro.blog/"
              ]
            },
            "value": "https://rebelle.micro.blog/"
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "name": [
          "190614.recalibration.buenosaires"
        ],
        "summary": [
          "Recalibration.\n\nWhere am I?\nHow did I get here?\n\nSitting in a $50 hotel reddish room in Buenos Aires, supported by 2 Buddha head pillows… digesting my first full meal in days. A few minutes earlier, heard the worst “splat” sound imaginable when baby fell heavily, with all his intention (as he does) straight on his belly, nose and forehead. Whole body splat.\n\nRemember, I am living the dream life. It doesn’t feel quite like it.\nYet."
        ],
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://rebelle.micro.blog/"
              ]
            },
            "value": "https://rebelle.micro.blog/"
          }
        ]
      }
    }
  ],
  "rels": {
    "alternate": [
      "https://rebelle.micro.blog/feed.xml",
      "https://rebelle.micro.blog/podcast.xml",
      "https://rebelle.micro.blog/feed.json"
    ],
    "EditURI": [
      "https://rebelle.micro.blog/rsd.xml"
    ],
    "stylesheet": [
      "https://rebelle.micro.blog/assets/css/normalize.css?0",
      "https://rebelle.micro.blog/assets/css/icons.css?0",
      "https://rebelle.micro.blog/assets/css/screen.css?0",
      "https://rebelle.micro.blog/custom.css?0",
      "https://fonts.googleapis.com/css?family=Bree+Serif|Lato:100,100i,300,300i,400,400i,700,700i|Source+Code+Pro:300,400,500,700",
      "https://rebelle.micro.blog/assets/bigfoot/dist/bigfoot-number.css"
    ],
    "me": [
      "https://micro.blog/rebelle"
    ],
    "authorization_endpoint": [
      "https://micro.blog/indieauth/auth"
    ],
    "token_endpoint": [
      "https://micro.blog/indieauth/token"
    ],
    "micropub": [
      "https://micro.blog/micropub"
    ],
    "microsub": [
      "https://micro.blog/microsub"
    ],
    "webmention": [
      "https://micro.blog/webmention"
    ],
    "subscribe": [
      "https://micro.blog/users/follow"
    ]
  },
  "rel-urls": {
    "https://rebelle.micro.blog/feed.xml": {
      "rels": [
        "alternate"
      ],
      "title": "Rebelle = Love In Action",
      "type": "application/rss+xml"
    },
    "https://rebelle.micro.blog/podcast.xml": {
      "rels": [
        "alternate"
      ],
      "title": "Podcast",
      "type": "application/rss+xml"
    },
    "https://rebelle.micro.blog/feed.json": {
      "rels": [
        "alternate"
      ],
      "title": "Rebelle = Love In Action",
      "type": "application/json"
    },
    "https://rebelle.micro.blog/rsd.xml": {
      "rels": [
        "EditURI"
      ],
      "type": "application/rsd+xml"
    },
    "https://rebelle.micro.blog/assets/css/normalize.css?0": {
      "rels": [
        "stylesheet"
      ],
      "type": "text/css"
    },
    "https://rebelle.micro.blog/assets/css/icons.css?0": {
      "rels": [
        "stylesheet"
      ],
      "type": "text/css"
    },
    "https://rebelle.micro.blog/assets/css/screen.css?0": {
      "rels": [
        "stylesheet"
      ],
      "type": "text/css"
    },
    "https://rebelle.micro.blog/custom.css?0": {
      "rels": [
        "stylesheet"
      ],
      "type": "text/css"
    },
    "https://micro.blog/rebelle": {
      "rels": [
        "me"
      ]
    },
    "https://micro.blog/indieauth/auth": {
      "rels": [
        "authorization_endpoint"
      ]
    },
    "https://micro.blog/indieauth/token": {
      "rels": [
        "token_endpoint"
      ]
    },
    "https://micro.blog/micropub": {
      "rels": [
        "micropub"
      ]
    },
    "https://micro.blog/microsub": {
      "rels": [
        "microsub"
      ]
    },
    "https://micro.blog/webmention": {
      "rels": [
        "webmention"
      ]
    },
    "https://micro.blog/users/follow": {
      "rels": [
        "subscribe"
      ]
    },
    "https://fonts.googleapis.com/css?family=Bree+Serif|Lato:100,100i,300,300i,400,400i,700,700i|Source+Code+Pro:300,400,500,700": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://rebelle.micro.blog/assets/bigfoot/dist/bigfoot-number.css": {
      "rels": [
        "stylesheet"
      ],
      "type": "text/css"
    }
  }
}