{
  "items": [
    {
      "type": [
        "h-card"
      ],
      "properties": {
        "url": [
          "https://werd.io/profile/benwerd",
          "https://werd.io/profile/benwerd",
          "https://github.com/benwerd",
          "https://www.linkedin.com/in/benwerd",
          "https://werd.social/@ben",
          "https://19thnews.org/"
        ],
        "photo": [
          "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
        ],
        "profile": [
          "Ben Werdmuller"
        ],
        "name": [
          "Ben Werdmuller"
        ],
        "note": [
          {
            "html": "<div class=\"highlightedText\">\n<p>CTO at The 19th. Writing a novel.<br>Previously: Co-founder of Elgg and Known; former investor at Matter.<br><br></p>\n</div>",
            "value": "CTO at The 19th. Writing a novel.Previously: Co-founder of Elgg and Known; former investor at Matter."
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "cPanel is such an awful piece of software that I think it may be holding the entirety of the independent web back."
        ],
        "content": [
          {
            "html": "cPanel is such an awful piece of software that I think it may be holding the entirety of the independent web back.",
            "value": "cPanel is such an awful piece of software that I think it may be holding the entirety of the independent web back."
          }
        ],
        "url": [
          "https://werd.io/2023/cpanel-is-such-an-awful-piece-of"
        ],
        "published": [
          "2023-01-01T00:43:45+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "It's such a Windows ME thing to do, but I've set my desktop to rotate through pictures of my mother every 30 minutes, and I love it. Every time I quit an application or lock my computer I see a photo that makes me happy. Highly recommended."
        ],
        "content": [
          {
            "html": "It's such a Windows ME thing to do, but I've set my desktop to rotate through pictures of my mother every 30 minutes, and I love it. Every time I quit an application or lock my computer I see a photo that makes me happy. Highly recommended.",
            "value": "It's such a Windows ME thing to do, but I've set my desktop to rotate through pictures of my mother every 30 minutes, and I love it. Every time I quit an application or lock my computer I see a photo that makes me happy. Highly recommended."
          }
        ],
        "url": [
          "https://werd.io/2022/it039s-such-a-windows-me-thing-to"
        ],
        "published": [
          "2022-12-31T20:35:20+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "My targeted ads over on corporate media:\n\n- A $1000+ coffee machine that likely makes coffee like a $100 machine\n- Crypto miners\n- Ebooks about how to hustle\n- T-shirts that turn your \"man boobs\" into pecs\n- Endless fintech\n\nYou know you've made a wrong turn when ..."
        ],
        "content": [
          {
            "html": "My targeted ads over on corporate media:<br>\n<br>\n- A $1000+ coffee machine that likely makes coffee like a $100 machine<br>\n- Crypto miners<br>\n- Ebooks about how to hustle<br>\n- T-shirts that turn your \"man boobs\" into pecs<br>\n- Endless fintech<br>\n<br>\nYou know you've made a wrong turn when ...",
            "value": "My targeted ads over on corporate media:\n\n- A $1000+ coffee machine that likely makes coffee like a $100 machine\n- Crypto miners\n- Ebooks about how to hustle\n- T-shirts that turn your \"man boobs\" into pecs\n- Endless fintech\n\nYou know you've made a wrong turn when ..."
          }
        ],
        "url": [
          "https://werd.io/2022/my-targeted-ads-over-on-corporate-media"
        ],
        "published": [
          "2022-12-31T20:20:03+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "What I'm leaving behind in 2022"
        ],
        "content": [
          {
            "html": "<p><img src=\"https://werd.io/file/63b084ad33f1bd5c4c04dae2/thumb.jpg\" alt=\"The author and his baby in front of the Liberty Bell, with Independence Hall behind them.\" width=\"1024\" height=\"768\"></p>\n<p>As part of <a href=\"https://19thnews.org/\">The 19th’s</a> non-denominational end-of-year celebration, we were asked what we were leaving behind in 2022. I gave an answer about corporate social media and Instagram in particular, but on reflection, there’s a lot more I want to leave behind.</p>\n<p>Year ends are both arbitrary and not: a day like any other, but also, genuinely the end of our calendar and the verge of a start to a new blank page. So in that spirit of reflection and new beginnings, these are the things I’d like to leave behind as 2022 disappears behind us.</p>\n<p>If you’re looking for an overarching theme: my aim is to become more values-led and to do a better job of standing up for what I believe in, which is somewhere I’ve sometimes been severely lacking.</p>\n<p><strong>Corporate social media (and Instagram in particular)</strong></p>\n<p>I really do want to do this, and soon. Leaving Twitter was a complete success for me: I found a much richer community in the fediverse. It certainly has some major problems to sort out, most notably that amateur instance-owners often don’t have a working understanding of social power dynamics and what racism, homophobia, and misogyny really <em>are</em>. I can’t gloss over those. But these feel surmountable, and conversations I’ve had with folks who may be starting instances in the new year make me feel hopeful. (For one thing, instances can be owned by the communities they support, which is clearly not the case for any large-scale corporate social media silo.)</p>\n<p>Instagram and Facebook, maybe ironically, are my last big hold-outs. I was never a big user until I moved to the US when they became the main way I keep in touch with my friends back in Britain, and my family all over the world. But of course, that’s the gameplan: Facebook and Instagram are collectively the world’s largest peer pressure engine. And given the company’s complicity in undermining elections, facilitating genocides, algorithmically causing teen suicides, and potentially much more, I don’t want to participate anymore. Not with random pictures about my day; certainly not with pictures of my baby.</p>\n<p>I’ve tried to leave several times, but I missed the community - which, to be specific, is the people I love but rarely get to see. But this year has been different, and I have a lot of hope for <a href=\"https://pixelfed.org/\">Pixelfed</a> alongside <a href=\"https://werd.social/@ben\">Mastodon</a> as ways to stay in touch without feeding the beast. (I don’t think either platform will be the final form of the fediverse, by the way, but I think they’re good enough to get going with.) Obviously, I think all of you <a href=\"https://getblogging.org/\">should start blogs</a>, too, but I understand that the barrier to entry is much higher, and not everyone thinks it’s fun to sit in front of their computer and write (or read) reflective essays.</p>\n<p>So in 2023, I’ll keep sharing on social media, but I’ll do it on my terms, in a way that doesn’t add to the profits or network effects of a company I despise.</p>\n<p>And no, the answer isn’t corporate alternatives like <a href=\"https://post.news/\">Post</a>. It’s a nonsense solution built for people who don’t want to be challenged and I won’t engage any longer.</p>\n<p><strong>Helplessness</strong></p>\n<p>I don’t exactly know how to headline this section, but this is the big one. It could easily be called “unassertiveness” or “acquiescence”, but those ideas don’t quite cover it. They’re right, but they’re a subset of the whole.</p>\n<p>A lot of people have to deal with a lot of things. I’ve been lucky in my life and I’m aware that I live with a lot of privilege. But I’ve also found the last few years to be very challenging personally.</p>\n<p>In lots of ways, I’m still dealing with the loss of my mother. Her loss in itself is a crater. We cared for her for over a decade, through pulmonary fibrosis, a double lung transplant, and an intense aftermath brought about by drugs that both kept her alive and slowly killed her. I uprooted my life and moved thousands of miles to be with her. I still have flashbacks to the day of her transplant and lots beyond; she endured torture after torture after torture because, in her words, she wasn’t ready to leave us.</p>\n<p>I used to cry and express emotion freely. I haven’t been able to do that since. Part of me is still numb; a lot of me is still grieving and adapting.</p>\n<p>Before all that, I already suffered from deeply low self-esteem. I’ve contemplated ending my life and have made a plan a few times. Self-loathing informed my personality, and I gained a reputation for being kind in part by not being a good steward of my own boundaries. I prioritized other peoples’ needs over mine because I considered them to be much more important.</p>\n<p>I hated conflict. I still hate conflict. The idea of someone yelling at me is scary as shit to me. It gives me a knot in my stomach. I want everyone to be happy and harmonious. Of course, in a lot of situations, everybody <em>can’t</em> be happy and harmonious. And if you start optimizing for harmony instead of boundaries and values, you can very easily stop standing up for the right thing.</p>\n<p>We can debate about whether that’s a good way to look at the world or not, but the combination of a predilection for negative self-talk and a major family crisis established a pattern where I treated the world as something that happened to me rather than something I could affect. I likened it all to a turbulent flight where you just sit back and strap in, because what else can you do?</p>\n<p>And, indeed, I stopped fighting as hard as I should have for the right thing, and I hurt people I care about by not sticking to my values.</p>\n<p>Here’s what else you can do: you can <em>pilot the fucking plane</em>. It’s not as easy, but it’s often right.</p>\n<p>When people describe me as nice or kind, which they do from time to time, I now bristle internally. It’s always intended as a compliment, but I know what has led to that, and what it allows. It’s a giant character flaw on top of a giant character flaw. It’s not just that I want to leave it behind in 2023: I have to, both for my own sanity, and for the people I care about.</p>\n<p>This is hard for me. It’s <em>much</em> easier said than done. I’m having a physical stress response just typing this entry. And people who have come to depend on my acquiescence may be surprised when I don’t. But who wants to live their whole life rolling over? Especially when being compliant can turn you into a far worse person.</p>\n<p>Related:</p>\n<p><strong>Tolerating parochialism</strong></p>\n<p>There are a lot of small-minded people in the world. For them, parochialism and xenophobia are default positions, even if they don’t realize that this is their worldview.</p>\n<p>My full name is Benjamin Otto Werdmuller von Elgg. That might sound alien to you - surprisingly Germanic, maybe. Certainly, quite a few people have told me so, or even gone so far as to make fun of it. But it’s only funny-sounding because it <em>sounds like it comes from somewhere else</em>. It’s a kind of othering that’s rooted in quiet, pervasive xenophobia. It’s only the slightest sliver of non-assimilation, but that’s already too much for some people. (And, of course, I understand that this is just a fraction of the microaggressions that people of color suffer through.)</p>\n<p>I can take it, of course, but that’s also because, as discussed, I’ve taken to burying my own needs. Where this stops hard is when the same thing is done to my child. You do not get to diminish my baby’s heritage or focus on one part of it - the white North American part, for example - as being more important than the others.</p>\n<p>A version of this parochialism can also be found in the commonly-held but discriminatory belief that people should be happy with what they’re given. This sounds lovely until you examine it for just a fraction of a second: should people involved in civil rights or community justice movements just be happy with what they’ve been given? And given by whom? Isn’t it more equitable to support people who stand up for what’s right and fight for more inclusivity and a better life for everyone? What does <em>not</em> wanting that say about someone?</p>\n<p>Let alone more overtly exclusionary stances like being anti-immigration, pro-nationalism, or pro-empire, including caring about people variably based on where they come from or expecting the world to conform to mainstream American values. They’re all harmful and they’re all tiresome. It’s a big, connected world full of beautifully varied, diverse humans and amazing places with incredible cultures, and I’m not sure I need people who find that idea challenging, scary, or in any way bad in my life.</p>\n<p>You are what you tolerate. Enough.</p>\n<p><strong>Pandemic denial</strong></p>\n<p>It’s still happening. I’m still wearing a mask. Onwards.</p>\n<p><strong>Not having time for myself</strong></p>\n<p>I mean, there’s a certain amount of time pressure that’s created when you have a four-month-old baby. I don’t begrudge the time I spend with him at <em>all</em>.</p>\n<p>But this year I read far fewer books; I spent less time writing than I intended; I did less exercise; my therapist dropped out to have her own baby and I didn’t take the time to find another one; I didn’t spend enough time with people I care about. In other words, I neglected myself, because (here’s an ongoing pattern) I didn’t give myself a high enough priority.</p>\n<p>My needs are important, and the better I feel, the better I can show up for the people around me and the things I care about. I can be a better person. There is always something or someone that needs my attention, and there always will be. And although I need to <em>also</em> prioritize my baby, I need to give myself space, and do a better job of holding onto my boundaries so I can live more proactively and do the things I think are important.</p>\n<p>And maybe that’s the theme. I need to not let go of myself, and I need to hold my needs and my values as if they’re actually important to me. They <em>are</em> important to me. And in 2023, I don’t want to leave myself - or the people I care about - behind.</p>",
            "value": "The author and his baby in front of the Liberty Bell, with Independence Hall behind them. As part of The 19th’s non-denominational end-of-year celebration, we were asked what we were leaving behind in 2022. I gave an answer about corporate social media and Instagram in particular, but on reflection, there’s a lot more I want to leave behind.Year ends are both arbitrary and not: a day like any other, but also, genuinely the end of our calendar and the verge of a start to a new blank page. So in that spirit of reflection and new beginnings, these are the things I’d like to leave behind as 2022 disappears behind us.If you’re looking for an overarching theme: my aim is to become more values-led and to do a better job of standing up for what I believe in, which is somewhere I’ve sometimes been severely lacking.Corporate social media (and Instagram in particular)I really do want to do this, and soon. Leaving Twitter was a complete success for me: I found a much richer community in the fediverse. It certainly has some major problems to sort out, most notably that amateur instance-owners often don’t have a working understanding of social power dynamics and what racism, homophobia, and misogyny really are. I can’t gloss over those. But these feel surmountable, and conversations I’ve had with folks who may be starting instances in the new year make me feel hopeful. (For one thing, instances can be owned by the communities they support, which is clearly not the case for any large-scale corporate social media silo.)Instagram and Facebook, maybe ironically, are my last big hold-outs. I was never a big user until I moved to the US when they became the main way I keep in touch with my friends back in Britain, and my family all over the world. But of course, that’s the gameplan: Facebook and Instagram are collectively the world’s largest peer pressure engine. And given the company’s complicity in undermining elections, facilitating genocides, algorithmically causing teen suicides, and potentially much more, I don’t want to participate anymore. Not with random pictures about my day; certainly not with pictures of my baby.I’ve tried to leave several times, but I missed the community - which, to be specific, is the people I love but rarely get to see. But this year has been different, and I have a lot of hope for Pixelfed alongside Mastodon as ways to stay in touch without feeding the beast. (I don’t think either platform will be the final form of the fediverse, by the way, but I think they’re good enough to get going with.) Obviously, I think all of you should start blogs, too, but I understand that the barrier to entry is much higher, and not everyone thinks it’s fun to sit in front of their computer and write (or read) reflective essays.So in 2023, I’ll keep sharing on social media, but I’ll do it on my terms, in a way that doesn’t add to the profits or network effects of a company I despise.And no, the answer isn’t corporate alternatives like Post. It’s a nonsense solution built for people who don’t want to be challenged and I won’t engage any longer.HelplessnessI don’t exactly know how to headline this section, but this is the big one. It could easily be called “unassertiveness” or “acquiescence”, but those ideas don’t quite cover it. They’re right, but they’re a subset of the whole.A lot of people have to deal with a lot of things. I’ve been lucky in my life and I’m aware that I live with a lot of privilege. But I’ve also found the last few years to be very challenging personally.In lots of ways, I’m still dealing with the loss of my mother. Her loss in itself is a crater. We cared for her for over a decade, through pulmonary fibrosis, a double lung transplant, and an intense aftermath brought about by drugs that both kept her alive and slowly killed her. I uprooted my life and moved thousands of miles to be with her. I still have flashbacks to the day of her transplant and lots beyond; she endured torture after torture after torture because, in her words, she wasn’t ready to leave us.I used to cry and express emotion freely. I haven’t been able to do that since. Part of me is still numb; a lot of me is still grieving and adapting.Before all that, I already suffered from deeply low self-esteem. I’ve contemplated ending my life and have made a plan a few times. Self-loathing informed my personality, and I gained a reputation for being kind in part by not being a good steward of my own boundaries. I prioritized other peoples’ needs over mine because I considered them to be much more important.I hated conflict. I still hate conflict. The idea of someone yelling at me is scary as shit to me. It gives me a knot in my stomach. I want everyone to be happy and harmonious. Of course, in a lot of situations, everybody can’t be happy and harmonious. And if you start optimizing for harmony instead of boundaries and values, you can very easily stop standing up for the right thing.We can debate about whether that’s a good way to look at the world or not, but the combination of a predilection for negative self-talk and a major family crisis established a pattern where I treated the world as something that happened to me rather than something I could affect. I likened it all to a turbulent flight where you just sit back and strap in, because what else can you do?And, indeed, I stopped fighting as hard as I should have for the right thing, and I hurt people I care about by not sticking to my values.Here’s what else you can do: you can pilot the fucking plane. It’s not as easy, but it’s often right.When people describe me as nice or kind, which they do from time to time, I now bristle internally. It’s always intended as a compliment, but I know what has led to that, and what it allows. It’s a giant character flaw on top of a giant character flaw. It’s not just that I want to leave it behind in 2023: I have to, both for my own sanity, and for the people I care about.This is hard for me. It’s much easier said than done. I’m having a physical stress response just typing this entry. And people who have come to depend on my acquiescence may be surprised when I don’t. But who wants to live their whole life rolling over? Especially when being compliant can turn you into a far worse person.Related:Tolerating parochialismThere are a lot of small-minded people in the world. For them, parochialism and xenophobia are default positions, even if they don’t realize that this is their worldview.My full name is Benjamin Otto Werdmuller von Elgg. That might sound alien to you - surprisingly Germanic, maybe. Certainly, quite a few people have told me so, or even gone so far as to make fun of it. But it’s only funny-sounding because it sounds like it comes from somewhere else. It’s a kind of othering that’s rooted in quiet, pervasive xenophobia. It’s only the slightest sliver of non-assimilation, but that’s already too much for some people. (And, of course, I understand that this is just a fraction of the microaggressions that people of color suffer through.)I can take it, of course, but that’s also because, as discussed, I’ve taken to burying my own needs. Where this stops hard is when the same thing is done to my child. You do not get to diminish my baby’s heritage or focus on one part of it - the white North American part, for example - as being more important than the others.A version of this parochialism can also be found in the commonly-held but discriminatory belief that people should be happy with what they’re given. This sounds lovely until you examine it for just a fraction of a second: should people involved in civil rights or community justice movements just be happy with what they’ve been given? And given by whom? Isn’t it more equitable to support people who stand up for what’s right and fight for more inclusivity and a better life for everyone? What does not wanting that say about someone?Let alone more overtly exclusionary stances like being anti-immigration, pro-nationalism, or pro-empire, including caring about people variably based on where they come from or expecting the world to conform to mainstream American values. They’re all harmful and they’re all tiresome. It’s a big, connected world full of beautifully varied, diverse humans and amazing places with incredible cultures, and I’m not sure I need people who find that idea challenging, scary, or in any way bad in my life.You are what you tolerate. Enough.Pandemic denialIt’s still happening. I’m still wearing a mask. Onwards.Not having time for myselfI mean, there’s a certain amount of time pressure that’s created when you have a four-month-old baby. I don’t begrudge the time I spend with him at all.But this year I read far fewer books; I spent less time writing than I intended; I did less exercise; my therapist dropped out to have her own baby and I didn’t take the time to find another one; I didn’t spend enough time with people I care about. In other words, I neglected myself, because (here’s an ongoing pattern) I didn’t give myself a high enough priority.My needs are important, and the better I feel, the better I can show up for the people around me and the things I care about. I can be a better person. There is always something or someone that needs my attention, and there always will be. And although I need to also prioritize my baby, I need to give myself space, and do a better job of holding onto my boundaries so I can live more proactively and do the things I think are important.And maybe that’s the theme. I need to not let go of myself, and I need to hold my needs and my values as if they’re actually important to me. They are important to me. And in 2023, I don’t want to leave myself - or the people I care about - behind."
          }
        ],
        "url": [
          "https://werd.io/2022/what-im-leaving-behind-in-2022"
        ],
        "published": [
          "2022-12-31T18:51:46+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "Christmas, the eighth night, and me"
        ],
        "content": [
          {
            "html": "<p>I’m not exactly sure why we celebrate Christmas rather than Hanukkah: we’re a secular family with roots in both traditions. It’s possible that being in Northern Europe (and for my parents, North America before that) just made Christmas the easy default. Christian hegemony is another reason why defaults really matter: the reason Christianity is culturally centered in these places has a long and violent history, often at the expense of the people I’m descended from.</p>\n<p>When my great grandfather arrived in the US in earnest, the White Army’s pogroms in Ukraine behind him, he chose to live secularly, down to shortening his last name to Anglicize it. Although it fell short of pogroms, America was not a welcoming place for Jews. Between the Klan, Henry Ford, the mass media, and associations of Jews with the bolsheviks, <a href=\"https://en.wikipedia.org/wiki/History_of_antisemitism_in_the_United_States#1920s\">the interwar period was particularly hostile</a>.</p>\n<p>As I raise my child today, a hundred years later, it’s still not a welcoming place. A quarter of hiring managers <a href=\"https://www.resumebuilder.com/1-in-4-hiring-managers-say-they-are-less-likely-to-move-forward-with-jewish-applicants/\">don’t want to further Jewish candidates</a> because “Jews have too much power and control”. I’ve personally found myself in conversations about why Kanye West - <a href=\"https://www.rollingstone.com/music/music-news/kanye-wests-love-of-hitler-and-nazis-allegedly-goes-back-20-years-1234647700/\">a Hitler fan</a> - is supposedly in the right. Even among supposedly inclusive people, surprising old tropes about Jews are sometimes repeated as fact. I’ve also been told, quite politely, many times, that I’m going to Hell because I wasn’t baptized.</p>\n<p>All of which makes me want to reclaim that Jewish heritage both for myself and for my baby. The answer here isn’t one or the other: it’s a “yes and” approach. His mother has a Christian heritage; mine includes Christianity and Judaism, as well as strong roots in the largest Muslim nation in the world. It’s also complicated for me, because, to be clear, I don’t believe in any higher power. I’m interested in holding onto the cultural traditions and the sense of belonging of the people who led to me, and to my baby; I can’t (and wouldn’t want to) assimilate into a faith I don’t hold.</p>\n<p>I suppose really what I want is to feel more connected to my ancestors. This is the exact opposite of what I wanted when I was younger: I wanted to be my own person, undefined by someone else’s actions or traditions. My perspective has changed slightly to one of wanting to understand the traditions and beliefs of my ancestors, and perpetuate a sense of belonging to something other than an established cookie-cutter default. I want my child to feel more connected than I was; not so much to believing in a deity, but to who came before him, and their struggles.</p>",
            "value": "I’m not exactly sure why we celebrate Christmas rather than Hanukkah: we’re a secular family with roots in both traditions. It’s possible that being in Northern Europe (and for my parents, North America before that) just made Christmas the easy default. Christian hegemony is another reason why defaults really matter: the reason Christianity is culturally centered in these places has a long and violent history, often at the expense of the people I’m descended from.When my great grandfather arrived in the US in earnest, the White Army’s pogroms in Ukraine behind him, he chose to live secularly, down to shortening his last name to Anglicize it. Although it fell short of pogroms, America was not a welcoming place for Jews. Between the Klan, Henry Ford, the mass media, and associations of Jews with the bolsheviks, the interwar period was particularly hostile.As I raise my child today, a hundred years later, it’s still not a welcoming place. A quarter of hiring managers don’t want to further Jewish candidates because “Jews have too much power and control”. I’ve personally found myself in conversations about why Kanye West - a Hitler fan - is supposedly in the right. Even among supposedly inclusive people, surprising old tropes about Jews are sometimes repeated as fact. I’ve also been told, quite politely, many times, that I’m going to Hell because I wasn’t baptized.All of which makes me want to reclaim that Jewish heritage both for myself and for my baby. The answer here isn’t one or the other: it’s a “yes and” approach. His mother has a Christian heritage; mine includes Christianity and Judaism, as well as strong roots in the largest Muslim nation in the world. It’s also complicated for me, because, to be clear, I don’t believe in any higher power. I’m interested in holding onto the cultural traditions and the sense of belonging of the people who led to me, and to my baby; I can’t (and wouldn’t want to) assimilate into a faith I don’t hold.I suppose really what I want is to feel more connected to my ancestors. This is the exact opposite of what I wanted when I was younger: I wanted to be my own person, undefined by someone else’s actions or traditions. My perspective has changed slightly to one of wanting to understand the traditions and beliefs of my ancestors, and perpetuate a sense of belonging to something other than an established cookie-cutter default. I want my child to feel more connected than I was; not so much to believing in a deity, but to who came before him, and their struggles."
          }
        ],
        "url": [
          "https://werd.io/2022/christmas-the-eighth-night-and-me"
        ],
        "published": [
          "2022-12-26T17:15:13+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "Happy last minute panic-shop to everyone who celebrates."
        ],
        "content": [
          {
            "html": "Happy last minute panic-shop to everyone who celebrates.",
            "value": "Happy last minute panic-shop to everyone who celebrates."
          }
        ],
        "url": [
          "https://werd.io/2022/happy-last-minute-panic-shop-to-everyone-who"
        ],
        "published": [
          "2022-12-24T13:51:27+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "Any sufficiently advanced technology is indistinguishable from authoritarianism."
        ],
        "content": [
          {
            "html": "Any sufficiently advanced technology is indistinguishable from authoritarianism.",
            "value": "Any sufficiently advanced technology is indistinguishable from authoritarianism."
          }
        ],
        "url": [
          "https://werd.io/2022/any-sufficiently-advanced-technology-is-indistinguishable-from"
        ],
        "published": [
          "2022-12-22T18:15:33+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "Federated communities with more friction will make it harder to manufacture consent, and that’s a good thing."
        ],
        "content": [
          {
            "html": "Federated communities with more friction will make it harder to manufacture consent, and that’s a good thing.",
            "value": "Federated communities with more friction will make it harder to manufacture consent, and that’s a good thing."
          }
        ],
        "url": [
          "https://werd.io/2022/federated-communities-with-more-friction-will-make"
        ],
        "published": [
          "2022-12-22T15:42:12+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "I’m now getting roughly 20-30 approaches about placing ads on https://getblogging.org a day. I’m not doing it."
        ],
        "content": [
          {
            "html": "I’m now getting roughly 20-30 approaches about placing ads on <a href=\"https://getblogging.org/\" target=\"_blank\">https://<wbr></wbr>getblogging.org</a> a day. I’m not doing it.",
            "value": "I’m now getting roughly 20-30 approaches about placing ads on https://getblogging.org a day. I’m not doing it."
          }
        ],
        "url": [
          "https://werd.io/2022/im-now-getting-roughly-20-30-approaches-about"
        ],
        "published": [
          "2022-12-21T17:57:06+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "Predictions for Journalism 2023"
        ],
        "content": [
          {
            "html": "<p><a href=\"https://www.niemanlab.org/2022/12/the-internet-is-up-for-grabs-again/\">I have a piece</a> in <a href=\"https://www.niemanlab.org/collection/predictions-2023/\">Nieman Lab’s Predictions for Journalism 2023</a>:</p>\n<blockquote><p>The current landscape makes clear what has always been true: On the internet, nothing lasts forever. The most resilient choice is always the one that allows you to own your relationships with your audience and directly build community with the people who care about your work. That way, when a platform inevitably disappears, your relationship with your community remains intact.</p></blockquote>\n<p>I’m proud of it and stand by its advice.</p>\n<p>In the same collection, <a href=\"https://www.niemanlab.org/2022/12/journalists-mend-trust-with-the-public-while-on-the-campaign-trail/\">my colleague Errin Haines also has a piece</a>:</p>\n<blockquote><p>The 2024 election is also a new opportunity to challenge conventional editorial decisions about who voters are, what they look like, and what matters to them, their families and their communities. For too long, our default setting as journalists for those who have power (and this includes voters) has been white, cisgender, and male. Nearly 60 years after the passage of the Voting Rights Act, there is still much progress to be made to make real the promise of “one person, one vote” in our democracy.</p></blockquote>\n<p>I hope newsrooms take note.</p>\n<p>As always, <a href=\"https://www.niemanlab.org/collection/predictions-2023/\">the whole collection is worth reading</a>.</p>",
            "value": "I have a piece in Nieman Lab’s Predictions for Journalism 2023:The current landscape makes clear what has always been true: On the internet, nothing lasts forever. The most resilient choice is always the one that allows you to own your relationships with your audience and directly build community with the people who care about your work. That way, when a platform inevitably disappears, your relationship with your community remains intact.I’m proud of it and stand by its advice.In the same collection, my colleague Errin Haines also has a piece:The 2024 election is also a new opportunity to challenge conventional editorial decisions about who voters are, what they look like, and what matters to them, their families and their communities. For too long, our default setting as journalists for those who have power (and this includes voters) has been white, cisgender, and male. Nearly 60 years after the passage of the Voting Rights Act, there is still much progress to be made to make real the promise of “one person, one vote” in our democracy.I hope newsrooms take note.As always, the whole collection is worth reading."
          }
        ],
        "url": [
          "https://werd.io/2022/predictions-for-journalism-2023"
        ],
        "published": [
          "2022-12-21T01:26:02+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "Enough about Twitter"
        ],
        "content": [
          {
            "html": "<p>I’ve decided to stop writing about Twitter as of tonight. I’ll pour one out if the site dies or if it changes hands to a stable, ethical custodian, but for now, my commitment to not posting <em>on</em> the platform extends to not posting <em>about</em> the platform.</p>\n<p>It’s clear that Musk is using the Trump communications playbook - own the conversation by any means necessary - and it’s all too easy to play along. So, enough.</p>\n<p>Instead: what can we do that’s better? What should we build together?</p>\n<p>What am I enjoying lately? What’s interesting and worth talking about in a productive way? How am I feeling? What kind of future do I want to see for me and all of us?</p>\n<p>Onwards. Seriously.</p>",
            "value": "I’ve decided to stop writing about Twitter as of tonight. I’ll pour one out if the site dies or if it changes hands to a stable, ethical custodian, but for now, my commitment to not posting on the platform extends to not posting about the platform.It’s clear that Musk is using the Trump communications playbook - own the conversation by any means necessary - and it’s all too easy to play along. So, enough.Instead: what can we do that’s better? What should we build together?What am I enjoying lately? What’s interesting and worth talking about in a productive way? How am I feeling? What kind of future do I want to see for me and all of us?Onwards. Seriously."
          }
        ],
        "url": [
          "https://werd.io/2022/enough-about-twitter"
        ],
        "published": [
          "2022-12-19T04:31:39+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "and smaller again"
        ],
        "content": [
          {
            "html": "<p>Hours after <a href=\"https://werd.io/2022/the-twitter-walled-gardens-walls-get-taller\">enacting a policy to prevent users from linking to outside platforms</a>, Twitter has reversed it and deleted the page from the policy website.</p>\n<p>Among other laws this policy broke, it fell afoul of <a href=\"https://www.europarl.europa.eu/news/en/press-room/20211118IPR17636/digital-markets-act-ending-unfair-practices-of-big-online-platforms\">the European Union Digital Markets Act</a>, which <a href=\"https://www.skadden.com/insights/publications/2022/10/eu-digital-markets-act-enters-into-force\">went into force in November</a>. The fines for breaking this are steep:</p>\n<blockquote><p>Also, the EC will be able to impose penalties and fines of up to 10% of a company’s worldwide annual turnover and up to 20% of such turnover in the event of repeated infringements.</p></blockquote>\n<p>Maybe someone pointed that out to Musk, because it was all gone by dinnertime.</p>\n<p>Meanwhile, he’s asked if he should step down as CEO in a Twitter poll, which at the time of writing he’s losing by a lot. Various people who should absolutely not be given the reigns have asked to be given the reigns. Maybe they should just run it like the Swedish Twitter account and cycle through a new CEO every month?</p>",
            "value": "Hours after enacting a policy to prevent users from linking to outside platforms, Twitter has reversed it and deleted the page from the policy website.Among other laws this policy broke, it fell afoul of the European Union Digital Markets Act, which went into force in November. The fines for breaking this are steep:Also, the EC will be able to impose penalties and fines of up to 10% of a company’s worldwide annual turnover and up to 20% of such turnover in the event of repeated infringements.Maybe someone pointed that out to Musk, because it was all gone by dinnertime.Meanwhile, he’s asked if he should step down as CEO in a Twitter poll, which at the time of writing he’s losing by a lot. Various people who should absolutely not be given the reigns have asked to be given the reigns. Maybe they should just run it like the Swedish Twitter account and cycle through a new CEO every month?"
          }
        ],
        "url": [
          "https://werd.io/2022/and-smaller-again"
        ],
        "published": [
          "2022-12-19T04:17:58+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "Own your posts. Own your words. Own your identity. Own your ethics. Own your ideas."
        ],
        "content": [
          {
            "html": "Own your posts. Own your words. Own your identity. Own your ethics. Own your ideas.",
            "value": "Own your posts. Own your words. Own your identity. Own your ethics. Own your ideas."
          }
        ],
        "url": [
          "https://werd.io/2022/own-your-posts-own-your-words-own"
        ],
        "published": [
          "2022-12-19T02:27:16+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "The Twitter walled garden's walls get taller"
        ],
        "content": [
          {
            "html": "<p><em>Updated: <a href=\"https://werd.io/2022/and-smaller-again\">Twitter rescinded the policy the same day.</a></em></p>\n<p><a href=\"https://help.twitter.com/en/rules-and-policies/social-platforms-policy\">Twitter has banned linking to your profile on other social networks.</a> What a completely pathetic, counterproductive policy.</p>\n<p>Twitter <em>can’t</em> ban linking to any external website, so here’s the simple workaround:</p>\n<ul>\n<li>Make a page on your personal website with all your social profiles</li>\n<li>Link to that instead of directly to your profiles</li>\n</ul>\n<p>What this policy breaks more readily is tools that let you find your existing Twitter connections on Mastodon. Perhaps this is an opportunity to rebuild a social graph from first principles, or to use other mechanisms to find your friends.</p>\n<p>As a reminder, <a href=\"https://werd.io/\">you can find my profiles on my homepage</a>.</p>",
            "value": "Updated: Twitter rescinded the policy the same day.Twitter has banned linking to your profile on other social networks. What a completely pathetic, counterproductive policy.Twitter can’t ban linking to any external website, so here’s the simple workaround:Make a page on your personal website with all your social profiles\nLink to that instead of directly to your profiles\nWhat this policy breaks more readily is tools that let you find your existing Twitter connections on Mastodon. Perhaps this is an opportunity to rebuild a social graph from first principles, or to use other mechanisms to find your friends.As a reminder, you can find my profiles on my homepage."
          }
        ],
        "url": [
          "https://werd.io/2022/the-twitter-walled-gardens-walls-get-taller"
        ],
        "published": [
          "2022-12-18T19:52:58+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "I don’t know why I worried: this baby is an almost absurdly chill traveler. He slept better on the plane than he does in his bed."
        ],
        "content": [
          {
            "html": "I don’t know why I worried: this baby is an almost absurdly chill traveler. He slept better on the plane than he does in his bed.",
            "value": "I don’t know why I worried: this baby is an almost absurdly chill traveler. He slept better on the plane than he does in his bed."
          }
        ],
        "url": [
          "https://werd.io/2022/i-dont-know-why-i-worried-this"
        ],
        "published": [
          "2022-12-16T01:50:10+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "You know, I haven’t been to the movies in over three years, and at this point I’m not sure what would bring me back."
        ],
        "content": [
          {
            "html": "You know, I haven’t been to the movies in over three years, and at this point I’m not sure what would bring me back.",
            "value": "You know, I haven’t been to the movies in over three years, and at this point I’m not sure what would bring me back."
          }
        ],
        "url": [
          "https://werd.io/2022/you-know-i-havent-been-to-the"
        ],
        "published": [
          "2022-12-15T21:04:57+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "Send me your best air travel with infant tips! Please. I need them."
        ],
        "content": [
          {
            "html": "Send me your best air travel with infant tips! Please. I need them.",
            "value": "Send me your best air travel with infant tips! Please. I need them."
          }
        ],
        "url": [
          "https://werd.io/2022/send-me-your-best-air-travel-with"
        ],
        "published": [
          "2022-12-15T03:10:34+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "Just realized that maybe some people think that if it weren't for Twitter's community moderation America might be more receptive to conservative ideas? Because here's some breaking news: it's not Twitter. Twitter is the mirror. People genuinely care."
        ],
        "content": [
          {
            "html": "Just realized that maybe some people think that if it weren't for Twitter's community moderation America might be more receptive to conservative ideas? Because here's some breaking news: it's not Twitter. Twitter is the mirror. People genuinely care.",
            "value": "Just realized that maybe some people think that if it weren't for Twitter's community moderation America might be more receptive to conservative ideas? Because here's some breaking news: it's not Twitter. Twitter is the mirror. People genuinely care."
          }
        ],
        "url": [
          "https://werd.io/2022/just-realized-that-maybe-some-people-think"
        ],
        "published": [
          "2022-12-14T22:37:48+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "Funding open source"
        ],
        "content": [
          {
            "html": "<p>I strongly agree with <a href=\"https://fosstodon.org/@isaacs/109507458333435421\">Isaac Schlueter’s thoughts on funding open source software</a>:</p>\n<blockquote>\n<p>There are a few pitfalls that I see many of these ideas fall into, all of which seem reasonable, but lead to failure:</p>\n<ol>\n<li>A focus on \"donations\" and \"community\" as the ideological framing.</li>\n<li>A focus on getting newcomers introduced to OSS and successful.</li>\n<li>Marketing primarily to developers as the <em>consumers</em> of the products (ie, the ones paying money).</li>\n<li>Overall, making payment optional, or for something other than use of the OSS products (eg, consulting, support, etc).</li>\n</ol>\n</blockquote>\n<p>I thought about going through these in turn, but really, the fourth bullet point is the key one. <em>Don’t make it optional.</em> If your solution is a nice-to-have or depends on altruism in some way, it’s dead in the water. People who can pay should have to pay. It’s the only way to guarantee an income.</p>\n<p>I also think I’d add a fifth bullet: <em>conflating all open source software into one category</em>. Clearly, an open source encryption library designed for use as part of an application is a different kind of software to, say, WordPress. Both of the high-use open source projects I’ve co-founded, Elgg and Known, have fit into that latter category, and I don’t have a good solution for it. Even WordPress struggled financially until it figured out how to (1) sell anti-spam solutions, (2) become a custom page-builder for agencies.</p>\n<p>It’s also a mistake to try and solve the open source funding problems in all domains at once. There are too many variables; there’s too much to consider. How can you possibly create a business model that covers all software libraries?</p>\n<p>So let’s not. Let’s focus our attention on one particular place. </p>\n<p>Let’s focus on GitHub.</p>\n<p>GitHub, a wholly-owned subsidiary of Microsoft, is the largest repository of open source software in the world. <a href=\"https://techcrunch.com/2022/10/25/microsoft-says-github-now-has-a-1b-arr-90m-active-users/\">It has $1 billion in annual recurring revenue</a> and 90M active users. Most projects use it as their hub.</p>\n<p>If you’re building software as part of an enterprise, you care about picking high-quality, well-maintained libraries, and you care about security. You might want to pass a SOC audit and demonstrate that you pay attention to library updates.</p>\n<p>If I’m an open source developer, I probably want to have the resources to be able to spend more time working on my project, and I probably want people to use what I’ve built.</p>\n<p>Imagine you could opt into a GitHub program for each open source repository you build. You pick one of a few approved licenses; you commit to updating the library and keeping on top of issues that people file; you agree to take part in a security bug bounty program. In turn, as long as you fix any disclosed security issues within a reasonable period and don’t let the library go unmaintained, you receive funds for every enterprise GitHub user that uses your library, GitHub will add a verified icon next to your repository name, and it will promote your library to potential paying users.</p>\n<p>This won’t please open source purists. But in this scheme, all code will remain open for anyone to use. Enterprise GitHub users will continue to pay their existing fees, and developers will pay nothing to take part, and potentially make money. GitHub, meanwhile, gets higher quality open source code in the process, will see more development activity on its site, and can make a compelling sales pitch to gain more enterprise customers.</p>\n<p>Over time, this might lead to GitHub developing a new license where corporate users <em>must</em> pay for an enterprise subscription. I don’t see that as necessarily a bad thing, as long as personal, educational, and nonprofit users can continue to use the code. While fully free software has been broadly beneficial to society, it has too often led to financial gain for large companies at the expense of individual developers. It also has led to a demographic problem where only a very narrow set of people (wealthy white men, generally) can afford to build open source software, while it is often used as part of a hiring assessment process. </p>\n<p>There’s a more equitable middle ground where the source can be open but the use is not free for those who can afford to pay. Dare I say it: from each according to their ability, to each according to their needs.</p>",
            "value": "I strongly agree with Isaac Schlueter’s thoughts on funding open source software:There are a few pitfalls that I see many of these ideas fall into, all of which seem reasonable, but lead to failure:A focus on \"donations\" and \"community\" as the ideological framing.\nA focus on getting newcomers introduced to OSS and successful.\nMarketing primarily to developers as the consumers of the products (ie, the ones paying money).\nOverall, making payment optional, or for something other than use of the OSS products (eg, consulting, support, etc).\nI thought about going through these in turn, but really, the fourth bullet point is the key one. Don’t make it optional. If your solution is a nice-to-have or depends on altruism in some way, it’s dead in the water. People who can pay should have to pay. It’s the only way to guarantee an income.I also think I’d add a fifth bullet: conflating all open source software into one category. Clearly, an open source encryption library designed for use as part of an application is a different kind of software to, say, WordPress. Both of the high-use open source projects I’ve co-founded, Elgg and Known, have fit into that latter category, and I don’t have a good solution for it. Even WordPress struggled financially until it figured out how to (1) sell anti-spam solutions, (2) become a custom page-builder for agencies.It’s also a mistake to try and solve the open source funding problems in all domains at once. There are too many variables; there’s too much to consider. How can you possibly create a business model that covers all software libraries?So let’s not. Let’s focus our attention on one particular place. Let’s focus on GitHub.GitHub, a wholly-owned subsidiary of Microsoft, is the largest repository of open source software in the world. It has $1 billion in annual recurring revenue and 90M active users. Most projects use it as their hub.If you’re building software as part of an enterprise, you care about picking high-quality, well-maintained libraries, and you care about security. You might want to pass a SOC audit and demonstrate that you pay attention to library updates.If I’m an open source developer, I probably want to have the resources to be able to spend more time working on my project, and I probably want people to use what I’ve built.Imagine you could opt into a GitHub program for each open source repository you build. You pick one of a few approved licenses; you commit to updating the library and keeping on top of issues that people file; you agree to take part in a security bug bounty program. In turn, as long as you fix any disclosed security issues within a reasonable period and don’t let the library go unmaintained, you receive funds for every enterprise GitHub user that uses your library, GitHub will add a verified icon next to your repository name, and it will promote your library to potential paying users.This won’t please open source purists. But in this scheme, all code will remain open for anyone to use. Enterprise GitHub users will continue to pay their existing fees, and developers will pay nothing to take part, and potentially make money. GitHub, meanwhile, gets higher quality open source code in the process, will see more development activity on its site, and can make a compelling sales pitch to gain more enterprise customers.Over time, this might lead to GitHub developing a new license where corporate users must pay for an enterprise subscription. I don’t see that as necessarily a bad thing, as long as personal, educational, and nonprofit users can continue to use the code. While fully free software has been broadly beneficial to society, it has too often led to financial gain for large companies at the expense of individual developers. It also has led to a demographic problem where only a very narrow set of people (wealthy white men, generally) can afford to build open source software, while it is often used as part of a hiring assessment process. There’s a more equitable middle ground where the source can be open but the use is not free for those who can afford to pay. Dare I say it: from each according to their ability, to each according to their needs."
          }
        ],
        "url": [
          "https://werd.io/2022/funding-open-source"
        ],
        "published": [
          "2022-12-14T18:56:26+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "The future of TV depends on democratized access to the internet"
        ],
        "content": [
          {
            "html": "<p><a href=\"https://www.theguardian.com/tv-and-radio/2022/dec/10/is-this-the-end-of-tv-broadcasters-prepare-for-online-only-switch\">The Guardian on the future of TV:</a></p>\n<blockquote><p>The plan, after years of rumour, is for all TV output to be available online only within the next 10 years or so. Broadcast channels, with their daily line-up of shows, are doomed. Programmes (originally so-called because they were “programmed”) will come into our homes as streamed, branded products, rather than being beamed to viewers on a pre-ordained timetable.</p></blockquote>\n<p><a href=\"https://www.theguardian.com/media/2022/dec/07/bbc-will-go-online-only-by-2030s-says-director-general\">This has previously been confirmed by the BBC:</a></p>\n<blockquote><p>The BBC is preparing to shut down its traditional television and radio broadcasts as it becomes an online-only service over the next decade, according to the director general, Tim Davie.</p></blockquote>\n<p>In the UK two years ago, <a href=\"https://www.statista.com/statistics/275043/percentage-of-households-with-internet-access-in-the-uk-and-eu/\">97% of households had access to the internet</a>. <a href=\"https://www.giganet.uk/2022/11/14/average-cost-of-broadband-in-the-uk/#:~:text=In%20the%20UK%2C%20it's%20reported,package%20benefits%20and%20even%20location.\">The average cost is £30 a month</a>, which incidentally nets out at just under half of <a href=\"https://www.bbc.com/news/explainers-51376255\">the annual license fee</a> British antenna owners have traditionally had to pay to gain access to broadcast television. Of course, if the license fee goes away, which it may well do in a streaming-only context, the net cost is lower. And <a href=\"https://gigabitvoucher.culture.gov.uk/\">subsidies are available to pay for the cost</a>.</p>\n<p>Here in the US, <a href=\"https://www.statista.com/statistics/189349/us-households-home-internet-connection-subscription/\">that number was only 85%</a> - a <em>decrease</em> from a year previously. Even that is an underreported statistic: many of those internet connections are <em>terrible</em>. Research from Microsoft indicates <a href=\"https://www.pewtrusts.org/en/trust/archive/summer-2019/americas-digital-divide\">that over 163 million Americans don’t have broadband internet access</a>. The average cost <a href=\"https://www.broadbandsearch.net/blog/internet-costs-compared-worldwide\">is around $61 a month</a>. With no BBC iPlayer in sight, Americans then have to pay eye-watering fees to get TV access: <a href=\"https://tv.youtube.com/welcome/#:~:text=How%20much%20does%20YouTube%20TV,and%206%20accounts%20per%20household.\">YouTube TV, for example, is $65 a month</a>. Considering the average US mobile phone bill <a href=\"https://www.moneylion.com/learn/average-cell-phone-bill-per-month/#:~:text=The%20average%20monthly%20cell%20phone,2022%20is%20%24114%20per%20month.\">is an absurd $114 per month</a>, Americans are wildly overpaying for data, putting it far out of reach of a lot of ordinary people.</p>\n<p>Will this picture have changed much in ten years? It’s hard to see how without a lot of legislation. ISPs are not incentivized to lower prices, <a href=\"https://www.vox.com/the-goods/2020/2/18/21126347/antitrust-monopolies-internet-telecommunications-cheerleading\">particularly considering significant local monopolies</a>:</p>\n<blockquote><p>In the US, however, just a few big companies, often without overlap, control much of the telecom industry, and the result is high prices and uneven connectivity. […] “Broadly speaking, over the last 20 years in the US, we see profits of incumbents becoming more persistent, because they are less challenged, their market share has become both larger and more stable, and at the same time, we see a lot of lobbying by incumbents, in particular to get their mergers approved or to protect their rents,” [NYU economist Thomas] Philippon told me.</p></blockquote>\n<p>There’s a lot to be gained by television moving to an internet-only standard. Access will no longer be governed by spectrum auctions or cable providers: theoretically, any organization will be able to create a channel and stand on more or less equal footing. The days of bundled cable channels - get two that you want and eighty that you don’t - will finally go away.</p>\n<p>But for this to work, access to the internet must be made available to all. That means creating more competition in local broadband markets (or nationalizing the lot, but hell will freeze over first), ensuring that everybody has a good standard of connection, protecting <a href=\"https://www.wired.com/story/guide-net-neutrality/\">net neutrality</a>, and radically lowering prices.</p>\n<p>If one happens without the other, we’ll create a giant information divide that will further erode democracy. Effectively, only the relatively wealthy will have access to the news. News deserts <a href=\"https://www.washingtonpost.com/media/2022/06/29/news-deserts-newspapers-democracy/\">already reduce democratic participation and increase corruption</a>: </p>\n<blockquote><p>“We already live in a polarized country, and part of that polarization stems from our digital divide and our local-news divide,” [researcher into news deserts Penelope Muse Abernathy] told me. “We have to think about how we reach people who aren’t digitally connected, and how we can support efforts that get beyond the city.”</p></blockquote>\n<p>A further move to the internet without ensuring everyone can use it will compound that problem. Without intervention, that’s likely to be exactly what happens.</p>",
            "value": "The Guardian on the future of TV:The plan, after years of rumour, is for all TV output to be available online only within the next 10 years or so. Broadcast channels, with their daily line-up of shows, are doomed. Programmes (originally so-called because they were “programmed”) will come into our homes as streamed, branded products, rather than being beamed to viewers on a pre-ordained timetable.This has previously been confirmed by the BBC:The BBC is preparing to shut down its traditional television and radio broadcasts as it becomes an online-only service over the next decade, according to the director general, Tim Davie.In the UK two years ago, 97% of households had access to the internet. The average cost is £30 a month, which incidentally nets out at just under half of the annual license fee British antenna owners have traditionally had to pay to gain access to broadcast television. Of course, if the license fee goes away, which it may well do in a streaming-only context, the net cost is lower. And subsidies are available to pay for the cost.Here in the US, that number was only 85% - a decrease from a year previously. Even that is an underreported statistic: many of those internet connections are terrible. Research from Microsoft indicates that over 163 million Americans don’t have broadband internet access. The average cost is around $61 a month. With no BBC iPlayer in sight, Americans then have to pay eye-watering fees to get TV access: YouTube TV, for example, is $65 a month. Considering the average US mobile phone bill is an absurd $114 per month, Americans are wildly overpaying for data, putting it far out of reach of a lot of ordinary people.Will this picture have changed much in ten years? It’s hard to see how without a lot of legislation. ISPs are not incentivized to lower prices, particularly considering significant local monopolies:In the US, however, just a few big companies, often without overlap, control much of the telecom industry, and the result is high prices and uneven connectivity. […] “Broadly speaking, over the last 20 years in the US, we see profits of incumbents becoming more persistent, because they are less challenged, their market share has become both larger and more stable, and at the same time, we see a lot of lobbying by incumbents, in particular to get their mergers approved or to protect their rents,” [NYU economist Thomas] Philippon told me.There’s a lot to be gained by television moving to an internet-only standard. Access will no longer be governed by spectrum auctions or cable providers: theoretically, any organization will be able to create a channel and stand on more or less equal footing. The days of bundled cable channels - get two that you want and eighty that you don’t - will finally go away.But for this to work, access to the internet must be made available to all. That means creating more competition in local broadband markets (or nationalizing the lot, but hell will freeze over first), ensuring that everybody has a good standard of connection, protecting net neutrality, and radically lowering prices.If one happens without the other, we’ll create a giant information divide that will further erode democracy. Effectively, only the relatively wealthy will have access to the news. News deserts already reduce democratic participation and increase corruption: “We already live in a polarized country, and part of that polarization stems from our digital divide and our local-news divide,” [researcher into news deserts Penelope Muse Abernathy] told me. “We have to think about how we reach people who aren’t digitally connected, and how we can support efforts that get beyond the city.”A further move to the internet without ensuring everyone can use it will compound that problem. Without intervention, that’s likely to be exactly what happens."
          }
        ],
        "url": [
          "https://werd.io/2022/the-future-of-tv-depends-on-democratized-access-to-the"
        ],
        "published": [
          "2022-12-14T17:03:08+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "The woke mind virus"
        ],
        "content": [
          {
            "html": "<p>This guy:</p>\n<p><img src=\"https://werd.io/file/63976f899cedc22d471265e2\" alt=\"Elon Musk tweet: \" the woke mind virus must be defeated or nothing else matters. width=\"1014\" height=\"200\"></p>\n<p>Musk’s tweet was published just after he was booed off stage at a Dave Chappelle gig. Chappelle’s transphobic material is hardly on the social justice end of the rhetorical spectrum, so it’s more about hurt feelings than substance.</p>\n<p>Anyway. “Woke” was originally about being aware of racial subjugation, and its modern-day usage usually relates to awareness of social power imbalances around race lines. Which are not imaginary and hold entire communities back.</p>\n<p>So, just for the record, it’s not a “mind virus”, it’s a civil rights movement, and in my view, it must succeed or nothing else matters. The goal has to be a more equal, inclusive, and educated world. I will leave considering what opposition to that idea says about a person up to the reader.</p>",
            "value": "This guy: Elon Musk tweet:  Musk’s tweet was published just after he was booed off stage at a Dave Chappelle gig. Chappelle’s transphobic material is hardly on the social justice end of the rhetorical spectrum, so it’s more about hurt feelings than substance.Anyway. “Woke” was originally about being aware of racial subjugation, and its modern-day usage usually relates to awareness of social power imbalances around race lines. Which are not imaginary and hold entire communities back.So, just for the record, it’s not a “mind virus”, it’s a civil rights movement, and in my view, it must succeed or nothing else matters. The goal has to be a more equal, inclusive, and educated world. I will leave considering what opposition to that idea says about a person up to the reader."
          }
        ],
        "url": [
          "https://werd.io/2022/the-woke-mind-virus"
        ],
        "published": [
          "2022-12-12T18:14:51+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "Building an open share button for the distributed social web"
        ],
        "content": [
          {
            "html": "<p>Thinking through a “share with Mastodon” button that anyone could embed on a website. It’s a harder problem than a “share with Twitter” button, because there’s no one central host, and it would be ideal to avoid creating a central location to handle these requests. (Mastodon is decentralized, after all.)</p>\n<p>As a bonus, I think it would work for indieweb or any other decentralized social platform. Maybe any social platform at all?</p>\n<p>This would all be easier if <a href=\"https://en.wikipedia.org/wiki/Web_Intents\">web intents</a> had stuck around. Nonetheless, here’s how it might work. Let’s call it “microshare”, to sit alongside <a href=\"https://indieweb.org/Micropub\">micropub</a>:</p>\n<ol>\n<li>User clicks button on page.</li>\n<li>JS on the page detects whether the <code>web+social</code> URI scheme has been registered (I wish this was easier, but you can do this by making an asynchronous request and waiting for it to succeed or fail).</li>\n<li>If it has, great! Just forward the user to that URI.</li>\n<li>If not, ask the user what the domain of their social profile is.</li>\n<li>JS (or a back-end server process) goes and fetches that base URL and looks for either a <code>microshare</code> metatag or an HTTP header of the form <code>Link: &lt;<a href=\"https://example.com/microshare&amp;gt\" target=\"_blank\" rel=\"in-reply-to\" class=\"u-in-reply-to\">https://<wbr></wbr>example.com/<wbr></wbr>microshare&amp;gt</a>;; rel=\"microshare\"</code>. (Mastodon etc would need to support this endpoint and discovery of same.)</li>\n<li>If the endpoint exists, the browser opens a new tab and forwards the user to that URI with additional <code>text</code> and <code>url</code> URL string parameters populated with the name and the URL of the page being shared respectively.</li>\n<li>This new page contains a button to register the URI as the handler for the <code>web+social</code> URI scheme. It may also either prompt the user to log in, or, if they’re already logged in, share to that social platform, with the text and URL pre-filled into the form.</li>\n</ol>\n<p>There are a few issues here that I’d like to iterate on: I wish URI scheme handling and detection was easier in a browser, for one. Secondly, there’s a potential phishing attack where a malicious website could show a fake login page and harvest someone’s login credentials.</p>\n<p>Still, what I like about it is that it uses the web’s existing capabilities and doesn’t enforce a central domain handler (or even a domain as a shim). While it seems more convoluted than a standard href link (and it is), it can be achieved on publisher websites with just a few lines of JavaScript.</p>\n<p>I’m sure I’ve missed something important, but I wanted to kick this off as a first step. Let me know what you think!</p>",
            "value": "Thinking through a “share with Mastodon” button that anyone could embed on a website. It’s a harder problem than a “share with Twitter” button, because there’s no one central host, and it would be ideal to avoid creating a central location to handle these requests. (Mastodon is decentralized, after all.)As a bonus, I think it would work for indieweb or any other decentralized social platform. Maybe any social platform at all?This would all be easier if web intents had stuck around. Nonetheless, here’s how it might work. Let’s call it “microshare”, to sit alongside micropub:User clicks button on page.\nJS on the page detects whether the web+social URI scheme has been registered (I wish this was easier, but you can do this by making an asynchronous request and waiting for it to succeed or fail).\nIf it has, great! Just forward the user to that URI.\nIf not, ask the user what the domain of their social profile is.\nJS (or a back-end server process) goes and fetches that base URL and looks for either a microshare metatag or an HTTP header of the form Link: <https://example.com/microshare&gt;; rel=\"microshare\". (Mastodon etc would need to support this endpoint and discovery of same.)\nIf the endpoint exists, the browser opens a new tab and forwards the user to that URI with additional text and url URL string parameters populated with the name and the URL of the page being shared respectively.\nThis new page contains a button to register the URI as the handler for the web+social URI scheme. It may also either prompt the user to log in, or, if they’re already logged in, share to that social platform, with the text and URL pre-filled into the form.\nThere are a few issues here that I’d like to iterate on: I wish URI scheme handling and detection was easier in a browser, for one. Secondly, there’s a potential phishing attack where a malicious website could show a fake login page and harvest someone’s login credentials.Still, what I like about it is that it uses the web’s existing capabilities and doesn’t enforce a central domain handler (or even a domain as a shim). While it seems more convoluted than a standard href link (and it is), it can be achieved on publisher websites with just a few lines of JavaScript.I’m sure I’ve missed something important, but I wanted to kick this off as a first step. Let me know what you think!"
          }
        ],
        "in-reply-to": [
          "https://example.com/microshare&gt"
        ],
        "url": [
          "https://werd.io/2022/building-an-open-share-button-for-the-distributed-social-web"
        ],
        "published": [
          "2022-12-12T17:31:52+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "Things I've learned about parenting"
        ],
        "content": [
          {
            "html": "<p>In the grand tradition of tech people barely doing something and then turning around and giving advice as if they’re experts, I thought I’d write up some of the things I’ve learned being the parent of a three-and-a-half-month-old baby. If you’re about to be a parent, you might find this useful. If you’re already a parent, you might disagree with me. And if you don’t want to have kids or think that being a parent is a long way off for you, this might reinforce your position. As always, your mileage may vary.</p>\n<p><strong>It’s jazz.</strong> Jazz musicians watch each other carefully throughout their performances. There are rules that dictate how they hand off to each other, and what they play when they do - but so much is also responsive, emotionally driven, and expressive. You can be very informed; you can learn techniques; you can build routines. But the number one lesson is to listen to what your child is telling you, implicitly and explicitly. Just like everything else in life, if you try and play rote from the textbook, you won’t do well. The core skill in parenting (and most things) is empathy.</p>\n<p><strong>Gadgets are a crutch.</strong> There is, of course, a whole industry of people trying to sell you things to help your baby sleep or make them smarter or healthier. We have a Snoo, a kind of robot crib that responsively rocks your baby to sleep. I thought it was miraculous until one day we didn’t use it and he both fell and stayed asleep just fine. There are white noise machines and apps to quantify your baby’s feeds and diaper changes. All of it just increases your anxiety and gives you a reason to think you’re a bad parent (often so you can buy more products from the app developer). Again: the rule is to be attentive to your baby.</p>\n<p><strong>The advice changes and will change again.</strong> The advice parents were given when I was a baby is not the same as the advice we’re given now. Older parents look at swaddling, for example, with horror: <em>you’re straight-jacketing your baby!</em> Newer parents (I think rightly) think of letting babies cry it out as tantamount to abuse. Some advice was right; some was wrong. The advice we’re being given this year is guaranteed to be outdated ten years from now.</p>\n<p><strong>Influencer parents are the devil.</strong> There are always people who try to make their living looking like perfect parents online. It’s also always true that every baby is different and different parents have different difficulties. Just as Instagram is dangerous for a teenager’s body image, it can convey harmful messages about how mothers in particular should act.</p>\n<p><strong>Invest in sleepers with zips and stretchy sleeves.</strong> You’ll thank me later.</p>\n<p><strong>Bottles are fine.</strong> There’s so much pressure on mothers to exclusively breastfeed. It’s sometimes impossible for lots of different reasons, from contextual to biological to personal choice. Breast milk is the healthiest thing for a baby to drink - no question. But sometimes formula is okay, and whatever’s being fed, a bottle is just fine. I like bottle-feeding: because I don’t lactate, it means I get to be an active participant in feeding my child.</p>\n<p><strong>Sexism is endemic.</strong> A nurse - a <em>nurse!</em> - at our hospital congratulated us on having a boy. (“I’ve only been able to have girls.”) Another apologized to me because I would need to hold or feed the baby sometimes. So many people think that parenting is women’s work. There is criticism of mothers who want to go back to work; there is criticism of fathers who want to be active parents. I am a fully-active parent and I resent this message enormously. This is yet another realm where traditional gender roles and societal traditions, in general, are not helpful.</p>\n<p><strong>You must also take care of yourself.</strong> I spent the first month not doing any exercise, eating a bunch of ice cream, and waking up every two hours. It was horrible and I felt like trash all the time. Later I cut out the ice cream and built going for a walk into my routine. It made a universe of difference. I still woke up very regularly, but the exercise and better diet made me feel like I had more energy.</p>\n<p><strong>Assume they can understand everything.</strong> My baby is a sponge. I’m certain he knows exactly what we’re saying all of the time. As much as cleaning poop off their onesies might be a pain, or as much as you’d like to not be feeding them at 3am, they’ve got to know how wonderful they are. There need to be smiles and good times. They don’t need to be neurotic at less than a year old - and they don’t need to pick up the idea that they’re a burden. They’re not a burden, after all! You can give your child reasons to go to therapy later on. I’m sure I will.</p>\n<p><strong>It’s a new baby every day.</strong> Babies regenerate, Doctor Who style. Their behavior changes radically, their <em>body</em> changes radically. (“How are your hands suddenly so big?” is a thing I’ve said multiple times.) They literally grow overnight. Enjoy the baby you have today and look forward to the one you’ll have tomorrow.</p>\n<p><strong>Treat your baby like they’re immunocompromised.</strong> A lot of people will expect you to be more social with your baby than you’re comfortable with. Don’t listen. They don’t have very functional immune systems in the first few months, <em>and</em> covid is very much back on the rise, <em>and</em> RSV is becoming a huge problem. It’s okay to be very cautious with your baby’s health. Keeping them alive is your main job now.</p>\n<p><strong>This is the single hardest thing I’ve ever done and hope to ever do.</strong> When people said that, I kind of assumed they meant spiritually or ethically. No. It’s really hard on every level. It takes everything you’ve got, every day. And it’s completely, 100% worth it.</p>",
            "value": "In the grand tradition of tech people barely doing something and then turning around and giving advice as if they’re experts, I thought I’d write up some of the things I’ve learned being the parent of a three-and-a-half-month-old baby. If you’re about to be a parent, you might find this useful. If you’re already a parent, you might disagree with me. And if you don’t want to have kids or think that being a parent is a long way off for you, this might reinforce your position. As always, your mileage may vary.It’s jazz. Jazz musicians watch each other carefully throughout their performances. There are rules that dictate how they hand off to each other, and what they play when they do - but so much is also responsive, emotionally driven, and expressive. You can be very informed; you can learn techniques; you can build routines. But the number one lesson is to listen to what your child is telling you, implicitly and explicitly. Just like everything else in life, if you try and play rote from the textbook, you won’t do well. The core skill in parenting (and most things) is empathy.Gadgets are a crutch. There is, of course, a whole industry of people trying to sell you things to help your baby sleep or make them smarter or healthier. We have a Snoo, a kind of robot crib that responsively rocks your baby to sleep. I thought it was miraculous until one day we didn’t use it and he both fell and stayed asleep just fine. There are white noise machines and apps to quantify your baby’s feeds and diaper changes. All of it just increases your anxiety and gives you a reason to think you’re a bad parent (often so you can buy more products from the app developer). Again: the rule is to be attentive to your baby.The advice changes and will change again. The advice parents were given when I was a baby is not the same as the advice we’re given now. Older parents look at swaddling, for example, with horror: you’re straight-jacketing your baby! Newer parents (I think rightly) think of letting babies cry it out as tantamount to abuse. Some advice was right; some was wrong. The advice we’re being given this year is guaranteed to be outdated ten years from now.Influencer parents are the devil. There are always people who try to make their living looking like perfect parents online. It’s also always true that every baby is different and different parents have different difficulties. Just as Instagram is dangerous for a teenager’s body image, it can convey harmful messages about how mothers in particular should act.Invest in sleepers with zips and stretchy sleeves. You’ll thank me later.Bottles are fine. There’s so much pressure on mothers to exclusively breastfeed. It’s sometimes impossible for lots of different reasons, from contextual to biological to personal choice. Breast milk is the healthiest thing for a baby to drink - no question. But sometimes formula is okay, and whatever’s being fed, a bottle is just fine. I like bottle-feeding: because I don’t lactate, it means I get to be an active participant in feeding my child.Sexism is endemic. A nurse - a nurse! - at our hospital congratulated us on having a boy. (“I’ve only been able to have girls.”) Another apologized to me because I would need to hold or feed the baby sometimes. So many people think that parenting is women’s work. There is criticism of mothers who want to go back to work; there is criticism of fathers who want to be active parents. I am a fully-active parent and I resent this message enormously. This is yet another realm where traditional gender roles and societal traditions, in general, are not helpful.You must also take care of yourself. I spent the first month not doing any exercise, eating a bunch of ice cream, and waking up every two hours. It was horrible and I felt like trash all the time. Later I cut out the ice cream and built going for a walk into my routine. It made a universe of difference. I still woke up very regularly, but the exercise and better diet made me feel like I had more energy.Assume they can understand everything. My baby is a sponge. I’m certain he knows exactly what we’re saying all of the time. As much as cleaning poop off their onesies might be a pain, or as much as you’d like to not be feeding them at 3am, they’ve got to know how wonderful they are. There need to be smiles and good times. They don’t need to be neurotic at less than a year old - and they don’t need to pick up the idea that they’re a burden. They’re not a burden, after all! You can give your child reasons to go to therapy later on. I’m sure I will.It’s a new baby every day. Babies regenerate, Doctor Who style. Their behavior changes radically, their body changes radically. (“How are your hands suddenly so big?” is a thing I’ve said multiple times.) They literally grow overnight. Enjoy the baby you have today and look forward to the one you’ll have tomorrow.Treat your baby like they’re immunocompromised. A lot of people will expect you to be more social with your baby than you’re comfortable with. Don’t listen. They don’t have very functional immune systems in the first few months, and covid is very much back on the rise, and RSV is becoming a huge problem. It’s okay to be very cautious with your baby’s health. Keeping them alive is your main job now.This is the single hardest thing I’ve ever done and hope to ever do. When people said that, I kind of assumed they meant spiritually or ethically. No. It’s really hard on every level. It takes everything you’ve got, every day. And it’s completely, 100% worth it."
          }
        ],
        "url": [
          "https://werd.io/2022/things-ive-learned-about-parenting"
        ],
        "published": [
          "2022-12-11T20:46:04+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "AI-generated content on Medium"
        ],
        "content": [
          {
            "html": "<p>Over on Medium, <a href=\"https://blog.medium.com/what-do-you-think-about-a-i-generated-writing-89dbbf352d47\">VP Content Scott Lamb asked:</a></p>\n<blockquote><p>We’re curious what you think. How do you think Medium should approach AI-generated content? What are good and bad examples of AI content? What are you concerned about? What are you excited about?</p></blockquote>\n<p><a href=\"https://medium.com/p/17871d8e8867\">Here’s how I replied:</a></p>\n<p>I think my biggest ask is actually on the corpus side of AI writing generation: allow me to prevent my writing from being used as part of an AI system. Companies like OpenAI need to agree to a robots.txt-style system to prevent ingestion that can be broadly used, and then Medium needs to apply it across the board.</p>\n<p>Work needs to be done to fingerprint AI writing, but until then, I don't think it can be identified accurately, which means it will always fall through the cracks. Instead, poor quality work - and authors who consistently publish it - should not rise in recommendations.</p>\n<p>I wonder if there's a case to be made for creating in-house community-positive AI tools so people aren't using spammy tools from elsewhere? For example, a tool that poses interesting questions and helps an amateur author write more comprehensive original work.</p>",
            "value": "Over on Medium, VP Content Scott Lamb asked:We’re curious what you think. How do you think Medium should approach AI-generated content? What are good and bad examples of AI content? What are you concerned about? What are you excited about?Here’s how I replied:I think my biggest ask is actually on the corpus side of AI writing generation: allow me to prevent my writing from being used as part of an AI system. Companies like OpenAI need to agree to a robots.txt-style system to prevent ingestion that can be broadly used, and then Medium needs to apply it across the board.Work needs to be done to fingerprint AI writing, but until then, I don't think it can be identified accurately, which means it will always fall through the cracks. Instead, poor quality work - and authors who consistently publish it - should not rise in recommendations.I wonder if there's a case to be made for creating in-house community-positive AI tools so people aren't using spammy tools from elsewhere? For example, a tool that poses interesting questions and helps an amateur author write more comprehensive original work."
          }
        ],
        "url": [
          "https://werd.io/2022/ai-generated-content-on-medium"
        ],
        "published": [
          "2022-12-09T01:15:38+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "Four-month sleep regression is go!"
        ],
        "content": [
          {
            "html": "Four-month sleep regression is go!",
            "value": "Four-month sleep regression is go!"
          }
        ],
        "url": [
          "https://werd.io/2022/four-month-sleep-regression-is-go"
        ],
        "published": [
          "2022-12-07T14:47:39+00:00"
        ]
      }
    }
  ],
  "rels": {
    "apple-touch-icon": [
      "https://werd.io/gfx/logos/apple-icon-57x57.png",
      "https://werd.io/gfx/logos/apple-icon-72x72.png",
      "https://werd.io/gfx/logos/apple-icon-114x114.png",
      "https://werd.io/gfx/logos/apple-icon-144x144.png",
      "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
    ],
    "icon": [
      "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
    ],
    "shortcut": [
      "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
    ],
    "apple-touch-icon-precomposed": [
      "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
    ],
    "manifest": [
      "https://werd.io/chrome/manifest.json"
    ],
    "schema.DC": [
      "https://purl.org/dc/elements/1.1/"
    ],
    "stylesheet": [
      "https://werd.io/vendor/twbs/bootstrap/dist/css/bootstrap.min.css",
      "https://werd.io/vendor/npm-asset/bootstrap-accessibility-plugin/plugins/css/bootstrap-accessibility.css",
      "https://werd.io/vendor/forkawesome/fork-awesome/css/fork-awesome.min.css",
      "https://werd.io/vendor/forkawesome/fork-awesome/css/v5-compat.min.css",
      "https://werd.io/css/1659102598/known.min.css",
      "https://werd.io/vendor/npm-asset/bootstrap-toggle/css/bootstrap-toggle.min.css",
      "https://werd.io/vendor/idno/mentionjs/recommended-styles.css",
      "https://werd.io/vendor/npm-asset/eonasdan-bootstrap-datetimepicker/build/css/bootstrap-datetimepicker.min.css",
      "https://werd.io/Themes/CornmarketStreet/css/default.min.css",
      "https://fonts.googleapis.com/css?family=Merriweather:300,300i,400,400i,700,700i",
      "https://werd.io/vendor/npm-asset/mediaelement/build/mediaelementplayer.min.css"
    ],
    "alternate": [
      "https://werd.io/profile/benwerd?_t=rss",
      "https://werd.io/content/all?_t=rss",
      "https://granary.io/url?url=https://werd.io/content/all/&input=html&output=atom&hub=https://bridgy-fed.superfeedr.com/"
    ],
    "feed": [
      "https://werd.io/profile/benwerd?_t=rss",
      "https://werd.io/content/all?_t=rss",
      "https://werd.io/content/all"
    ],
    "http://webmention.org/": [
      "https://werd.io/webmention/"
    ],
    "webmention": [
      "https://werd.io/webmention/"
    ],
    "hub": [
      "https://withknown.superfeedr.com/"
    ],
    "me": [
      "https://github.com/benwerd",
      "https://www.linkedin.com/in/benwerd",
      "https://werd.social/@ben",
      "https://19thnews.org/"
    ],
    "openid.delegate": [
      "https://werd.io/"
    ],
    "openid.server": [
      "https://indieauth.com/openid"
    ],
    "authorization_endpoint": [
      "https://werd.io/indieauth/auth"
    ],
    "token_endpoint": [
      "https://werd.io/indieauth/token"
    ],
    "micropub": [
      "https://werd.io/micropub/endpoint"
    ],
    "canonical": [
      "https://werd.io/2022/four-month-sleep-regression-is-go"
    ],
    "permalink": [
      "https://werd.io/2023/cpanel-is-such-an-awful-piece-of",
      "https://werd.io/2022/it039s-such-a-windows-me-thing-to",
      "https://werd.io/2022/my-targeted-ads-over-on-corporate-media",
      "https://werd.io/2022/what-im-leaving-behind-in-2022",
      "https://werd.io/2022/christmas-the-eighth-night-and-me",
      "https://werd.io/2022/happy-last-minute-panic-shop-to-everyone-who",
      "https://werd.io/2022/any-sufficiently-advanced-technology-is-indistinguishable-from",
      "https://werd.io/2022/federated-communities-with-more-friction-will-make",
      "https://werd.io/2022/im-now-getting-roughly-20-30-approaches-about",
      "https://werd.io/2022/predictions-for-journalism-2023",
      "https://werd.io/2022/enough-about-twitter",
      "https://werd.io/2022/and-smaller-again",
      "https://werd.io/2022/own-your-posts-own-your-words-own",
      "https://werd.io/2022/the-twitter-walled-gardens-walls-get-taller",
      "https://werd.io/2022/i-dont-know-why-i-worried-this",
      "https://werd.io/2022/you-know-i-havent-been-to-the",
      "https://werd.io/2022/send-me-your-best-air-travel-with",
      "https://werd.io/2022/just-realized-that-maybe-some-people-think",
      "https://werd.io/2022/funding-open-source",
      "https://werd.io/2022/the-future-of-tv-depends-on-democratized-access-to-the",
      "https://werd.io/2022/the-woke-mind-virus",
      "https://werd.io/2022/building-an-open-share-button-for-the-distributed-social-web",
      "https://werd.io/2022/things-ive-learned-about-parenting",
      "https://werd.io/2022/ai-generated-content-on-medium",
      "https://werd.io/2022/four-month-sleep-regression-is-go"
    ],
    "in-reply-to": [
      "https://example.com/microshare&gt"
    ],
    "next": [
      "https://werd.io/profile/benwerd?offset=0"
    ],
    "prev": [
      "https://werd.io/profile/benwerd?offset=25"
    ]
  },
  "rel-urls": {
    "https://werd.io/gfx/logos/apple-icon-57x57.png": {
      "rels": [
        "apple-touch-icon"
      ]
    },
    "https://werd.io/gfx/logos/apple-icon-72x72.png": {
      "rels": [
        "apple-touch-icon"
      ]
    },
    "https://werd.io/gfx/logos/apple-icon-114x114.png": {
      "rels": [
        "apple-touch-icon"
      ]
    },
    "https://werd.io/gfx/logos/apple-icon-144x144.png": {
      "rels": [
        "apple-touch-icon"
      ]
    },
    "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg": {
      "rels": [
        "icon",
        "shortcut"
      ],
      "type": "image/jpg"
    },
    "https://werd.io/chrome/manifest.json": {
      "rels": [
        "manifest"
      ]
    },
    "https://purl.org/dc/elements/1.1/": {
      "rels": [
        "schema.DC"
      ]
    },
    "https://werd.io/vendor/twbs/bootstrap/dist/css/bootstrap.min.css": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://werd.io/vendor/npm-asset/bootstrap-accessibility-plugin/plugins/css/bootstrap-accessibility.css": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://werd.io/vendor/forkawesome/fork-awesome/css/fork-awesome.min.css": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://werd.io/vendor/forkawesome/fork-awesome/css/v5-compat.min.css": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://werd.io/css/1659102598/known.min.css": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://werd.io/vendor/npm-asset/bootstrap-toggle/css/bootstrap-toggle.min.css": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://werd.io/vendor/idno/mentionjs/recommended-styles.css": {
      "rels": [
        "stylesheet"
      ],
      "type": "text/css"
    },
    "https://werd.io/vendor/npm-asset/eonasdan-bootstrap-datetimepicker/build/css/bootstrap-datetimepicker.min.css": {
      "rels": [
        "stylesheet"
      ],
      "type": "text/css"
    },
    "https://werd.io/profile/benwerd?_t=rss": {
      "rels": [
        "alternate"
      ],
      "title": "Ben Werdmuller",
      "type": "application/rss+xml"
    },
    "https://werd.io/content/all?_t=rss": {
      "rels": [
        "alternate",
        "feed"
      ],
      "title": "Ben Werdmuller: all content",
      "type": "application/rss+xml"
    },
    "https://werd.io/content/all": {
      "rels": [
        "feed"
      ],
      "title": "Ben Werdmuller",
      "type": "text/html"
    },
    "https://werd.io/webmention/": {
      "rels": [
        "http://webmention.org/"
      ]
    },
    "https://withknown.superfeedr.com/": {
      "rels": [
        "hub"
      ]
    },
    "https://github.com/benwerd": {
      "rels": [
        "me"
      ]
    },
    "https://www.linkedin.com/in/benwerd": {
      "rels": [
        "me"
      ]
    },
    "https://werd.social/@ben": {
      "rels": [
        "me"
      ]
    },
    "https://19thnews.org/": {
      "rels": [
        "me"
      ]
    },
    "https://werd.io/": {
      "rels": [
        "openid.delegate"
      ]
    },
    "https://indieauth.com/openid": {
      "rels": [
        "openid.server"
      ]
    },
    "https://werd.io/indieauth/auth": {
      "rels": [
        "authorization_endpoint"
      ]
    },
    "https://werd.io/indieauth/token": {
      "rels": [
        "token_endpoint"
      ]
    },
    "https://werd.io/micropub/endpoint": {
      "rels": [
        "micropub"
      ]
    },
    "https://werd.io/2022/four-month-sleep-regression-is-go": {
      "rels": [
        "canonical"
      ]
    },
    "https://granary.io/url?url=https://werd.io/content/all/&input=html&output=atom&hub=https://bridgy-fed.superfeedr.com/": {
      "rels": [
        "alternate"
      ],
      "type": "application/atom+xml"
    },
    "https://werd.io/Themes/CornmarketStreet/css/default.min.css": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://fonts.googleapis.com/css?family=Merriweather:300,300i,400,400i,700,700i": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://werd.io/2023/cpanel-is-such-an-awful-piece-of": {
      "rels": [
        "permalink"
      ],
      "text": "\nJanuary 1, 2023\n"
    },
    "https://werd.io/2022/it039s-such-a-windows-me-thing-to": {
      "rels": [
        "permalink"
      ],
      "text": "\nDecember 31, 2022\n"
    },
    "https://werd.io/2022/my-targeted-ads-over-on-corporate-media": {
      "rels": [
        "permalink"
      ],
      "text": "\nDecember 31, 2022\n"
    },
    "https://werd.io/2022/what-im-leaving-behind-in-2022": {
      "rels": [
        "permalink"
      ],
      "text": "\nDecember 31, 2022\n"
    },
    "https://werd.io/2022/christmas-the-eighth-night-and-me": {
      "rels": [
        "permalink"
      ],
      "text": "\nDecember 26, 2022\n"
    },
    "https://werd.io/2022/happy-last-minute-panic-shop-to-everyone-who": {
      "rels": [
        "permalink"
      ],
      "text": "\nDecember 24, 2022\n"
    },
    "https://werd.io/2022/any-sufficiently-advanced-technology-is-indistinguishable-from": {
      "rels": [
        "permalink"
      ],
      "text": "\nDecember 22, 2022\n"
    },
    "https://werd.io/2022/federated-communities-with-more-friction-will-make": {
      "rels": [
        "permalink"
      ],
      "text": "\nDecember 22, 2022\n"
    },
    "https://werd.io/2022/im-now-getting-roughly-20-30-approaches-about": {
      "rels": [
        "permalink"
      ],
      "text": "\nDecember 21, 2022\n"
    },
    "https://werd.io/2022/predictions-for-journalism-2023": {
      "rels": [
        "permalink"
      ],
      "text": "\nDecember 21, 2022\n"
    },
    "https://werd.io/2022/enough-about-twitter": {
      "rels": [
        "permalink"
      ],
      "text": "\nDecember 19, 2022\n"
    },
    "https://werd.io/2022/and-smaller-again": {
      "rels": [
        "permalink"
      ],
      "text": "\nDecember 19, 2022\n"
    },
    "https://werd.io/2022/own-your-posts-own-your-words-own": {
      "rels": [
        "permalink"
      ],
      "text": "\nDecember 19, 2022\n"
    },
    "https://werd.io/2022/the-twitter-walled-gardens-walls-get-taller": {
      "rels": [
        "permalink"
      ],
      "text": "\nDecember 18, 2022\n"
    },
    "https://werd.io/2022/i-dont-know-why-i-worried-this": {
      "rels": [
        "permalink"
      ],
      "text": "\nDecember 16, 2022\n"
    },
    "https://werd.io/2022/you-know-i-havent-been-to-the": {
      "rels": [
        "permalink"
      ],
      "text": "\nDecember 15, 2022\n"
    },
    "https://werd.io/2022/send-me-your-best-air-travel-with": {
      "rels": [
        "permalink"
      ],
      "text": "\nDecember 15, 2022\n"
    },
    "https://werd.io/2022/just-realized-that-maybe-some-people-think": {
      "rels": [
        "permalink"
      ],
      "text": "\nDecember 14, 2022\n"
    },
    "https://werd.io/2022/funding-open-source": {
      "rels": [
        "permalink"
      ],
      "text": "\nDecember 14, 2022\n"
    },
    "https://werd.io/2022/the-future-of-tv-depends-on-democratized-access-to-the": {
      "rels": [
        "permalink"
      ],
      "text": "\nDecember 14, 2022\n"
    },
    "https://werd.io/2022/the-woke-mind-virus": {
      "rels": [
        "permalink"
      ],
      "text": "\nDecember 12, 2022\n"
    },
    "https://example.com/microshare&gt": {
      "rels": [
        "in-reply-to"
      ],
      "text": "https://example.com/microshare&gt"
    },
    "https://werd.io/2022/building-an-open-share-button-for-the-distributed-social-web": {
      "rels": [
        "permalink"
      ],
      "text": "\nDecember 12, 2022\n"
    },
    "https://werd.io/2022/things-ive-learned-about-parenting": {
      "rels": [
        "permalink"
      ],
      "text": "\nDecember 11, 2022\n"
    },
    "https://werd.io/2022/ai-generated-content-on-medium": {
      "rels": [
        "permalink"
      ],
      "text": "\nDecember 9, 2022\n"
    },
    "https://werd.io/profile/benwerd?offset=0": {
      "rels": [
        "next"
      ],
      "title": "Newer",
      "text": "« Newer"
    },
    "https://werd.io/profile/benwerd?offset=25": {
      "rels": [
        "prev"
      ],
      "title": "Older",
      "text": "Older »"
    },
    "https://werd.io/vendor/npm-asset/mediaelement/build/mediaelementplayer.min.css": {
      "rels": [
        "stylesheet"
      ]
    }
  }
}