{
  "items": [
    {
      "type": [
        "h-card"
      ],
      "properties": {
        "url": [
          "https://werd.io/profile/benwerd",
          "https://werd.io/profile/benwerd",
          "https://twitter.com/benwerd",
          "https://github.com/benwerd",
          "https://www.linkedin.com/in/benwerd",
          "https://werd.cloud/"
        ],
        "photo": [
          "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
        ],
        "profile": [
          "Ben Werdmüller"
        ],
        "name": [
          "Ben Werdmüller"
        ],
        "note": [
          {
            "html": "<div class=\"highlightedText\">\n<p><br></p>\n</div>",
            "value": ""
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmüller"
              ]
            },
            "value": "Ben Werdmüller"
          }
        ],
        "url": [
          "https://werd.io/2022/a-letter-to-my-mother-on-the-event-of-my"
        ],
        "published": [
          "2022-09-10T17:21:22+00:00"
        ],
        "name": [
          "A letter to my mother on the event of my child's birth"
        ],
        "content": [
          {
            "html": "<p><img src=\"https://werd.io/file/631cc6d5a28be30a9d6d4ac2\" alt=\"\" width=\"1024\" height=\"684\"></p>\n<p>Dear Ma,</p>\n<p>My child was born last Friday. I wish you could meet them.</p>\n<p>The first time I saw their face in person (strikingly similar to their 3D ultrasound, but <em>here</em>, not an echo of a person but a real-life human being in front of me), they couldn’t breathe. The doctors whisked them away to a table, and I followed quickly, dumbly, the delirium from sleeplessness and from the surrealism of it all instantly snapping into pure, adrenaline-fueled presence. They put a mask on their face and applied pressure to their lungs, asking each other why they weren’t crying. Finally, there was a sound, like a tiny grunt. And then a little sigh. Finally, they opened up into a small cry; then, another, louder one. The smallest little human I’ve ever seen, finally arrived. I fell in love immediately.</p>\n<p>The last time I saw you, just over a year ago, you were in a bed in the same institution, your donated lungs breathing fainter and fainter. I kissed you on the forehead and told you I loved you. You’d told me that what you wanted to hear was us talking amongst ourselves; to know that we’d continue without you. In the end, that’s what happened. But I miss you terribly: I feel the grief of losing you every day, and never more than when my child was born.</p>\n<p>They’re so incredibly cute. I just want you to see.</p>\n<p><img src=\"https://werd.io/file/631cc705ed8e946fe733d512\" alt=\"\" width=\"1024\" height=\"683\"></p>\n<p>I’ve been thinking about the cassette tape recording we have of when I was born. “It’s a baby!” you exclaimed, and we’ve always thought it was funny, because what else would it be? But I now understand that the enormity of that moment is stunning: a potential human made up of ideas and imagination, that we can only guess about, turns into a real-life human being. It’s a baby. Holy <em>shit</em>. Everything suddenly changes. <em>Everything.</em></p>\n<p>(I want to digitize that recording. Tapes degrade. It might even be gone already.)</p>\n<p>You were always so <em>good</em> with children. Famously so. Babies loved you; children loved you. Every photo I have of you with a child is of you looking delightedly at each other, fully present in a joyful interaction. When you did your career about-face and became a schoolteacher, it was the most natural thing in the world, because it just made official what you’d always done. Of course, I saw the benefit of that care and love, too. I wish they were able to feel it directly. As it is, in this worse universe that doesn’t have you in it, I’ve been intentionally trying to channel you. I’ve been trying to imagine how you would have shown up with them, and what your advice for me would have been. I’ve been trying to convey that good-humored warmth I always felt. You made me feel safe: physically, yes, but more than that, <em>emotionally</em>. I want to make them feel safe, too: to be who they really are.</p>\n<p>They have the privilege of a tightly-knit family. I can’t wait to introduce them to my dad, and to my sister, who are the best people I know. I want them to be deeply involved in their life. You will be too, through us, but I wish it could be through a hug or smiles or belly-kisses.</p>\n<p>I guarantee you would have loved them. I guarantee they would have loved you.</p>\n<p>Erin’s quickly turned into such a good mother, Ma. She really is; you’d love it. She’s so attentive, and smart, and worried about them, and prepared in all kinds of ways that I would never think to be. So far, we’ve made a pretty good parenting team. There’s so much to learn, so much to get better at, so much to worry about. But she’s good. It’s fun to think of them having fond memories of her in the same way I have fond memories of you.</p>\n<p>It’s also weird to think of them thinking fondly of me in the same way I love my dad. Those bonds are strong. I have trouble thinking about <em>anyone</em> loving me deeply, but I know I <em>love</em> deeply, and my dad is one of the people I love the most, so the possibility is there. I hope I can live up to that for them. It’s scary to think about.</p>\n<p><img src=\"https://werd.io/file/631cc7353d66c06fe35a9a52/thumb.jpg\" alt=\"\" width=\"790\" height=\"1024\"></p>\n<p>I remember, very early on, going on a protest march with you. As a child, I inherited your buttons and proudly wore messages to ban the bomb and embrace renewable energy. (Those slogans seem like ancient history now, but also still so relevant.) Progressive values and the value of protest were normalized for me. Living in Oxford, we were surrounded by university, and you were both life-long students, so I was raised in an environment of debate and deep thought. Because I had parents who talked about the world, both around me and <em>to</em> me, I had a better sense of my place in it. I want that for them, too.</p>\n<p>We seem to be backsliding into a world where nationalism is a respected value, and where fierce individualism trumps all, even as we plunge deeper into a climate crisis whose only real solution is for us all to work together. We have to think globally, as one people, and we have to care for people on the other side of the globe as if they were our neighbor. We have to call out our own governments when they oppress others, at home or abroad, and we have to be forces for equitable, inclusive, collaborative kindness in a world that is dominated by competition and profit. We seem to have forgotten the importance of community, and of acting collectively - or, worse, <em>rejected</em> it, as if being an actively participative part of a fabric of interconnected souls somehow impedes our individuality. On the contrary, I think it uplifts us. In a world where we all have a duty of care for each other, we can more truly be ourselves.</p>\n<p>I got that from you.</p>\n<p>I wish those ideas were a given, but they’re going to have to fight for it. We’re constantly re-litigating the same arguments about religion, bodily autonomy, the climate, when we could be building on what we’ve learned to climb ever higher. Their world will have fewer resources, constrained by a heating planet. If it also continues to have widening inequality and an addiction to wealth hoarding, it will also have more conflict. It will be a worse place to live: more dangerous, more authoritarian, more brutal. “Building a better world for our children” is no longer an abstract sentiment for me, and my fear is that they will have this realization one day too: they may find himself wondering how to show up to make a safer, kinder world for <em>their</em> child.</p>\n<p>We need to make more progress.</p>\n<p>You described yourself as having been radicalized. That word means so many things: to me, your values were never radical. They were simply common sense. We need to take care of each other; we need to love our neighbors, and understand that <em>everyone</em> is our neighbor; we need to undo systems of oppression and inequality. You worked for affirmative action and stood up in court to establish and protect the rights of tenants over landlords. You marched and donated to causes and let your worldview be known. You were a force of light in the universe, not just for how you acted towards everyone who knew you, but how you showed up in the context of wider systems. If you were radicalized, I guess I hope I am too.</p>\n<p>You had no time for people who didn’t care about others: hardcore conservatives, neo-reactionaries, libertarians, and fascists. You cared about fairness and inequality. You were an ardent feminist. You were an anticapitalist. You believed in true representative democracy. You continued to learn and evolve your understanding of systems of oppression. I love all of those things about you - just a fraction of all the things I love about you. I want to model that way of thinking and acting for my child.</p>\n<p>I want them to have broad horizons, and to understand that all of this - <em>everything</em> - can be changed for the better. Change is inevitable; <em>how</em> we change is up for grabs.</p>\n<p>You were always so flexible: so up for the adventure. You traveled thousands of miles to have me in Europe. By the time I was three years old, I’d lived in four cities. As time goes by, I’m more and more impressed by your ability and willingness to just up and leave and try something new. My life has been much better off for it. I think <em>your</em> life was much better off for it.</p>\n<p><img src=\"https://werd.io/file/631cc759ed8e946fe733d514\" alt=\"\" width=\"1024\" height=\"714\"></p>\n<p>Remember living in Oxford? You had that upstairs office above <em>Daily Information</em>, where you’d work on predictions for the telecoms industry - you predicted the rise of cellphones, home internet, ubiquitous broadband - while our Jack Russell terrier, Tessie, would patiently sit in her bed. At noon precisely, she would walk over to you to let you know it was time to take a break, and you’d take her on a walk to Port Meadow. Both you and my dad took classes when you wanted to, often just to improve your knowledge for its own sake; you didn’t have to worry about return on investment, or healthcare or education costs for your family. It all just <em>worked</em>, so simply. I miss that lifestyle. I miss the peace of it all: the lack of fear that comes from real support.</p>\n<p>So I’m now faced with a similar question to the one you must have been considering. The US is such a big country, and it contains so much, but it’s also so <em>isolated</em>, and by extension, so <em>isolationist</em>. Save for tribal nations, you can drive for thousands of miles without hitting another country. It would be easy to grow up here and have a very insular worldview: look at all the people who swear blind that “America is the best country on earth” but have never lived or spent much time anywhere else, and who consider blind patriotism to be a virtue rather than the cult-like ignorance it is.</p>\n<p>When we build software, we learn that the settings we choose to be the defaults are incredibly impactful: those defaults permanently affect how someone will use the product you’ve made. It seems to me that this is even more true in life. Regardless of the choices they make later in life, the defaults I give my child will permanently affect their worldview. By traveling around and seeing the way different people live, not on a tour bus but immersively over time, we learn that there are lots of valid alternatives; we meet and get to know lots of ways of being, and understand that ours is not better than theirs. If we don’t, I’m worried that the way the community around us lives becomes the default, and that the rest of the world becomes a little scary. My child has multiple passports to draw on; they will have the ability to live in, or at least visit, so many places. It would be such a missed opportunity to not give them that perspective. The more easily we can all relate to people from different nations, the easier it will be to have a globally-minded, kinder world.</p>\n<p>Make no mistake: I know you would want me to make sure they see alternatives to living like we do here, and I will make sure that I do. So much is wrong. Every school shooting is shocking, but the safety drills they make children do are almost as terrifying; the ideas that are traded as normal are so brutal. Violence is ingrained everywhere. What kind of country watches little bodies be slaughtered and refuses to take any kind of meaningful action? We still kill prisoners. The police commit murder. And we call this civilization? I don’t want my child to grow up thinking any of this is normal. They need to see that it’s a uniquely American problem by spending a lot of time outside of America.</p>\n<p>But for all they can learn from it, international travel itself has a climate impact that is worsening the conditions that will make life harder for them over the coming decades. I don’t know how to reconcile that: I don’t think the world is better if people don’t travel. You often told stories of the times you lived in Italy, or Israel, or the UK before I was born. Your parents visited countries all over the world and often took you with them. We traveled often around Europe in particular. Maybe it’s because I inherited that background, or because our own relocations made my sense of place less tethered, but I think the ability to see the world face-to-face should be as accessible as possible.</p>\n<p>I think you’d have a smart way to think about that, or to look at it from another angle. You might, I think rightly, point out that the bulk of the climate crisis lies in the hands of corporations and industry. That they spend time and dollars on casting the blame elsewhere. But you’d also care and worry about your own contribution: you wanted an electric car before most, you wanted solar, you supported renewable energy and the politicians who supported it.</p>\n<p><img src=\"https://werd.io/file/631cc78aba895c60c87ba032/thumb.jpg\" alt=\"\" width=\"768\" height=\"1024\"></p>\n<p>As I write you this, my child is fast asleep, lying skin-to-skin on his mother. His face is unbothered by any stress or worry. He hardly cries. When he wakes up, I’ll check his nappy, keep him clean, and we’ll feed him. We’ll talk to him, and play with him, and sing and tell him we love him, and let him drift back off into slumber.</p>\n<p>There are people in the world who would wish this sweetest human harm. They’re part-Jewish; they’re from more than one place; they are not being raised to believe in a religion; they are going to be raised to be in opposition to wealth hoarders and rent-seekers and nationalists, in a culture of broad, inclusive love. These would-be-objectionable traits are all the products of dead-end mindsets that should have withered away in the 20th century. With a small amount of luck they’ll live to see the first decades of the 22nd century, and I imagine those ideas still be with us then. But I hope they will be fringe by then, and I hope my child has a part to play in their demise. They do not deserve to define what the rest of us do.</p>\n<p>I grew up knowing that my father and his family lived through a concentration camp when he was just a toddler; that my maternal grandfather was captured by the Nazis and thought dead; that my great grandfather escaped White Army pogroms in Ukraine. I heard my grandmother screaming through the walls every night as her dreams took her back. Through my family and the ripples trauma leaves across generations, I understand the consequences of hate. And I understand that the definition of “fascist” isn’t predicated on death camps and goose-stepping; it isn’t set in the early 20th century. It’s a mindset rooted in nationalism, tribalism, and the noxious idea that some people are inherently better than others. It’s an idea that did not go away at the close of the Second World War, is not limited to any nation (of <em>course</em> Americans can be fascist), and is so pernicious that my child and <em>their</em> children will both need to be aware of its toxicity, long into the future.</p>\n<p>The period we’re living through now may be just the very beginning stages of a world with fewer resources controlled by ever-fewer people, who will use increasingly-authoriarian methods and appeals to existing divisions to try and maintain their holdings at the expense of others. Ma, the only way I can see through this is by living how you did: with kindness, by not holding back our opinions, and by active work to make everything better.</p>\n<p>You showed me the way. I’ll try and do my best.</p>\n<p>I love you. I miss you. I wish you were here.</p>\n<p><img src=\"https://werd.io/file/631cc7c9e936c75e18564b93/thumb.jpg\" alt=\"\" width=\"683\" height=\"1024\"></p>",
            "value": "Dear Ma,My child was born last Friday. I wish you could meet them.The first time I saw their face in person (strikingly similar to their 3D ultrasound, but here, not an echo of a person but a real-life human being in front of me), they couldn’t breathe. The doctors whisked them away to a table, and I followed quickly, dumbly, the delirium from sleeplessness and from the surrealism of it all instantly snapping into pure, adrenaline-fueled presence. They put a mask on their face and applied pressure to their lungs, asking each other why they weren’t crying. Finally, there was a sound, like a tiny grunt. And then a little sigh. Finally, they opened up into a small cry; then, another, louder one. The smallest little human I’ve ever seen, finally arrived. I fell in love immediately.The last time I saw you, just over a year ago, you were in a bed in the same institution, your donated lungs breathing fainter and fainter. I kissed you on the forehead and told you I loved you. You’d told me that what you wanted to hear was us talking amongst ourselves; to know that we’d continue without you. In the end, that’s what happened. But I miss you terribly: I feel the grief of losing you every day, and never more than when my child was born.They’re so incredibly cute. I just want you to see.  I’ve been thinking about the cassette tape recording we have of when I was born. “It’s a baby!” you exclaimed, and we’ve always thought it was funny, because what else would it be? But I now understand that the enormity of that moment is stunning: a potential human made up of ideas and imagination, that we can only guess about, turns into a real-life human being. It’s a baby. Holy shit. Everything suddenly changes. Everything.(I want to digitize that recording. Tapes degrade. It might even be gone already.)You were always so good with children. Famously so. Babies loved you; children loved you. Every photo I have of you with a child is of you looking delightedly at each other, fully present in a joyful interaction. When you did your career about-face and became a schoolteacher, it was the most natural thing in the world, because it just made official what you’d always done. Of course, I saw the benefit of that care and love, too. I wish they were able to feel it directly. As it is, in this worse universe that doesn’t have you in it, I’ve been intentionally trying to channel you. I’ve been trying to imagine how you would have shown up with them, and what your advice for me would have been. I’ve been trying to convey that good-humored warmth I always felt. You made me feel safe: physically, yes, but more than that, emotionally. I want to make them feel safe, too: to be who they really are.They have the privilege of a tightly-knit family. I can’t wait to introduce them to my dad, and to my sister, who are the best people I know. I want them to be deeply involved in their life. You will be too, through us, but I wish it could be through a hug or smiles or belly-kisses.I guarantee you would have loved them. I guarantee they would have loved you.Erin’s quickly turned into such a good mother, Ma. She really is; you’d love it. She’s so attentive, and smart, and worried about them, and prepared in all kinds of ways that I would never think to be. So far, we’ve made a pretty good parenting team. There’s so much to learn, so much to get better at, so much to worry about. But she’s good. It’s fun to think of them having fond memories of her in the same way I have fond memories of you.It’s also weird to think of them thinking fondly of me in the same way I love my dad. Those bonds are strong. I have trouble thinking about anyone loving me deeply, but I know I love deeply, and my dad is one of the people I love the most, so the possibility is there. I hope I can live up to that for them. It’s scary to think about.  I remember, very early on, going on a protest march with you. As a child, I inherited your buttons and proudly wore messages to ban the bomb and embrace renewable energy. (Those slogans seem like ancient history now, but also still so relevant.) Progressive values and the value of protest were normalized for me. Living in Oxford, we were surrounded by university, and you were both life-long students, so I was raised in an environment of debate and deep thought. Because I had parents who talked about the world, both around me and to me, I had a better sense of my place in it. I want that for them, too.We seem to be backsliding into a world where nationalism is a respected value, and where fierce individualism trumps all, even as we plunge deeper into a climate crisis whose only real solution is for us all to work together. We have to think globally, as one people, and we have to care for people on the other side of the globe as if they were our neighbor. We have to call out our own governments when they oppress others, at home or abroad, and we have to be forces for equitable, inclusive, collaborative kindness in a world that is dominated by competition and profit. We seem to have forgotten the importance of community, and of acting collectively - or, worse, rejected it, as if being an actively participative part of a fabric of interconnected souls somehow impedes our individuality. On the contrary, I think it uplifts us. In a world where we all have a duty of care for each other, we can more truly be ourselves.I got that from you.I wish those ideas were a given, but they’re going to have to fight for it. We’re constantly re-litigating the same arguments about religion, bodily autonomy, the climate, when we could be building on what we’ve learned to climb ever higher. Their world will have fewer resources, constrained by a heating planet. If it also continues to have widening inequality and an addiction to wealth hoarding, it will also have more conflict. It will be a worse place to live: more dangerous, more authoritarian, more brutal. “Building a better world for our children” is no longer an abstract sentiment for me, and my fear is that they will have this realization one day too: they may find himself wondering how to show up to make a safer, kinder world for their child.We need to make more progress.You described yourself as having been radicalized. That word means so many things: to me, your values were never radical. They were simply common sense. We need to take care of each other; we need to love our neighbors, and understand that everyone is our neighbor; we need to undo systems of oppression and inequality. You worked for affirmative action and stood up in court to establish and protect the rights of tenants over landlords. You marched and donated to causes and let your worldview be known. You were a force of light in the universe, not just for how you acted towards everyone who knew you, but how you showed up in the context of wider systems. If you were radicalized, I guess I hope I am too.You had no time for people who didn’t care about others: hardcore conservatives, neo-reactionaries, libertarians, and fascists. You cared about fairness and inequality. You were an ardent feminist. You were an anticapitalist. You believed in true representative democracy. You continued to learn and evolve your understanding of systems of oppression. I love all of those things about you - just a fraction of all the things I love about you. I want to model that way of thinking and acting for my child.I want them to have broad horizons, and to understand that all of this - everything - can be changed for the better. Change is inevitable; how we change is up for grabs.You were always so flexible: so up for the adventure. You traveled thousands of miles to have me in Europe. By the time I was three years old, I’d lived in four cities. As time goes by, I’m more and more impressed by your ability and willingness to just up and leave and try something new. My life has been much better off for it. I think your life was much better off for it.  Remember living in Oxford? You had that upstairs office above Daily Information, where you’d work on predictions for the telecoms industry - you predicted the rise of cellphones, home internet, ubiquitous broadband - while our Jack Russell terrier, Tessie, would patiently sit in her bed. At noon precisely, she would walk over to you to let you know it was time to take a break, and you’d take her on a walk to Port Meadow. Both you and my dad took classes when you wanted to, often just to improve your knowledge for its own sake; you didn’t have to worry about return on investment, or healthcare or education costs for your family. It all just worked, so simply. I miss that lifestyle. I miss the peace of it all: the lack of fear that comes from real support.So I’m now faced with a similar question to the one you must have been considering. The US is such a big country, and it contains so much, but it’s also so isolated, and by extension, so isolationist. Save for tribal nations, you can drive for thousands of miles without hitting another country. It would be easy to grow up here and have a very insular worldview: look at all the people who swear blind that “America is the best country on earth” but have never lived or spent much time anywhere else, and who consider blind patriotism to be a virtue rather than the cult-like ignorance it is.When we build software, we learn that the settings we choose to be the defaults are incredibly impactful: those defaults permanently affect how someone will use the product you’ve made. It seems to me that this is even more true in life. Regardless of the choices they make later in life, the defaults I give my child will permanently affect their worldview. By traveling around and seeing the way different people live, not on a tour bus but immersively over time, we learn that there are lots of valid alternatives; we meet and get to know lots of ways of being, and understand that ours is not better than theirs. If we don’t, I’m worried that the way the community around us lives becomes the default, and that the rest of the world becomes a little scary. My child has multiple passports to draw on; they will have the ability to live in, or at least visit, so many places. It would be such a missed opportunity to not give them that perspective. The more easily we can all relate to people from different nations, the easier it will be to have a globally-minded, kinder world.Make no mistake: I know you would want me to make sure they see alternatives to living like we do here, and I will make sure that I do. So much is wrong. Every school shooting is shocking, but the safety drills they make children do are almost as terrifying; the ideas that are traded as normal are so brutal. Violence is ingrained everywhere. What kind of country watches little bodies be slaughtered and refuses to take any kind of meaningful action? We still kill prisoners. The police commit murder. And we call this civilization? I don’t want my child to grow up thinking any of this is normal. They need to see that it’s a uniquely American problem by spending a lot of time outside of America.But for all they can learn from it, international travel itself has a climate impact that is worsening the conditions that will make life harder for them over the coming decades. I don’t know how to reconcile that: I don’t think the world is better if people don’t travel. You often told stories of the times you lived in Italy, or Israel, or the UK before I was born. Your parents visited countries all over the world and often took you with them. We traveled often around Europe in particular. Maybe it’s because I inherited that background, or because our own relocations made my sense of place less tethered, but I think the ability to see the world face-to-face should be as accessible as possible.I think you’d have a smart way to think about that, or to look at it from another angle. You might, I think rightly, point out that the bulk of the climate crisis lies in the hands of corporations and industry. That they spend time and dollars on casting the blame elsewhere. But you’d also care and worry about your own contribution: you wanted an electric car before most, you wanted solar, you supported renewable energy and the politicians who supported it.  As I write you this, my child is fast asleep, lying skin-to-skin on his mother. His face is unbothered by any stress or worry. He hardly cries. When he wakes up, I’ll check his nappy, keep him clean, and we’ll feed him. We’ll talk to him, and play with him, and sing and tell him we love him, and let him drift back off into slumber.There are people in the world who would wish this sweetest human harm. They’re part-Jewish; they’re from more than one place; they are not being raised to believe in a religion; they are going to be raised to be in opposition to wealth hoarders and rent-seekers and nationalists, in a culture of broad, inclusive love. These would-be-objectionable traits are all the products of dead-end mindsets that should have withered away in the 20th century. With a small amount of luck they’ll live to see the first decades of the 22nd century, and I imagine those ideas still be with us then. But I hope they will be fringe by then, and I hope my child has a part to play in their demise. They do not deserve to define what the rest of us do.I grew up knowing that my father and his family lived through a concentration camp when he was just a toddler; that my maternal grandfather was captured by the Nazis and thought dead; that my great grandfather escaped White Army pogroms in Ukraine. I heard my grandmother screaming through the walls every night as her dreams took her back. Through my family and the ripples trauma leaves across generations, I understand the consequences of hate. And I understand that the definition of “fascist” isn’t predicated on death camps and goose-stepping; it isn’t set in the early 20th century. It’s a mindset rooted in nationalism, tribalism, and the noxious idea that some people are inherently better than others. It’s an idea that did not go away at the close of the Second World War, is not limited to any nation (of course Americans can be fascist), and is so pernicious that my child and their children will both need to be aware of its toxicity, long into the future.The period we’re living through now may be just the very beginning stages of a world with fewer resources controlled by ever-fewer people, who will use increasingly-authoriarian methods and appeals to existing divisions to try and maintain their holdings at the expense of others. Ma, the only way I can see through this is by living how you did: with kindness, by not holding back our opinions, and by active work to make everything better.You showed me the way. I’ll try and do my best.I love you. I miss you. I wish you were here."
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmüller"
              ]
            },
            "value": "Ben Werdmüller"
          }
        ],
        "url": [
          "https://werd.io/2022/hot-take-empires-are-bad-and-symbols"
        ],
        "published": [
          "2022-09-10T03:35:06+00:00"
        ],
        "name": [
          "Hot take: empires are bad and symbols of empires are bad."
        ],
        "content": [
          {
            "html": "Hot take: empires are bad and symbols of empires are bad.",
            "value": "Hot take: empires are bad and symbols of empires are bad."
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmüller"
              ]
            },
            "value": "Ben Werdmüller"
          }
        ],
        "url": [
          "https://werd.io/2022/having-a-dedicated-woman-as-head-of"
        ],
        "published": [
          "2022-09-08T19:22:06+00:00"
        ],
        "name": [
          "Having a dedicated woman as Head of State for seventy years undeniably had an impact on British society in both subtle and overt ways."
        ],
        "content": [
          {
            "html": "Having a dedicated woman as Head of State for seventy years undeniably had an impact on British society in both subtle and overt ways.",
            "value": "Having a dedicated woman as Head of State for seventy years undeniably had an impact on British society in both subtle and overt ways."
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmüller"
              ]
            },
            "value": "Ben Werdmüller"
          }
        ],
        "url": [
          "https://werd.io/2022/okay-but-how-does-this-affect-the"
        ],
        "published": [
          "2022-09-08T19:05:35+00:00"
        ],
        "name": [
          "Okay, but how does this affect the new season of Bake Off?"
        ],
        "content": [
          {
            "html": "Okay, but how does this affect the new season of Bake Off?",
            "value": "Okay, but how does this affect the new season of Bake Off?"
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmüller"
              ]
            },
            "value": "Ben Werdmüller"
          }
        ],
        "url": [
          "https://werd.io/2022/two-opinions-i-think-the-monarchy-is"
        ],
        "published": [
          "2022-09-08T15:51:24+00:00"
        ],
        "name": [
          "Two opinions: I think the monarchy is a disastrously archaic institution that needlessly clings to a brutal past. I also think, as far as monarchs go, that Queen Elizabeth II was among the best we could wish for, who did work worthy of respect and admiration."
        ],
        "content": [
          {
            "html": "Two opinions: I think the monarchy is a disastrously archaic institution that needlessly clings to a brutal past. I also think, as far as monarchs go, that Queen Elizabeth II was among the best we could wish for, who did work worthy of respect and admiration.",
            "value": "Two opinions: I think the monarchy is a disastrously archaic institution that needlessly clings to a brutal past. I also think, as far as monarchs go, that Queen Elizabeth II was among the best we could wish for, who did work worthy of respect and admiration."
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmüller"
              ]
            },
            "value": "Ben Werdmüller"
          }
        ],
        "url": [
          "https://werd.io/2022/day-six-i-now-understand-that-what"
        ],
        "published": [
          "2022-09-08T15:02:44+00:00"
        ],
        "name": [
          "Day six. I now understand that what I have in my possession is not a baby but a highly advanced projectile weapon. Rather than take this stunningly destructive technology to market, I shall hoard its power for myself. I may require additional wet wipes."
        ],
        "content": [
          {
            "html": "Day six. I now understand that what I have in my possession is not a baby but a highly advanced projectile weapon. Rather than take this stunningly destructive technology to market, I shall hoard its power for myself. I may require additional wet wipes.",
            "value": "Day six. I now understand that what I have in my possession is not a baby but a highly advanced projectile weapon. Rather than take this stunningly destructive technology to market, I shall hoard its power for myself. I may require additional wet wipes."
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmüller"
              ]
            },
            "value": "Ben Werdmüller"
          }
        ],
        "url": [
          "https://werd.io/2022/this-labor-day-im-thinking-about-my"
        ],
        "published": [
          "2022-09-05T23:32:40+00:00"
        ],
        "name": [
          "This Labor Day, I’m thinking about my Great Grandpa Dave, who was the PA Joint Branch manager of the Amalgamated Clothing Workers Union of America. Unions are strong in my family; I learned early about why they’re vital. I’m excited to pass those values to my son."
        ],
        "content": [
          {
            "html": "This Labor Day, I’m thinking about my Great Grandpa Dave, who was the PA Joint Branch manager of the Amalgamated Clothing Workers Union of America. Unions are strong in my family; I learned early about why they’re vital. I’m excited to pass those values to my son.",
            "value": "This Labor Day, I’m thinking about my Great Grandpa Dave, who was the PA Joint Branch manager of the Amalgamated Clothing Workers Union of America. Unions are strong in my family; I learned early about why they’re vital. I’m excited to pass those values to my son."
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmüller"
              ]
            },
            "value": "Ben Werdmüller"
          }
        ],
        "url": [
          "https://werd.io/2022/reading-watching-playing-using-august-2022"
        ],
        "published": [
          "2022-09-05T21:41:38+00:00"
        ],
        "name": [
          "Reading, watching, playing, using: August, 2022"
        ],
        "content": [
          {
            "html": "<p>Happy Labor Day to everyone who celebrates the organized labor movement today in the US. This is my monthly roundup of the books, articles, and streaming media I found interesting. Here's my list for August, 2022.</p>\n<p>A note: it’s taken me a while to hit publish on this post because our son was born on September 2nd. We instantly fell in love. More on that soon. For now, please understand if my posting frequency plummets for a little while.</p>\n<h3>Books</h3>\n<h4>Fiction</h4>\n<p><a href=\"https://bookshop.org/a/7949/9781982156121\">The School for Good Mothers, by Jessamine Chan.</a> A ton of ideas about parenting, society, and the present moment, crammed into an emotional near-future science fiction story. I wish the protagonist had been more sympathetic - but the future it paints is alarmingly plausible.</p>\n<h3>Notable Articles</h3>\n<h4>Business</h4>\n<p><a href=\"https://nytimes.com/interactive/2022/08/14/business/worker-productivity-tracking.html\">Workplace Productivity: Are You Being Tracked?</a> “Two years ago, her employer started requiring chaplains to accrue more of what it called “productivity points.” A visit to the dying: as little as one point. Participating in a funeral: one and three-quarters points. A phone call to grieving relatives: one-quarter point.”</p>\n<p><a href=\"https://finance.yahoo.com/news/organized-labor-movement-ally-venture-152004413.html?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cubWV0YWZpbHRlci5jb20v&amp;guce_referrer_sig=AQAAADgYLbyiJPaPKz68KC7_c6jU0guFsLG3UqgLYxgOQ0AjFEIPzC6TcWqquzoKIAEsGA0n56U4no6F5u3dAmTeJzATonKlQfeq_fcNccr18iSxiNXQxlBAPtCkQIZIijDzgVs6Ui5vgYuIHIrdjIQH8WallWrCc1w-o5X5XcUHGPEa\">The organized labor movement has a new ally: venture capitalists.</a> “White’s solution is to plan an “exit to community.” Once the company starts earning income, it plans to buy out its investors and give their equity to the unions it helped organize, effectively transitioning corporate control to the customer base.”</p>\n<p><a href=\"https://popular.info/p/american-express-platinum-level-duplicity\">American Express' platinum-level duplicity.</a> “American Express’ decision to begin donating to Republican objectors reflects the desire of some in the business community to put the events of January 6, 2021, behind them. That, according to an open letter recently signed by former American Express CEO Kenneth Chenault and other prominent business leaders, is a big mistake.”</p>\n<p><a href=\"https://protocol.com/fintech/varo-layoffs-neobank-profit\">Varo layoffs are a sign of neobanks’ struggle to break even.</a> ““Most American neobanks cater to lower-income customers, who previously may have incurred overdraft, [non-sufficient fund fees] and maintenance fees at big establishment banks,” Mikula told Protocol. “But these consumers also tend to be higher credit risk, making it challenging to lend to them. No U.S. neobank has built a meaningful lending business.””</p>\n<h4>Climate</h4>\n<p><a href=\"https://nytimes.com/2022/08/24/climate/california-gas-cars-emissions.html?smtyp=cur\">California to Ban the Sale of New Gasoline Cars.</a> “The rule, issued by the California Air Resources Board, will require that all new cars sold in the state by 2035 be free of greenhouse gas emissions like carbon dioxide. The rule also sets interim targets, requiring that 35 percent of new passenger vehicles sold by 2026 produce zero emissions. That requirement climbs to 68 percent by 2030.”</p>\n<p><a href=\"https://grist.org/climate/the-temperature-threshold-the-human-body-cant-survive\">The temperature threshold the human body can't survive.</a> “When the wet bulb temperature gets above 95 degrees F, our bodies lose their ability to cool down, and the consequences can be deadly. Until recently, scientists didn’t think we’d cross that threshold outside of doomsday climate change scenarios. But a 2020 study looking at detailed weather records around the world found we’ve already crossed the threshold at least 14 times in the last 40 years.”</p>\n<p><a href=\"https://19thnews.org/2022/08/women-are-working-to-make-the-clean-energy-transition-more-equitable\">Women are working to make the clean energy transition more equitable.</a> “Women are disproportionately facing the impacts of the climate crisis: They are more likely to be displaced by climate disasters, and due to lower-paid jobs, caregiving responsibilities and the wage gap, they have less economic means to recover and adapt to a changing climate.”</p>\n<h4>Crypto</h4>\n<p><a href=\"https://forbes.com/sites/javierpaz/2022/08/26/more-than-half-of-all-bitcoin-trades-are-fake/?sh=286a625c6681\">More Than Half Of All Bitcoin Trades Are Fake.</a> “More than half of all reported trading volume is likely to be fake or non-economic. Forbes estimates the global daily bitcoin volume for the industry was $128 billion on June 14. That is 51% less than the $262 billion one would get by taking the sum of self-reported volume from multiple sources.”</p>\n<p><a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4184367\">Insider Trading in Cryptocurrency Markets.</a> “We find evidence of systematic insider trading in cryptocurrency markets, where individuals use private information to buy coins prior to exchange listing announcements. Our analysis shows significant price run-ups before official listing announcements, similar to prosecuted cases of insider trading in stock markets.”</p>\n<p><a href=\"https://decrypt.co/106986/treasury-blacklists-bans-tornado-cash-ethereum-mixer\">Feds Blacklist Tornado Cash, Ban Ethereum Mixing Tool in US.</a> “In a Monday announcement, the body added the Tornado Cash website and a long list of Ethereum addresses to its Specially Designated Nationals list, banning American citizens from using the tool or transacting with these addresses.”</p>\n<p><a href=\"https://bloomberg.com/news/articles/2022-08-01/pearson-hopes-blockchain-will-make-it-money-every-time-its-e-books-change-hands\">Pearson Sees NFT, Blockchain Helping Making Money From E-Books Sales.</a> “The chief executive officer of Pearson Plc, one of the world’s largest textbook publishers, said he hopes technology like non-fungible tokens and the blockchain could help the company take a cut from secondhand sales of its materials as more books go online.”</p>\n<h4>Culture</h4>\n<p><a href=\"https://19thnews.org/2022/08/lgbtq-young-adult-books-popularity-recommendations\">Queer YA books are selling in record numbers despite bans targeting them.</a> “Of the close to 5 million units of LGBTQ+ books sold in 2021, the biggest absolute gains in this market came from LGBTQ+ YA books, which saw an increase in sales of 1.3 million units from the previous year. Queer YA is more popular than ever — no longer a niche category, but redefining what is mainstream for teen readers.”</p>\n<p><a href=\"https://19thnews.org/2022/08/book-bans-limitations-school-districts-soft-censorship\">As list of banned books in schools grows, ‘soft’ censorship is spreading.</a> “Free speech advocates say these practices are as troubling as bans — particularly when the books singled out overwhelmingly have themes related to race, gender and sexuality and are written by authors who are women, LGBTQ+ and/or people of color.”</p>\n<p><a href=\"https://facebook.com/billybraggofficial/posts/pfbid0aLnM8Zgu68XmxBNG5QgCRULsqA1X9js8wB6BQwShAZT1zhQhVdNf4XCF5RZU1hF5l\">Billy Bragg on the difference between the backlash to Salman Rushdie and Jerry Sadowitz.</a> “Over the past decade or so, Rushdie has sought to return to some sort of a normal life, despite the threat hanging over him. The fact that he continued to take the stage at literary events is a tribute to his belief in freedom of expression and he has been rightly commended for his bravery.”</p>\n<p><a href=\"https://cultbox.co.uk/news/headlines/doctor-who-casting-director-were-casting-more-disabled-actors\">Doctor Who casting director: \"We’re casting more disabled actors\".</a> “It’s more interesting. Also, if you can’t cast diversely on Doctor Who, what show can you do it on? It goes everywhere, on this planet and others, and you don’t want to see the same kind of people all the time. You don’t want it to be exclusively middle-class white people speaking with RP accents.”</p>\n<p><a href=\"https://winnielim.org/journal/on-leading-a-purposeless-life\">on leading a purposeless life.</a> “Maybe it is okay to not pursue potential and just be okay with being. Why must there be a reason for everything?” Beautiful.</p>\n<p><a href=\"https://apnews.com/article/salman-rushdie-attacked-9eae99aea82cb0d39628851ecd42227a?taid=62f66e7da3b3e500018694a5\">Author Salman Rushdie attacked on lecture stage in New York.</a> “He has said he is proud of his fight for freedom of expression, saying in a 2012 talk in New York that terrorism is really the art of fear.”</p>\n<p><a href=\"https://vulture.com/article/jake-novak-snl-tiktok-video-interview.html\">Interview: Jake Novak on His Infamous SNL TikTok Video.</a> “Honestly, as horrible as the internet has been to me in the past six weeks, I have really enjoyed this hiatus. I’m getting to see my friends more and just have more meaningful experiences in real life.”</p>\n<h4>Democracy</h4>\n<p><a href=\"https://nytimes.com/2022/08/30/opinion/student-loan-debt-relief-biden.html\">Why I Changed My Mind on Student Debt Forgiveness.</a> “It is simply impossible for students to work their way through college in the way previous generations could. And at the same time, states have reduced funding to their public colleges that historically allowed schools to charge low tuition prices.”</p>\n<p><a href=\"https://cleveland.com/news/2022/08/we-reject-the-free-speech-trampling-rules-set-by-jd-vance-and-ron-desantis-for-covering-their-rally-letter-from-the-editor.html\">We reject the free speech-trampling rules set by J.D. Vance and Ron DeSantis for covering their rally.</a> “Think about what they were doing here. They were staging an event to rally people to vote for Vance while instituting the kinds of policies you’d see in a fascist regime.”</p>\n<p><a href=\"https://independent.co.uk/news/world/americas/whole-foods-b2143359.html\">John Mackey: Whole Foods CEO says ‘socialists are taking over’ schools and gun control debate.</a> ““My concern is that I feel like socialists are taking over,” the multi-millionaire organic grocery magnate said. “They’re marching through the institutions. They’re… taking over education. It looks like they’ve taken over a lot of the corporations. It looks like they’ve taken over the military. And it’s just continuing.””</p>\n<p><a href=\"https://19thnews.org/2022/08/doug-emhoff-second-gentleman-women-gender-equity\">Second Gentleman Doug Emhoff leans in to being a voice for gender equity.</a> “Emhoff is the first second gentleman to the first woman vice president, and for him, tackling gender inequality in ways big and small felt like a natural, and critical, component of creating this role. He is actively attempting to model for others what it means to be an ally in actions, not just words.”</p>\n<p><a href=\"https://theconstitutionalist.org/2022/08/04/its-manly-man-summer-at-the-claremont-institute\">It's Manly Man Summer at the Claremont Institute.</a> “In a piece titled “Men and the Future of America,” Klingenstein praises senator Josh Hawley for a speech trumpeting the “masculine virtues.” And what are those? They are, according to Klingenstein, “stoicism, competitiveness, conquest, achievement and aggression.” These are qualities to be managed, not repressed, because repressing them turns them toxic, into “dysfunctional behaviors—crime, drugs, pornography, and the like.”” I find this ideology so repulsive, so baffling.</p>\n<p><a href=\"https://washingtonpost.com/nation/2022/07/24/claremont-john-eastman-trump\">How the Claremont Institute, home to Trump lawyer John Eastman, rose and fell.</a> “Lewis said he agreed with Claremont leaders that the country is locked in a cold civil war. “Our country is upside down,” he said. “It’s unrecognizable.” He praised the program and its focus on “the myth of systemic police racism.” […] “They’re trying to train people to take a kind of extreme populist right-wing ideology back with them to Washington.”“</p>\n<p><a href=\"https://19thnews.org/2022/08/biden-administration-abortion-idaho-executive-order\">After slow response, Biden administration ramps up abortion access protections.</a> “Helen Silverstein, head of the government and law department at Lafayette College, said that the administration’s actions this week were notable because they sent a clear — if delayed — signal to the Democratic base that the executive branch is taking access to reproductive health care seriously.”</p>\n<p><a href=\"https://politico.com/news/2022/08/04/viktor-orban-cpac-00049935\">Orbán gets warm CPAC reception after 'mixed race' speech blowback.</a> “The reaction to Orbán’s “mixed-race” remarks was “a little bit overblown,” Ede Vessey said, maintaining that the prime minister was referring to a stark clash of cultures that has taken place in some Western European countries that have accepted refugees from predominantly Muslim countries.”</p>\n<p><a href=\"https://19thnews.org/2022/08/election-officials-workers-harassment-senate-judiciary-hearing\">Senate Judiciary holds hearing on threats to election workers.</a> “Election officials from both the Democratic and Republican parties, as well as nonpartisan officials, testified at the hearing on election workers, a workforce that has received more attention after former President Donald Trump lied about widespread voter fraud in the 2020 election. As Trump considers another run for office in 2024, he has repeated unfounded claims about election security that election administrators say has made their work more difficult.”</p>\n<p><a href=\"https://19thnews.org/2022/08/justice-department-sues-idaho-abortion-ban\">Justice Department sues Idaho over abortion ban, citing ‘medical emergency’ violation.</a> ““The law thus places medical professionals in an impossible situation,” Gupta said. “They must either withhold stabilizing treatment required by EMTALA or risk felony prosecution and license revocation. In so doing, the law will chill providers’ willingness to perform abortions in emergency situations and will hurt patients.””</p>\n<p><a href=\"https://techdirt.com/2022/08/01/shotspotter-asks-court-to-hold-it-in-contempt-rather-than-turn-over-information-to-defense-lawyer\">ShotSpotter Asks Court To Hold It In Contempt Rather Than Turn Over Information To Defense Lawyer.</a> “It’s tough to say what a judge will find admissible, but ShotSpotter’s past history suggests it is willing in some cases to alter reports to justify arrests that have already occurred. If the PD contacted ShotSpotter post-arrest to get a report altered, it may show officers had no reasonable suspicion to stop the arrestee — a stop that resulted in his arrest.”</p>\n<p><a href=\"https://19thnews.org/2022/08/senator-tiara-mack-twerking-tiktok-video-response\">Sen. Tiara Mack says twerking video response has led to harassment, threats.</a> ““It’s been a whirlwind. Anywhere from misogynistic comments, racist comments, classist comments,” she said. “I’ve received death threats. I’ve received emails and phone calls of people calling me the n-word. I’ve received fatphobic comments. Just everything under the sun.””</p>\n<p><a href=\"https://19thnews.org/2022/08/republican-midterm-candidates-abortion-references\">Republican candidates are changing how they handle abortion after Roe v. Wade.</a> “Multiple Republican midterm candidates have removed from their campaign sites references to particularly strict anti-abortion stances, a shift from primary campaigning to the approaching general election and an indication of growing concern in the Republican Party over how to handle abortion policy post-Roe v. Wade.”</p>\n<h4>Health</h4>\n<p><a href=\"https://statnews.com/2022/08/31/u-s-life-expectancy-drops-sharply-the-second-consecutive-decline\">U.S. life expectancy drops sharply, the second consecutive decline.</a> “American Indian and Alaskan Native people have experienced a particularly precipitous drop in life expectancy since 2019, going from 71.8 to 65.2 years. This kind of loss is similar to the plunge seen for all Americans after the Spanish Flu.”</p>\n<p><a href=\"https://futurism.com/neoscope/children-leukemia-fracking-oil-cancer\">Kids Born Near Fracking Sites More Likely to Have Leukemia, Study Says.</a> “Children who are born near fracking sites are as much as three times more likely to be diagnosed with leukemia later on, according to new Yale research.”</p>\n<p><a href=\"https://19thnews.org/2022/08/black-trans-women-life-expectancy-false\">For years, Black trans women have been told their life expectancy is 35 years. That’s false.</a> “Willis says the statistic once communicated an urgency in the community. Today, she thinks trans people need more complicated stories.”</p>\n<p><a href=\"https://19thnews.org/2022/08/monkeypox-experts-debunk-myths-misinformation\">Experts debunk monkeypox myths as misinformation spreads.</a> “Can monkeypox spread on the subway? Can it kill like COVID-19? Experts respond to monkeypox myths and misconceptions.”</p>\n<p><a href=\"https://sfchronicle.com/opinion/openforum/article/COVID-coronavirus-pandemic-17355893.php\">Just because some people can pretend COVID is over, doesn’t mean it actually is.</a> “People are still dying of COVID and even more people are getting long COVID (which we’re seeing develop into myalgic encephalomyelitis for many long haulers, and trust me, you don’t want it). The CDC and Food and Drug Administration have mostly abdicated their responsibility to prevent infections, focusing only on serious illness and death, while ignoring long COVID and the impact of the virus on disabled people.”</p>\n<h4>Media</h4>\n<p><a href=\"https://mediaengagement.org/research/person-centered-terms-encourage-stigmatized-groups-trust-in-news\">Person-Centered Terms Encourage Stigmatized Groups’ Trust in News.</a> “Participants trusted articles that used person-centered terms for their group more than articles that used stigmatizing terms.” Understandably.</p>\n<p><a href=\"https://npr.org/2022/08/23/1118817023/new-york-times-race-employees-job-review-union\">People of color at 'New York Times' get lower ratings in job reviews, union says.</a> “While there were some fluctuation — on average, the performance of Black employees rose over the intervening years, while it declined for Latinos at the organization — white workers were consistently assessed as outperforming their peers.”</p>\n<p><a href=\"https://aspeninstitute.org/longform/healing-polarized-communities\">Healing Polarized Communities.</a> “We cannot begin bridging communities beyond our newsrooms without building — and supporting — more diverse communities within our newsrooms.” So proud to work here.</p>\n<p><a href=\"https://nytimes.com/2022/08/15/style/book-recommendations-flow-charts.html\">Choose Your Own Literary Adventure.</a> “The colorful recommendation chart, one of many that have rippled through the Twitter and Instagram feeds of book lovers, came from a small bookstore in Madison, Wis., called A Room of One’s Own. […] The charts seem to speak the internet’s language, one that meets people where they are by acknowledging that literature can be overwhelming, and people often don’t know where to start.”</p>\n<p><a href=\"https://washingtonpost.com/business/2022/08/15/lindemann-cambodian-investigation-architectural-digest/?fbclid=IwAR1FfRNXiSrVNbxincoRuxxalJgxGA2jszDuQ95rO2Nf0Nih2m7DxH8oYjs\">A luxury magazine photo hid relics Cambodia says could be stolen.</a> For me the lede here is: Architectural Digest appears to have deliberately run a photo altered to hide the fact that an article’s subject owns stolen Cambodian artifacts.</p>\n<p><a href=\"https://nytimes.com/2022/08/14/business/media/abortion-womens-media.html\">After Roe v. Wade Reversal, Readers Flock to Publications Aimed at Women.</a> “Alexandra Smith, the audience director of The 19th, which was founded in 2020, said growth in traffic had been “exponential.” She said an increase in search traffic had continued well after the June 24 court decision, with readers now looking for information on how the decision could impact access to Plan B and IUDs. They were also looking to read about the impacts on other civil rights, such as marriage equality.” Hey, I get to work there!</p>\n<p><a href=\"https://bbc.com/news/world-us-canada-62444302?fbclid=IwAR0TmEICbsHRj27MzIDZPDNiELKC6uKbrPS_NjyP41AHMY0glqxuDnc1w5Y\">Alex Jones must pay $50m for Sandy Hook hoax claim.</a> “Despite retracting his claims about Sandy Hook, Jones has continued to use his media platform to argue the case was rigged against him and claimed that members of the jury pool “don’t know what planet they’re on”. His Infowars website depicted the judge being consumed by flames.”</p>\n<h4>Science</h4>\n<p><a href=\"https://technologyreview.com/2022/08/18/1057135/transgender-contagion-gender-dysphoria\">How a theory about transgender contagion went viral.</a> “The problem: Overwhelming evidence shows that your child almost certainly hasn’t been duped. Although some people do reconsider or reverse their transition, once a person starts identifying as trans, it’s quite unlikely they’ll change their mind. No matter how strongly you believe that the internet, social contagion, and positive representations of transgender people turned your child trans, chances are your child disagrees.”</p>\n<p><a href=\"https://vice.com/en/article/akeemk/chorizo-james-webb-space-telescope\">French Scientist's Photo of ‘Distant Star’ Was Actually Chorizo.</a> “But a few days later, Klein revealed that the photo he tweeted was not the work of the world’s most powerful space telescope, as he had in fact tweeted a slice of chorizo sausage.”</p>\n<h4>Society</h4>\n<p><a href=\"https://mcsweeneys.net/articles/capitalism-gives-me-the-freedom-to-pursue-as-many-side-gigs-as-i-want-to-pay-off-my-increasing-bills-and-loans\">Capitalism Gives Me the Freedom to Pursue as Many Side Gigs as I Want to Pay Off My Increasing Bills And Loans.</a> “I like to think of myself as an independent contractor who threw out his nine-to-five job for about five to nine different jobs over the course of a year, a contractor with significantly less of the legal protections established in the past hundred years or so by Congress and the Supreme Court.”</p>\n<p><a href=\"https://washingtonpost.com/advice/2022/08/19/ask-damon-young-reparations-ancestor-wealth-redistribution/?twclid=2-12qt6oeavz05tgflmfcokfhkl\">Ask Damon: I want to redistribute my slave-owning ancestor's wealth.</a> “Anyway, if you’re sincere in your desire to attempt to right your family’s wrongs, find those descendants, show them the money and then hand it to them.”</p>\n<p><a href=\"https://atvbt.com/happiness-is-two-scales\">Happiness Is Two Scales.</a> “Instead, happiness and unhappiness are two separate, independent scales. A good life requires tackling each one separately.”</p>\n<p><a href=\"https://bbc.com/news/uk-scotland-scotland-politics-51629880\">Period poverty: Scotland first in world to make period products free.</a> “It will be for the country’s 32 councils to decide what practical arrangements are put in place, but they must give “anyone who needs them” access to different types of period products “reasonably easily” and with “reasonable dignity”.”</p>\n<p><a href=\"https://newyorker.com/science/annals-of-medicine/why-a-life-threatening-pregnancy-complication-is-on-the-rise\">Why a Life-Threatening Pregnancy Complication Is on the Rise.</a> “For African American women, simply the stress of living in America increases the risk of preeclampsia.”</p>\n<p><a href=\"https://variety.com/2022/tv/news/lionsgate-mandate-abortion-safety-protocols-ceo-jon-feltheimer-1235340179\">Lionsgate Will Mandate Abortion Safety Protocols, CEO Says in Memo.</a> “Thank you, Lionsgate, for being the only studio who treated this issue with the respect and urgency it deserves. There’s still work to be done, but this is a step in the right direction.”</p>\n<p><a href=\"https://19thnews.org/2022/08/races-making-room-for-nonbinary-runners\">Races are finally making room for nonbinary runners.</a> “More races across the United States are creating divisions for nonbinary runners to compete, and in some cases, to win awards. The New York City Marathon introduced a nonbinary category last year. The Chicago Marathon also quietly added a nonbinary registration category this year, one runner said. The Boston Marathon will include a nonbinary category in 2023, though athletes say the race needs to flesh out its policy before nonbinary runners can be fully included.”</p>\n<p><a href=\"https://theverge.com/2022/7/29/23283837/nj-police-baby-dna-crimes-lawsuit-public-defender\">NJ police used baby DNA to investigate crimes, lawsuit claims.</a> “The blood samples are not directly shared with law enforcement agencies. But if police are able to reliably obtain the samples through subpoena, then effectively, the disease screening process is entering all babies born in the state into a DNA database with no ability to opt out.”</p>\n<p><a href=\"https://academic.oup.com/ser/article/20/2/539/6500315?login=false\">Economic consequences of major tax cuts for the rich.</a> “We find tax cuts for the rich lead to higher income inequality in both the short- and medium-term. In contrast, such reforms do not have any significant effect on economic growth or unemployment.”</p>\n<p><a href=\"https://currentaffairs.org/2021/07/the-dangerous-ideas-of-longtermism-and-existential-risk\">The Dangerous Ideas of “Longtermism” and “Existential Risk”.</a> “By reducing morality to an abstract numbers game, and by declaring that what’s most important is fulfilling “our potential” by becoming simulated posthumans among the stars, longtermists not only trivialize past atrocities like WWII (and the Holocaust) but give themselves a “moral excuse” to dismiss or minimize comparable atrocities in the future. This is one reason that I’ve come to see longtermism as an immensely dangerous ideology. It is, indeed, akin to a secular religion built around the worship of “future value,” complete with its own “secularised doctrine of salvation.””</p>\n<p><a href=\"https://theguardian.com/politics/2022/aug/05/facial-recognition-smartwatches-to-be-used-to-monitor-foreign-offenders-in-uk\">Facial recognition smartwatches to be used to monitor foreign offenders in UK.</a> “Through their opaque technologies and algorithms, they facilitate government discrimination and human rights abuses without any accountability. No other country in Europe has deployed this dehumanising and invasive technology against migrants.”</p>\n<p><a href=\"https://techdirt.com/2022/08/04/federal-judge-places-county-jail-into-receivership-after-county-fails-to-comply-with-consent-decree\">Federal Judge Places County Jail Into Receivership After County Fails To Comply With Consent Decree.</a> Mind-blowing: “A-Pod is one of four “pods” the prison is divided into. […] Because the inmates have free run of the pod, they can access the roof and escape. For whatever reason, they rarely actually escape. Instead, they leave the prison and return with contraband. No one is assigned to work A-pod because it cannot be controlled in its current state.”</p>\n<p><a href=\"https://nytimes.com/interactive/2022/08/01/upshot/rich-poor-friendships.html?referringSource=articleShare\">Vast New Study Shows a Key to Reducing Poverty: More Friendships Between Rich and Poor.</a> “The findings show the limitations of many attempts to increase diversity — like school busing, multifamily zoning and affirmative action. Bringing people together is not enough on its own to increase opportunity, the study suggests. Whether they form relationships matters just as much.”</p>\n<h4>Technology</h4>\n<p><a href=\"https://waxy.org/2022/08/opening-the-pandoras-box-of-ai-art\">Opening the Pandora's Box of AI Art.</a> “I’ve never felt so conflicted using an emerging technology as DALL-E 2, which feels like borderline magic in what it’s capable of conjuring, but raises so many ethical questions, it’s hard to keep track of them all.”</p>\n<p><a href=\"https://blog.twitter.com/en_us/topics/product/2022/listen-up-podcasts-are-coming-twitter\">Listen up: Podcasts are coming to Twitter.</a> What’s Odeo is new again.</p>\n<p><a href=\"https://sfgate.com/news/article/sanas-startup-creates-american-voice-17382771.php\">Bay Area tech startup Sanas wants people to sound whiter.</a> “Experts who spoke to SFGATE were troubled by Sanas’ emphasis on people in the Global South making themselves understood to Americans, as opposed to Americans accepting other accented voices.” Indeed.</p>\n<p><a href=\"https://washingtonpost.com/technology/interactive/2022/twitter-whistleblower-sec-spam\">Whistleblower: Twitter misled investors, FTC and underplayed spam issues.</a> “Twitter is grossly negligent in several areas of information security. If these problems are not corrected, regulators, media and users of the platform will be shocked when they inevitably learn about Twitter’s severe lack of security basics.”</p>\n<p><a href=\"https://iccl.ie/news/class-action-against-oracle\">Class action against Oracle's worldwide surveillance machine.</a> “Oracle’s dossiers about people include names, home addresses, emails, purchases online and in the real world, physical movements in the real world, income, interests and political views, and a detailed account of online activity.”</p>\n<p><a href=\"https://nytimes.com/2022/08/21/technology/google-surveillance-toddler-photo.html\">A Dad Took Photos of His Naked Toddler for the Doctor. Google Flagged Him as a Criminal.</a> ““This is precisely the nightmare that we are all concerned about,” Mr. Callas said. “They’re going to scan my family album, and then I’m going to get into trouble.””</p>\n<p><a href=\"https://foundation.mozilla.org/en/blog/in-post-roe-v-wade-era-mozilla-labels-18-of-25-popular-period-and-pregnancy-tracking-tech-with-privacy-not-included-warning\">Mozilla Foundation - In Post Roe v. Wade Era, Mozilla Labels 18 of 25 Popular Period and Pregnancy Tracking Tech With *Privacy Not Included Warning.</a> “Eighteen out of 25 reproductive health apps and wearable devices that Mozilla investigated for privacy and security practices received a *Privacy Not Included warning label. These findings raise concerns in the post-Roe landscape that data could be used by authorities to determine if users are pregnant, seeking abortion information or services, or crossing state lines to obtain an abortion.”</p>\n<p><a href=\"https://arstechnica.com/information-technology/2022/08/a-new-jailbreak-for-john-deere-tractors-rides-the-right-to-repair-wave\">A new jailbreak for John Deere tractors rides the right-to-repair wave.</a> “Farmers around the world have turned to tractor hacking so they can bypass the digital locks that manufacturers impose on their vehicles. Like insulin pump “looping” and iPhone jailbreaking, this allows farmers to modify and repair the expensive equipment that’s vital to their work, the way they could with analog tractors.”</p>\n<p><a href=\"https://vice.com/en/article/n7zevd/this-is-the-data-facebook-gave-police-to-prosecute-a-teenager-for-abortion\">This Is the Data Facebook Gave Police to Prosecute a Teenager for Abortion.</a> “Facebook gave police a teenager’s private chats about her abortion. Cops then used those chats to seize her phone and computer.”</p>\n<p><a href=\"https://futurism.com/onlyfans-allegations-bribes-terrorist-watchlist\">OnlyFans Accused of Paying Bribes to Put Enemies on Terrorist Watchlist.</a> “According to the suit filed earlier this year by Evans and fellow porn content creator Kelly Pierce, OnlyFans reportedly bribed Facebook employees to wrongfully place the actresses — who used OnlyFans competitor sites to sell their content — on a terrorism watchlist run by a consortium of internet companies, resulting in them being “shadowbanned” on Instagram and other social networks integral to the promotion of their content.”</p>\n<p><a href=\"https://pewresearch.org/internet/2022/08/10/teens-social-media-and-technology-2022\">Teens, Social Media and Technology 2022.</a> “The share of teens using Facebook has declined sharply in the past decade. Today, 32% of teens report ever using Facebook, down 39 points since 2014-15, when 71% said they ever used the platform.”</p>\n<p><a href=\"https://interconnected.org/home/2022/08/11/casi\">Who could write protocol fiction for speculative infrastructure?</a> “But we don’t need just design fictions. We need business model fictions, engineering feasibility study fictions, interop protocol specification fictions, investment return fictions.”</p>\n<p><a href=\"https://theverge.com/2022/8/11/23301554/google-gmail-spam-filters-republicans-gop-trump?scrolla=5eb6d68b7fedc32c19ef33b4\">Gmail is now officially allowed to spam-proof politicians’ emails.</a> “It’s sad that instead of simply stopping sending spam emails, Republicans engaged in a bad-faith pressure campaign — and it’s even more unfortunate that Google bought it.”</p>\n<p><a href=\"https://krausefx.com/blog/ios-privacy-instagram-and-facebook-can-track-anything-you-do-on-any-website-in-their-in-app-browser\">iOS Privacy: Instagram and Facebook can track anything you do on any website in their in-app browser.</a> “With 1 Billion active Instagram users, the amount of data Instagram can collect by injecting the tracking code into every third party website opened from the Instagram &amp; Facebook app is a staggering amount.”</p>\n<p><a href=\"https://theguardian.com/us-news/2022/aug/09/twitter-saudi-arabia-dissident-spying\">Ex-Twitter employee found guilty of spying on Saudi dissidents.</a> “Abouammo was found to have used his position at Twitter to find personal details identifying critics of the Saudi monarchy who had been posting under anonymous Twitter handles, and then supplying the information to Prince Mohammed’s aide Bader al-Asaker.”</p>\n<p><a href=\"https://protocol.com/climate/tech-workers-quitting-climate-jobs\">Silicon Valley engineers are quitting for climate change.</a> “Big Tech is no longer the young upstart, and there’s a new kid in town luring away smart people looking for purpose and willing to take a chance on something new: climate tech.”</p>\n<p><a href=\"https://technologyreview.com/2022/08/04/1056633/startup-wants-copy-you-embryo-organ-harvesting\">This startup wants to copy you into an embryo for organ harvesting.</a> ““We are not trying to make human beings. That is not what we are trying to do.” says Hanna. “To call a day-40 embryo a mini-me is just not true.””</p>\n<p><a href=\"https://oreilly.com/radar/the-metaverse-is-not-a-place\">The Metaverse Is Not a Place.</a> “But what if, instead of thinking of the metaverse as a set of interconnected virtual places, we think of it as a communications medium? Using this metaphor, we see the metaverse as a continuation of a line that passes through messaging and email to “rendezvous”-type social apps like Zoom, Google Meet, Microsoft Teams, and, for wide broadcast, Twitch + Discord. […] The interactions are not place based but happening in the ether between two or more connected people. The occasion is more the point than the place.”</p>\n<p><a href=\"https://buzzfeednews.com/article/ryanmac/mark-zuckerberg-joel-kaplan-facebook-alex-jones\">Joel Kaplan’s Policy Team Sways Big Facebook Decisions Like Alex Jones Ban.</a> “The company could have acted much earlier, one Facebook researcher wrote on the internal message board when they quit in August. The note came with a warning: “Integrity teams are facing increasing barriers to building safeguards.” They wrote of how proposed platform improvements that were backed by strong research and data had been “prematurely stifled or severely constrained … often based on fears of public and policy stakeholder responses.””</p>",
            "value": "Happy Labor Day to everyone who celebrates the organized labor movement today in the US. This is my monthly roundup of the books, articles, and streaming media I found interesting. Here's my list for August, 2022.A note: it’s taken me a while to hit publish on this post because our son was born on September 2nd. We instantly fell in love. More on that soon. For now, please understand if my posting frequency plummets for a little while.BooksFictionThe School for Good Mothers, by Jessamine Chan. A ton of ideas about parenting, society, and the present moment, crammed into an emotional near-future science fiction story. I wish the protagonist had been more sympathetic - but the future it paints is alarmingly plausible.Notable ArticlesBusinessWorkplace Productivity: Are You Being Tracked? “Two years ago, her employer started requiring chaplains to accrue more of what it called “productivity points.” A visit to the dying: as little as one point. Participating in a funeral: one and three-quarters points. A phone call to grieving relatives: one-quarter point.”The organized labor movement has a new ally: venture capitalists. “White’s solution is to plan an “exit to community.” Once the company starts earning income, it plans to buy out its investors and give their equity to the unions it helped organize, effectively transitioning corporate control to the customer base.”American Express' platinum-level duplicity. “American Express’ decision to begin donating to Republican objectors reflects the desire of some in the business community to put the events of January 6, 2021, behind them. That, according to an open letter recently signed by former American Express CEO Kenneth Chenault and other prominent business leaders, is a big mistake.”Varo layoffs are a sign of neobanks’ struggle to break even. ““Most American neobanks cater to lower-income customers, who previously may have incurred overdraft, [non-sufficient fund fees] and maintenance fees at big establishment banks,” Mikula told Protocol. “But these consumers also tend to be higher credit risk, making it challenging to lend to them. No U.S. neobank has built a meaningful lending business.””ClimateCalifornia to Ban the Sale of New Gasoline Cars. “The rule, issued by the California Air Resources Board, will require that all new cars sold in the state by 2035 be free of greenhouse gas emissions like carbon dioxide. The rule also sets interim targets, requiring that 35 percent of new passenger vehicles sold by 2026 produce zero emissions. That requirement climbs to 68 percent by 2030.”The temperature threshold the human body can't survive. “When the wet bulb temperature gets above 95 degrees F, our bodies lose their ability to cool down, and the consequences can be deadly. Until recently, scientists didn’t think we’d cross that threshold outside of doomsday climate change scenarios. But a 2020 study looking at detailed weather records around the world found we’ve already crossed the threshold at least 14 times in the last 40 years.”Women are working to make the clean energy transition more equitable. “Women are disproportionately facing the impacts of the climate crisis: They are more likely to be displaced by climate disasters, and due to lower-paid jobs, caregiving responsibilities and the wage gap, they have less economic means to recover and adapt to a changing climate.”CryptoMore Than Half Of All Bitcoin Trades Are Fake. “More than half of all reported trading volume is likely to be fake or non-economic. Forbes estimates the global daily bitcoin volume for the industry was $128 billion on June 14. That is 51% less than the $262 billion one would get by taking the sum of self-reported volume from multiple sources.”Insider Trading in Cryptocurrency Markets. “We find evidence of systematic insider trading in cryptocurrency markets, where individuals use private information to buy coins prior to exchange listing announcements. Our analysis shows significant price run-ups before official listing announcements, similar to prosecuted cases of insider trading in stock markets.”Feds Blacklist Tornado Cash, Ban Ethereum Mixing Tool in US. “In a Monday announcement, the body added the Tornado Cash website and a long list of Ethereum addresses to its Specially Designated Nationals list, banning American citizens from using the tool or transacting with these addresses.”Pearson Sees NFT, Blockchain Helping Making Money From E-Books Sales. “The chief executive officer of Pearson Plc, one of the world’s largest textbook publishers, said he hopes technology like non-fungible tokens and the blockchain could help the company take a cut from secondhand sales of its materials as more books go online.”CultureQueer YA books are selling in record numbers despite bans targeting them. “Of the close to 5 million units of LGBTQ+ books sold in 2021, the biggest absolute gains in this market came from LGBTQ+ YA books, which saw an increase in sales of 1.3 million units from the previous year. Queer YA is more popular than ever — no longer a niche category, but redefining what is mainstream for teen readers.”As list of banned books in schools grows, ‘soft’ censorship is spreading. “Free speech advocates say these practices are as troubling as bans — particularly when the books singled out overwhelmingly have themes related to race, gender and sexuality and are written by authors who are women, LGBTQ+ and/or people of color.”Billy Bragg on the difference between the backlash to Salman Rushdie and Jerry Sadowitz. “Over the past decade or so, Rushdie has sought to return to some sort of a normal life, despite the threat hanging over him. The fact that he continued to take the stage at literary events is a tribute to his belief in freedom of expression and he has been rightly commended for his bravery.”Doctor Who casting director: \"We’re casting more disabled actors\". “It’s more interesting. Also, if you can’t cast diversely on Doctor Who, what show can you do it on? It goes everywhere, on this planet and others, and you don’t want to see the same kind of people all the time. You don’t want it to be exclusively middle-class white people speaking with RP accents.”on leading a purposeless life. “Maybe it is okay to not pursue potential and just be okay with being. Why must there be a reason for everything?” Beautiful.Author Salman Rushdie attacked on lecture stage in New York. “He has said he is proud of his fight for freedom of expression, saying in a 2012 talk in New York that terrorism is really the art of fear.”Interview: Jake Novak on His Infamous SNL TikTok Video. “Honestly, as horrible as the internet has been to me in the past six weeks, I have really enjoyed this hiatus. I’m getting to see my friends more and just have more meaningful experiences in real life.”DemocracyWhy I Changed My Mind on Student Debt Forgiveness. “It is simply impossible for students to work their way through college in the way previous generations could. And at the same time, states have reduced funding to their public colleges that historically allowed schools to charge low tuition prices.”We reject the free speech-trampling rules set by J.D. Vance and Ron DeSantis for covering their rally. “Think about what they were doing here. They were staging an event to rally people to vote for Vance while instituting the kinds of policies you’d see in a fascist regime.”John Mackey: Whole Foods CEO says ‘socialists are taking over’ schools and gun control debate. ““My concern is that I feel like socialists are taking over,” the multi-millionaire organic grocery magnate said. “They’re marching through the institutions. They’re… taking over education. It looks like they’ve taken over a lot of the corporations. It looks like they’ve taken over the military. And it’s just continuing.””Second Gentleman Doug Emhoff leans in to being a voice for gender equity. “Emhoff is the first second gentleman to the first woman vice president, and for him, tackling gender inequality in ways big and small felt like a natural, and critical, component of creating this role. He is actively attempting to model for others what it means to be an ally in actions, not just words.”It's Manly Man Summer at the Claremont Institute. “In a piece titled “Men and the Future of America,” Klingenstein praises senator Josh Hawley for a speech trumpeting the “masculine virtues.” And what are those? They are, according to Klingenstein, “stoicism, competitiveness, conquest, achievement and aggression.” These are qualities to be managed, not repressed, because repressing them turns them toxic, into “dysfunctional behaviors—crime, drugs, pornography, and the like.”” I find this ideology so repulsive, so baffling.How the Claremont Institute, home to Trump lawyer John Eastman, rose and fell. “Lewis said he agreed with Claremont leaders that the country is locked in a cold civil war. “Our country is upside down,” he said. “It’s unrecognizable.” He praised the program and its focus on “the myth of systemic police racism.” […] “They’re trying to train people to take a kind of extreme populist right-wing ideology back with them to Washington.”“After slow response, Biden administration ramps up abortion access protections. “Helen Silverstein, head of the government and law department at Lafayette College, said that the administration’s actions this week were notable because they sent a clear — if delayed — signal to the Democratic base that the executive branch is taking access to reproductive health care seriously.”Orbán gets warm CPAC reception after 'mixed race' speech blowback. “The reaction to Orbán’s “mixed-race” remarks was “a little bit overblown,” Ede Vessey said, maintaining that the prime minister was referring to a stark clash of cultures that has taken place in some Western European countries that have accepted refugees from predominantly Muslim countries.”Senate Judiciary holds hearing on threats to election workers. “Election officials from both the Democratic and Republican parties, as well as nonpartisan officials, testified at the hearing on election workers, a workforce that has received more attention after former President Donald Trump lied about widespread voter fraud in the 2020 election. As Trump considers another run for office in 2024, he has repeated unfounded claims about election security that election administrators say has made their work more difficult.”Justice Department sues Idaho over abortion ban, citing ‘medical emergency’ violation. ““The law thus places medical professionals in an impossible situation,” Gupta said. “They must either withhold stabilizing treatment required by EMTALA or risk felony prosecution and license revocation. In so doing, the law will chill providers’ willingness to perform abortions in emergency situations and will hurt patients.””ShotSpotter Asks Court To Hold It In Contempt Rather Than Turn Over Information To Defense Lawyer. “It’s tough to say what a judge will find admissible, but ShotSpotter’s past history suggests it is willing in some cases to alter reports to justify arrests that have already occurred. If the PD contacted ShotSpotter post-arrest to get a report altered, it may show officers had no reasonable suspicion to stop the arrestee — a stop that resulted in his arrest.”Sen. Tiara Mack says twerking video response has led to harassment, threats. ““It’s been a whirlwind. Anywhere from misogynistic comments, racist comments, classist comments,” she said. “I’ve received death threats. I’ve received emails and phone calls of people calling me the n-word. I’ve received fatphobic comments. Just everything under the sun.””Republican candidates are changing how they handle abortion after Roe v. Wade. “Multiple Republican midterm candidates have removed from their campaign sites references to particularly strict anti-abortion stances, a shift from primary campaigning to the approaching general election and an indication of growing concern in the Republican Party over how to handle abortion policy post-Roe v. Wade.”HealthU.S. life expectancy drops sharply, the second consecutive decline. “American Indian and Alaskan Native people have experienced a particularly precipitous drop in life expectancy since 2019, going from 71.8 to 65.2 years. This kind of loss is similar to the plunge seen for all Americans after the Spanish Flu.”Kids Born Near Fracking Sites More Likely to Have Leukemia, Study Says. “Children who are born near fracking sites are as much as three times more likely to be diagnosed with leukemia later on, according to new Yale research.”For years, Black trans women have been told their life expectancy is 35 years. That’s false. “Willis says the statistic once communicated an urgency in the community. Today, she thinks trans people need more complicated stories.”Experts debunk monkeypox myths as misinformation spreads. “Can monkeypox spread on the subway? Can it kill like COVID-19? Experts respond to monkeypox myths and misconceptions.”Just because some people can pretend COVID is over, doesn’t mean it actually is. “People are still dying of COVID and even more people are getting long COVID (which we’re seeing develop into myalgic encephalomyelitis for many long haulers, and trust me, you don’t want it). The CDC and Food and Drug Administration have mostly abdicated their responsibility to prevent infections, focusing only on serious illness and death, while ignoring long COVID and the impact of the virus on disabled people.”MediaPerson-Centered Terms Encourage Stigmatized Groups’ Trust in News. “Participants trusted articles that used person-centered terms for their group more than articles that used stigmatizing terms.” Understandably.People of color at 'New York Times' get lower ratings in job reviews, union says. “While there were some fluctuation — on average, the performance of Black employees rose over the intervening years, while it declined for Latinos at the organization — white workers were consistently assessed as outperforming their peers.”Healing Polarized Communities. “We cannot begin bridging communities beyond our newsrooms without building — and supporting — more diverse communities within our newsrooms.” So proud to work here.Choose Your Own Literary Adventure. “The colorful recommendation chart, one of many that have rippled through the Twitter and Instagram feeds of book lovers, came from a small bookstore in Madison, Wis., called A Room of One’s Own. […] The charts seem to speak the internet’s language, one that meets people where they are by acknowledging that literature can be overwhelming, and people often don’t know where to start.”A luxury magazine photo hid relics Cambodia says could be stolen. For me the lede here is: Architectural Digest appears to have deliberately run a photo altered to hide the fact that an article’s subject owns stolen Cambodian artifacts.After Roe v. Wade Reversal, Readers Flock to Publications Aimed at Women. “Alexandra Smith, the audience director of The 19th, which was founded in 2020, said growth in traffic had been “exponential.” She said an increase in search traffic had continued well after the June 24 court decision, with readers now looking for information on how the decision could impact access to Plan B and IUDs. They were also looking to read about the impacts on other civil rights, such as marriage equality.” Hey, I get to work there!Alex Jones must pay $50m for Sandy Hook hoax claim. “Despite retracting his claims about Sandy Hook, Jones has continued to use his media platform to argue the case was rigged against him and claimed that members of the jury pool “don’t know what planet they’re on”. His Infowars website depicted the judge being consumed by flames.”ScienceHow a theory about transgender contagion went viral. “The problem: Overwhelming evidence shows that your child almost certainly hasn’t been duped. Although some people do reconsider or reverse their transition, once a person starts identifying as trans, it’s quite unlikely they’ll change their mind. No matter how strongly you believe that the internet, social contagion, and positive representations of transgender people turned your child trans, chances are your child disagrees.”French Scientist's Photo of ‘Distant Star’ Was Actually Chorizo. “But a few days later, Klein revealed that the photo he tweeted was not the work of the world’s most powerful space telescope, as he had in fact tweeted a slice of chorizo sausage.”SocietyCapitalism Gives Me the Freedom to Pursue as Many Side Gigs as I Want to Pay Off My Increasing Bills And Loans. “I like to think of myself as an independent contractor who threw out his nine-to-five job for about five to nine different jobs over the course of a year, a contractor with significantly less of the legal protections established in the past hundred years or so by Congress and the Supreme Court.”Ask Damon: I want to redistribute my slave-owning ancestor's wealth. “Anyway, if you’re sincere in your desire to attempt to right your family’s wrongs, find those descendants, show them the money and then hand it to them.”Happiness Is Two Scales. “Instead, happiness and unhappiness are two separate, independent scales. A good life requires tackling each one separately.”Period poverty: Scotland first in world to make period products free. “It will be for the country’s 32 councils to decide what practical arrangements are put in place, but they must give “anyone who needs them” access to different types of period products “reasonably easily” and with “reasonable dignity”.”Why a Life-Threatening Pregnancy Complication Is on the Rise. “For African American women, simply the stress of living in America increases the risk of preeclampsia.”Lionsgate Will Mandate Abortion Safety Protocols, CEO Says in Memo. “Thank you, Lionsgate, for being the only studio who treated this issue with the respect and urgency it deserves. There’s still work to be done, but this is a step in the right direction.”Races are finally making room for nonbinary runners. “More races across the United States are creating divisions for nonbinary runners to compete, and in some cases, to win awards. The New York City Marathon introduced a nonbinary category last year. The Chicago Marathon also quietly added a nonbinary registration category this year, one runner said. The Boston Marathon will include a nonbinary category in 2023, though athletes say the race needs to flesh out its policy before nonbinary runners can be fully included.”NJ police used baby DNA to investigate crimes, lawsuit claims. “The blood samples are not directly shared with law enforcement agencies. But if police are able to reliably obtain the samples through subpoena, then effectively, the disease screening process is entering all babies born in the state into a DNA database with no ability to opt out.”Economic consequences of major tax cuts for the rich. “We find tax cuts for the rich lead to higher income inequality in both the short- and medium-term. In contrast, such reforms do not have any significant effect on economic growth or unemployment.”The Dangerous Ideas of “Longtermism” and “Existential Risk”. “By reducing morality to an abstract numbers game, and by declaring that what’s most important is fulfilling “our potential” by becoming simulated posthumans among the stars, longtermists not only trivialize past atrocities like WWII (and the Holocaust) but give themselves a “moral excuse” to dismiss or minimize comparable atrocities in the future. This is one reason that I’ve come to see longtermism as an immensely dangerous ideology. It is, indeed, akin to a secular religion built around the worship of “future value,” complete with its own “secularised doctrine of salvation.””Facial recognition smartwatches to be used to monitor foreign offenders in UK. “Through their opaque technologies and algorithms, they facilitate government discrimination and human rights abuses without any accountability. No other country in Europe has deployed this dehumanising and invasive technology against migrants.”Federal Judge Places County Jail Into Receivership After County Fails To Comply With Consent Decree. Mind-blowing: “A-Pod is one of four “pods” the prison is divided into. […] Because the inmates have free run of the pod, they can access the roof and escape. For whatever reason, they rarely actually escape. Instead, they leave the prison and return with contraband. No one is assigned to work A-pod because it cannot be controlled in its current state.”Vast New Study Shows a Key to Reducing Poverty: More Friendships Between Rich and Poor. “The findings show the limitations of many attempts to increase diversity — like school busing, multifamily zoning and affirmative action. Bringing people together is not enough on its own to increase opportunity, the study suggests. Whether they form relationships matters just as much.”TechnologyOpening the Pandora's Box of AI Art. “I’ve never felt so conflicted using an emerging technology as DALL-E 2, which feels like borderline magic in what it’s capable of conjuring, but raises so many ethical questions, it’s hard to keep track of them all.”Listen up: Podcasts are coming to Twitter. What’s Odeo is new again.Bay Area tech startup Sanas wants people to sound whiter. “Experts who spoke to SFGATE were troubled by Sanas’ emphasis on people in the Global South making themselves understood to Americans, as opposed to Americans accepting other accented voices.” Indeed.Whistleblower: Twitter misled investors, FTC and underplayed spam issues. “Twitter is grossly negligent in several areas of information security. If these problems are not corrected, regulators, media and users of the platform will be shocked when they inevitably learn about Twitter’s severe lack of security basics.”Class action against Oracle's worldwide surveillance machine. “Oracle’s dossiers about people include names, home addresses, emails, purchases online and in the real world, physical movements in the real world, income, interests and political views, and a detailed account of online activity.”A Dad Took Photos of His Naked Toddler for the Doctor. Google Flagged Him as a Criminal. ““This is precisely the nightmare that we are all concerned about,” Mr. Callas said. “They’re going to scan my family album, and then I’m going to get into trouble.””Mozilla Foundation - In Post Roe v. Wade Era, Mozilla Labels 18 of 25 Popular Period and Pregnancy Tracking Tech With *Privacy Not Included Warning. “Eighteen out of 25 reproductive health apps and wearable devices that Mozilla investigated for privacy and security practices received a *Privacy Not Included warning label. These findings raise concerns in the post-Roe landscape that data could be used by authorities to determine if users are pregnant, seeking abortion information or services, or crossing state lines to obtain an abortion.”A new jailbreak for John Deere tractors rides the right-to-repair wave. “Farmers around the world have turned to tractor hacking so they can bypass the digital locks that manufacturers impose on their vehicles. Like insulin pump “looping” and iPhone jailbreaking, this allows farmers to modify and repair the expensive equipment that’s vital to their work, the way they could with analog tractors.”This Is the Data Facebook Gave Police to Prosecute a Teenager for Abortion. “Facebook gave police a teenager’s private chats about her abortion. Cops then used those chats to seize her phone and computer.”OnlyFans Accused of Paying Bribes to Put Enemies on Terrorist Watchlist. “According to the suit filed earlier this year by Evans and fellow porn content creator Kelly Pierce, OnlyFans reportedly bribed Facebook employees to wrongfully place the actresses — who used OnlyFans competitor sites to sell their content — on a terrorism watchlist run by a consortium of internet companies, resulting in them being “shadowbanned” on Instagram and other social networks integral to the promotion of their content.”Teens, Social Media and Technology 2022. “The share of teens using Facebook has declined sharply in the past decade. Today, 32% of teens report ever using Facebook, down 39 points since 2014-15, when 71% said they ever used the platform.”Who could write protocol fiction for speculative infrastructure? “But we don’t need just design fictions. We need business model fictions, engineering feasibility study fictions, interop protocol specification fictions, investment return fictions.”Gmail is now officially allowed to spam-proof politicians’ emails. “It’s sad that instead of simply stopping sending spam emails, Republicans engaged in a bad-faith pressure campaign — and it’s even more unfortunate that Google bought it.”iOS Privacy: Instagram and Facebook can track anything you do on any website in their in-app browser. “With 1 Billion active Instagram users, the amount of data Instagram can collect by injecting the tracking code into every third party website opened from the Instagram & Facebook app is a staggering amount.”Ex-Twitter employee found guilty of spying on Saudi dissidents. “Abouammo was found to have used his position at Twitter to find personal details identifying critics of the Saudi monarchy who had been posting under anonymous Twitter handles, and then supplying the information to Prince Mohammed’s aide Bader al-Asaker.”Silicon Valley engineers are quitting for climate change. “Big Tech is no longer the young upstart, and there’s a new kid in town luring away smart people looking for purpose and willing to take a chance on something new: climate tech.”This startup wants to copy you into an embryo for organ harvesting. ““We are not trying to make human beings. That is not what we are trying to do.” says Hanna. “To call a day-40 embryo a mini-me is just not true.””The Metaverse Is Not a Place. “But what if, instead of thinking of the metaverse as a set of interconnected virtual places, we think of it as a communications medium? Using this metaphor, we see the metaverse as a continuation of a line that passes through messaging and email to “rendezvous”-type social apps like Zoom, Google Meet, Microsoft Teams, and, for wide broadcast, Twitch + Discord. […] The interactions are not place based but happening in the ether between two or more connected people. The occasion is more the point than the place.”Joel Kaplan’s Policy Team Sways Big Facebook Decisions Like Alex Jones Ban. “The company could have acted much earlier, one Facebook researcher wrote on the internal message board when they quit in August. The note came with a warning: “Integrity teams are facing increasing barriers to building safeguards.” They wrote of how proposed platform improvements that were backed by strong research and data had been “prematurely stifled or severely constrained … often based on fears of public and policy stakeholder responses.””"
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmüller"
              ]
            },
            "value": "Ben Werdmüller"
          }
        ],
        "url": [
          "https://werd.io/2022/this-week-ive-met-two-absolute-wizards"
        ],
        "published": [
          "2022-09-03T23:09:43+00:00"
        ],
        "name": [
          "This week I’ve met two absolute wizards: an insanely great labor and delivery nurse, and a lactation consultant. Both were able to be so good because they were obsessed with the ongoing science and practice of their work while also being deeply empathetic. Grateful."
        ],
        "content": [
          {
            "html": "This week I’ve met two absolute wizards: an insanely great labor and delivery nurse, and a lactation consultant. Both were able to be so good because they were obsessed with the ongoing science and practice of their work while also being deeply empathetic. Grateful.",
            "value": "This week I’ve met two absolute wizards: an insanely great labor and delivery nurse, and a lactation consultant. Both were able to be so good because they were obsessed with the ongoing science and practice of their work while also being deeply empathetic. Grateful."
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmüller"
              ]
            },
            "value": "Ben Werdmüller"
          }
        ],
        "url": [
          "https://werd.io/2022/happy-how-can-it-possibly-be-september"
        ],
        "published": [
          "2022-09-01T07:05:01+00:00"
        ],
        "name": [
          "Happy “how can it possibly be September already?!” to everyone who celebrates."
        ],
        "content": [
          {
            "html": "Happy “how can it possibly be September already?!” to everyone who celebrates.",
            "value": "Happy “how can it possibly be September already?!” to everyone who celebrates."
          }
        ]
      }
    }
  ],
  "rels": {
    "apple-touch-icon": [
      "https://werd.io/gfx/logos/apple-icon-57x57.png",
      "https://werd.io/gfx/logos/apple-icon-72x72.png",
      "https://werd.io/gfx/logos/apple-icon-114x114.png",
      "https://werd.io/gfx/logos/apple-icon-144x144.png",
      "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
    ],
    "icon": [
      "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
    ],
    "shortcut": [
      "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
    ],
    "apple-touch-icon-precomposed": [
      "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
    ],
    "manifest": [
      "https://werd.io/chrome/manifest.json"
    ],
    "schema.DC": [
      "http://purl.org/dc/elements/1.1/"
    ],
    "stylesheet": [
      "https://werd.io/vendor/twbs/bootstrap/dist/css/bootstrap.min.css",
      "https://werd.io/vendor/npm-asset/bootstrap-accessibility-plugin/plugins/css/bootstrap-accessibility.css",
      "https://werd.io/vendor/forkawesome/fork-awesome/css/fork-awesome.min.css",
      "https://werd.io/vendor/forkawesome/fork-awesome/css/v5-compat.min.css",
      "https://werd.io/css/1659102598/known.min.css",
      "https://werd.io/vendor/npm-asset/bootstrap-toggle/css/bootstrap-toggle.min.css",
      "https://werd.io/vendor/idno/mentionjs/recommended-styles.css",
      "https://werd.io/vendor/npm-asset/eonasdan-bootstrap-datetimepicker/build/css/bootstrap-datetimepicker.min.css",
      "https://werd.io/Themes/MarketStreet/css/default.min.css",
      "https://fonts.googleapis.com/css?family=Merriweather:300,300i,400,400i,700,700i",
      "https://werd.io/vendor/npm-asset/mediaelement/build/mediaelementplayer.min.css"
    ],
    "alternate": [
      "https://werd.io/profile/benwerd?_t=rss",
      "https://werd.io/content/all?_t=rss"
    ],
    "feed": [
      "https://werd.io/profile/benwerd?_t=rss",
      "https://werd.io/content/all?_t=rss",
      "https://werd.io/content/all"
    ],
    "http://webmention.org/": [
      "https://werd.io/webmention/"
    ],
    "webmention": [
      "https://werd.io/webmention/"
    ],
    "hub": [
      "https://withknown.superfeedr.com/"
    ],
    "me": [
      "https://twitter.com/benwerd",
      "https://github.com/benwerd",
      "https://www.linkedin.com/in/benwerd",
      "https://werd.cloud/"
    ],
    "openid.delegate": [
      "https://werd.io/"
    ],
    "openid.server": [
      "https://indieauth.com/openid"
    ],
    "authorization_endpoint": [
      "https://werd.io/indieauth/auth"
    ],
    "token_endpoint": [
      "https://werd.io/indieauth/token"
    ],
    "micropub": [
      "https://werd.io/micropub/endpoint"
    ],
    "permalink": [
      "https://werd.io/2022/a-letter-to-my-mother-on-the-event-of-my",
      "https://werd.io/2022/hot-take-empires-are-bad-and-symbols",
      "https://werd.io/2022/having-a-dedicated-woman-as-head-of",
      "https://werd.io/2022/okay-but-how-does-this-affect-the",
      "https://werd.io/2022/two-opinions-i-think-the-monarchy-is",
      "https://werd.io/2022/day-six-i-now-understand-that-what",
      "https://werd.io/2022/this-labor-day-im-thinking-about-my",
      "https://werd.io/2022/reading-watching-playing-using-august-2022",
      "https://werd.io/2022/this-week-ive-met-two-absolute-wizards",
      "https://werd.io/2022/happy-how-can-it-possibly-be-september"
    ],
    "next": [
      "https://werd.io/profile/benwerd?offset=0"
    ],
    "prev": [
      "https://werd.io/profile/benwerd?offset=10"
    ]
  },
  "rel-urls": {
    "https://werd.io/gfx/logos/apple-icon-57x57.png": {
      "rels": [
        "apple-touch-icon"
      ]
    },
    "https://werd.io/gfx/logos/apple-icon-72x72.png": {
      "rels": [
        "apple-touch-icon"
      ]
    },
    "https://werd.io/gfx/logos/apple-icon-114x114.png": {
      "rels": [
        "apple-touch-icon"
      ]
    },
    "https://werd.io/gfx/logos/apple-icon-144x144.png": {
      "rels": [
        "apple-touch-icon"
      ]
    },
    "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg": {
      "rels": [
        "icon",
        "shortcut"
      ],
      "type": "image/jpg"
    },
    "https://werd.io/chrome/manifest.json": {
      "rels": [
        "manifest"
      ]
    },
    "http://purl.org/dc/elements/1.1/": {
      "rels": [
        "schema.DC"
      ]
    },
    "https://werd.io/vendor/twbs/bootstrap/dist/css/bootstrap.min.css": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://werd.io/vendor/npm-asset/bootstrap-accessibility-plugin/plugins/css/bootstrap-accessibility.css": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://werd.io/vendor/forkawesome/fork-awesome/css/fork-awesome.min.css": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://werd.io/vendor/forkawesome/fork-awesome/css/v5-compat.min.css": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://werd.io/css/1659102598/known.min.css": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://werd.io/vendor/npm-asset/bootstrap-toggle/css/bootstrap-toggle.min.css": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://werd.io/vendor/idno/mentionjs/recommended-styles.css": {
      "rels": [
        "stylesheet"
      ],
      "type": "text/css"
    },
    "https://werd.io/vendor/npm-asset/eonasdan-bootstrap-datetimepicker/build/css/bootstrap-datetimepicker.min.css": {
      "rels": [
        "stylesheet"
      ],
      "type": "text/css"
    },
    "https://werd.io/profile/benwerd?_t=rss": {
      "rels": [
        "alternate"
      ],
      "title": "Ben Werdmüller",
      "type": "application/rss+xml"
    },
    "https://werd.io/content/all?_t=rss": {
      "rels": [
        "alternate",
        "feed"
      ],
      "title": "Ben Werdmüller: all content",
      "type": "application/rss+xml"
    },
    "https://werd.io/content/all": {
      "rels": [
        "feed"
      ],
      "title": "Ben Werdmüller",
      "type": "text/html"
    },
    "https://werd.io/webmention/": {
      "rels": [
        "http://webmention.org/"
      ]
    },
    "https://withknown.superfeedr.com/": {
      "rels": [
        "hub"
      ]
    },
    "https://twitter.com/benwerd": {
      "rels": [
        "me"
      ]
    },
    "https://github.com/benwerd": {
      "rels": [
        "me"
      ]
    },
    "https://www.linkedin.com/in/benwerd": {
      "rels": [
        "me"
      ]
    },
    "https://werd.cloud/": {
      "rels": [
        "me"
      ]
    },
    "https://werd.io/": {
      "rels": [
        "openid.delegate"
      ]
    },
    "https://indieauth.com/openid": {
      "rels": [
        "openid.server"
      ]
    },
    "https://werd.io/indieauth/auth": {
      "rels": [
        "authorization_endpoint"
      ]
    },
    "https://werd.io/indieauth/token": {
      "rels": [
        "token_endpoint"
      ]
    },
    "https://werd.io/micropub/endpoint": {
      "rels": [
        "micropub"
      ]
    },
    "https://werd.io/Themes/MarketStreet/css/default.min.css": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://fonts.googleapis.com/css?family=Merriweather:300,300i,400,400i,700,700i": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://werd.io/2022/a-letter-to-my-mother-on-the-event-of-my": {
      "rels": [
        "permalink"
      ],
      "text": "\n                            September 10, 2022\n                        "
    },
    "https://werd.io/2022/hot-take-empires-are-bad-and-symbols": {
      "rels": [
        "permalink"
      ],
      "text": "\n                            September 10, 2022\n                        "
    },
    "https://werd.io/2022/having-a-dedicated-woman-as-head-of": {
      "rels": [
        "permalink"
      ],
      "text": "\n                            September 8, 2022\n                        "
    },
    "https://werd.io/2022/okay-but-how-does-this-affect-the": {
      "rels": [
        "permalink"
      ],
      "text": "\n                            September 8, 2022\n                        "
    },
    "https://werd.io/2022/two-opinions-i-think-the-monarchy-is": {
      "rels": [
        "permalink"
      ],
      "text": "\n                            September 8, 2022\n                        "
    },
    "https://werd.io/2022/day-six-i-now-understand-that-what": {
      "rels": [
        "permalink"
      ],
      "text": "\n                            September 8, 2022\n                        "
    },
    "https://werd.io/2022/this-labor-day-im-thinking-about-my": {
      "rels": [
        "permalink"
      ],
      "text": "\n                            September 5, 2022\n                        "
    },
    "https://werd.io/2022/reading-watching-playing-using-august-2022": {
      "rels": [
        "permalink"
      ],
      "text": "\n                            September 5, 2022\n                        "
    },
    "https://werd.io/2022/this-week-ive-met-two-absolute-wizards": {
      "rels": [
        "permalink"
      ],
      "text": "\n                            September 3, 2022\n                        "
    },
    "https://werd.io/2022/happy-how-can-it-possibly-be-september": {
      "rels": [
        "permalink"
      ],
      "text": "\n                            September 1, 2022\n                        "
    },
    "https://werd.io/profile/benwerd?offset=0": {
      "rels": [
        "next"
      ],
      "title": "Newer",
      "text": "« Newer"
    },
    "https://werd.io/profile/benwerd?offset=10": {
      "rels": [
        "prev"
      ],
      "title": "Older",
      "text": "Older »"
    },
    "https://werd.io/vendor/npm-asset/mediaelement/build/mediaelementplayer.min.css": {
      "rels": [
        "stylesheet"
      ]
    }
  }
}