{
  "items": [
    {
      "type": [
        "h-card"
      ],
      "properties": {
        "url": [
          "https://werd.io/profile/benwerd",
          "https://werd.io/profile/benwerd",
          "https://github.com/benwerd",
          "https://www.linkedin.com/in/benwerd",
          "https://werd.social/@ben",
          "https://19thnews.org/"
        ],
        "photo": [
          "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
        ],
        "profile": [
          "Ben Werdmuller"
        ],
        "name": [
          "Ben Werdmuller"
        ],
        "note": [
          {
            "html": "<div class=\"highlightedText\">\n<p><span style=\"font-weight: 400\"><br>I work and write at the intersection of technology, media, and society.<br><br>I've been a startup founder, mission-driven VC, engineer, and product lead. Right now I'm Chief Technology Officer at <a href=\"https://19thnews.org/\" style=\"color: #4c93cb\">The 19th</a>.<br><br><a href=\"https://werd.social/@ben\" style=\"color: #4c93cb\">Follow me on Mastodon</a> or <a href=\"https://newsletter.werd.io/\" style=\"color: #4c93cb\">subscribe via email</a>.<br><br></span></p>\n</div>",
            "value": "I work and write at the intersection of technology, media, and society.I've been a startup founder, mission-driven VC, engineer, and product lead. Right now I'm Chief Technology Officer at The 19th.Follow me on Mastodon or subscribe via email."
          }
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "If you incentivize someone to increase engagement in your product, they will. But if you're not careful, you might find that your product starts to look just like someone else's.\n\nEvery corporate consumer platform starts to look like the most popular consumer platform of the era over time."
        ],
        "content": [
          {
            "html": "If you incentivize someone to increase engagement in your product, they will. But if you're not careful, you might find that your product starts to look just like someone else's.<br>\n<br>\nEvery corporate consumer platform starts to look like the most popular consumer platform of the era over time.",
            "value": "If you incentivize someone to increase engagement in your product, they will. But if you're not careful, you might find that your product starts to look just like someone else's.\n\nEvery corporate consumer platform starts to look like the most popular consumer platform of the era over time."
          }
        ],
        "url": [
          "https://werd.io/2023/if-you-incentivize-someone-to-increase-engagement"
        ],
        "published": [
          "2023-03-09T13:29:41+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "Metadata standards for publishers"
        ],
        "content": [
          {
            "html": "<p>I’m working on creating a list of metadata formats that a web publisher absolutely must support. These are formats that provide structured information in order to help with one of the following use cases:</p>\n<ul>\n<li>Help platforms to display rich previews when a link from the publisher is shared</li>\n<li>Help search engines to figure out what to display in results, and which information is helpful</li>\n<li>Help third-party clients to interact with web page data in some way (for example to extract information about an event that might be hosted on the publisher’s site)</li>\n</ul>\n<p>These might include:</p>\n<ul>\n<li><a href=\"https://microformats.org/wiki/microformats2\">Microformats 2</a></li>\n<li>\n<a href=\"https://schema.org/\">Schema.org</a> using <a href=\"https://json-ld.org/\">embedded JSON+LD</a>\n</li>\n<li><a href=\"https://ogp.me/\">Open Graph protocol</a></li>\n<li>\n<a href=\"https://developer.twitter.com/en/docs/twitter-for-websites/cards/overview/abouts-cards\">Twitter cards</a> (although they’re becoming less relevant these days for obvious reasons)</li>\n</ul>\n<p>Additionally, I’ve been thinking about subscription feed formats and standards that a publisher needs to support in order to help users and third-party software platforms to learn about new content.</p>\n<p>These might include:</p>\n<ul>\n<li>\n<a href=\"https://en.wikipedia.org/wiki/RSS\">RSS</a> with <a href=\"https://www.w3.org/TR/websub/\">WebSub</a>\n</li>\n<li>\n<a href=\"https://en.wikipedia.org/wiki/Media_RSS\">MRSS</a> for syndication to other media properties (like Yahoo News)</li>\n<li><a href=\"https://microformats.org/wiki/h-feed\">h-feed</a></li>\n<li>\n<a href=\"https://activitystrea.ms/\">ActivityStreams</a> / <a href=\"https://www.w3.org/TR/activitypub/\">ActivityPub</a>\n</li>\n</ul>\n<p>What am I missing?</p>\n<p>And more importantly, how can we streamline?</p>",
            "value": "I’m working on creating a list of metadata formats that a web publisher absolutely must support. These are formats that provide structured information in order to help with one of the following use cases:Help platforms to display rich previews when a link from the publisher is shared\nHelp search engines to figure out what to display in results, and which information is helpful\nHelp third-party clients to interact with web page data in some way (for example to extract information about an event that might be hosted on the publisher’s site)\nThese might include:Microformats 2\nSchema.org using embedded JSON+LD\nOpen Graph protocol\nTwitter cards (although they’re becoming less relevant these days for obvious reasons)\nAdditionally, I’ve been thinking about subscription feed formats and standards that a publisher needs to support in order to help users and third-party software platforms to learn about new content.These might include:RSS with WebSub\nMRSS for syndication to other media properties (like Yahoo News)\nh-feed\nActivityStreams / ActivityPub\nWhat am I missing?And more importantly, how can we streamline?"
          }
        ],
        "url": [
          "https://werd.io/2023/metadata-standards-for-publishers"
        ],
        "published": [
          "2023-03-08T19:24:28+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "Small communities federated together using the same underlying standards feel obvious to me as the future of social. But I'm neck-deep in it and have been advocating for this for twenty years. So why am I wrong?"
        ],
        "content": [
          {
            "html": "Small communities federated together using the same underlying standards feel obvious to me as the future of social. But I'm neck-deep in it and have been advocating for this for twenty years. So why am I wrong?",
            "value": "Small communities federated together using the same underlying standards feel obvious to me as the future of social. But I'm neck-deep in it and have been advocating for this for twenty years. So why am I wrong?"
          }
        ],
        "url": [
          "https://werd.io/2023/small-communities-federated-together-using-the-same"
        ],
        "published": [
          "2023-03-03T14:09:21+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "Reading, watching, playing, using: February 2023"
        ],
        "content": [
          {
            "html": "<p>This is my monthly roundup of the articles I found interesting. Here’s my list for February, 2023: a shorter list because it’s been a very hard month for lots of reasons.</p>\n<h3>Notable Articles</h3>\n<h4>AI</h4>\n<p><a href=\"https://pcmag.com/news/sci-fi-mag-pauses-submissions-amid-flood-of-ai-generated-short-stories\">Sci-Fi Mag Pauses Submissions Amid Flood of AI-Generated Short Stories.</a> “The rise of AI-powered chatbots is wreaking havoc on the literary world. Sci-fi publication Clarkesworld Magazine is temporarily suspending short story submissions, citing a surge in people using AI chatbots to “plagiarize” their writing.”</p>\n<p><a href=\"https://vice.com/en/article/dy7mww/ai-voice-firm-4chan-celebrity-voices-emma-watson-joe-rogan-elevenlabs\">AI-Generated Voice Firm Clamps Down After 4chan Makes Celebrity Voices for Abuse.</a> “In one example, a generated voice that sounds like actor Emma Watson reads a section of Mein Kampf. In another, a voice very similar to Ben Shapiro makes racist remarks about Alexandria Ocasio-Cortez. In a third, someone saying “trans rights are human rights” is strangled.”</p>\n<h4>Climate</h4>\n<p><a href=\"https://eenews.net/articles/census-disasters-displaced-more-than-3m-americans-in-2022\">Disasters displaced more than 3M Americans in 2022.</a> “More than 3 million adults were forced to evacuate their homes in the past year because of a natural disaster, according to a new Census Bureau tally that marks a rare federal effort to assess the uprooting caused by hurricanes, floods and other events. The Census Bureau estimate far exceeds other counts of U.S. evacuees and reflects the uncertainty about how much disruption disasters and climate change are causing. Census figures show that 3.4 million adults were displaced in 2022, or 1.4 percent of the U.S. adult population.”</p>\n<h4>Crypto</h4>\n<p><a href=\"https://newsletter.mollywhite.net/p/sam-bankman-fried-is-not-a-child\">Sam Bankman-Fried is not a child.</a> “SBF is being extended the benefit of the doubt that many are not so lucky to get. He is affluent, white, male, and accused of white-collar crimes, and so he is granted the charitable characterization of a naive boy. Meanwhile, the perception that Black children, particularly those accused of violent crimes, are adult criminals has earned its own term: adultification bias.”</p>\n<p><a href=\"https://newsletter.mollywhite.net/p/the-celsius-examiners-report-a-picture\">The Celsius examiner's report: a picture of fraud and incompetence.</a> “For some reason, Pillay stops short of outright stating that “Celsius was a Ponzi scheme”, but the facts speak for themselves.”</p>\n<h4>Culture</h4>\n<p><a href=\"https://vulture.com/article/the-last-of-us-is-not-a-video-game-adaptation.html\">‘The Last of Us’ Is Not a Video-Game Adaptation.</a> “Here, we may rightly speak of interactivity: One may care about a character on television, but one must care for a character in a video game. In fact, The Last of Us suggested that care, by definition, means choosing to have no choice, holding onto another person so tightly their survival becomes an inescapable necessity.”</p>\n<p><a href=\"https://shkspr.mobi/blog/2023/02/the-mobile-phones-of-doctor-who-the-motherlode-of-props\">The Mobile Phones of Doctor Who – The Motherlode of Props.</a> “If you’re a Doctor Who fan - I promise that this post is going to please you greatly!” Reader, it did.</p>\n<p><a href=\"http://williamgallagher.com/selfdistract/2023/02/03/dont-write-this-write-that\">Don’t write this, write that.</a> “Yet despite all of this, I don’t believe you can ignore the audience. You can’t aim at them, you can’t change to suit an imaginary audience in the hope of getting a real one. But writing is not for writers, it is for readers and if they are not in your mind in some way, I think your writing becomes self-indulgent.”</p>\n<p><a href=\"https://19thnews.org/2023/02/last-of-us-queer-aids-crisis\">In ‘The Last of Us,’ a survivor of the AIDS crisis saw his partner's death honored.</a> ““As I’m watching it, I’m like, ‘Oh my god,’ [‘The Last of Us’ co-showrunner] Craig Mazin wrote this piece that just made me feel like someone saw me and Robert,” he said. “Somehow Mazin wrote this piece of art that reflected not just the life that Robert and I had, a falling in love in this dystopian time, but the lives of so many of my friends who also found loves that they loved and lost.””</p>\n<h4>Democracy</h4>\n<p><a href=\"https://19thnews.org/2023/02/2024-presidential-race-abortion-lgbtq-gender\">Biden, Sanders, Haley and the state of the 2024 presidential race.</a> “I wanted to hear from some of the women I talk to about politics on their takeaways and what the week portends for the upcoming election cycle as both parties attempt to turn voters’ attention to the 2024 race. Their conclusion? The state of the union is incredibly fractious.”</p>\n<p><a href=\"https://19thnews.org/2023/02/biden-state-of-the-union-word-count\">How much Biden talked about abortion, LGBTQ+ rights.</a> “During his State of the Union address Tuesday evening, President Joe Biden devoted more words to abortion and fewer to LGBTQ+ rights in 2023 than in previous years, spending 72 and 35 words, respectively, on the topics out of a nearly 7,300-word speech.”</p>\n<p><a href=\"https://boston.com/news/politics/2023/02/01/massachusetts-bill-prison-time-bone-marrow-organ-donations\">A Mass. bill would cut prison time for organ donations. An advocate is calling the measure 'unethical and depraved.'.</a> ““They’re a marginalized group in society, highly stigmatized and extremely vulnerable,” Cox said in an interview. “And so to incentivize the selling of your body parts in exchange for the most precious commodity in the world — which is time on this earth, and your freedom — was just so appalling.””</p>\n<h4>Health</h4>\n<p><a href=\"https://columbiasurgery.org/news/one-ten-lung-transplants-go-covid-19-patients-here-s-what-we-know\">One in Ten Lung Transplants Go to Covid-19 Patients: Here’s What We Know.</a> “According to data from the United Network for Organ Transplants (UNOS), in the U.S., about one in 10 lung transplants now go to COVID-19 patients. [...] COVID seems to cause very severe pneumonia in some patients, leading to acute respiratory distress syndrome (ARDS) and even leading to pulmonary fibrosis in some patients.”</p>\n<h4>Media</h4>\n<p><a href=\"https://tandfonline.com/doi/full/10.1080/25785648.2023.2168939\">Wikipedia’s Intentional Distortion of the History of the Holocaust.</a> “Due to this group’s zealous handiwork, Wikipedia’s articles on the Holocaust in Poland minimize Polish antisemitism, exaggerate the Poles’ role in saving Jews, insinuate that most Jews supported Communism and conspired with Communists to betray Poles, blame Jews for their own persecution, and inflate Jewish collaboration with the Nazis.”</p>\n<p><a href=\"https://cjr.org/tow_center/journalists-remain-on-twitter-but-tweet-slightly-less.php\">Journalists Remain on Twitter, but Tweet Slightly Less.</a> “As it turned out, not enough people were migrating off Twitter and onto the same platforms as Grimes for it to be a sufficient replacement. On Mastodon, she has a much smaller and less diverse community that didn’t let her obtain the same level of reporting. Likewise, the 40,000 followers she has accumulated over the past 15 years on Twitter weren’t gonna migrate overnight either.”</p>\n<p><a href=\"https://tracydurnell.com/2023/02/06/reputation-instead-of-personal-brand\">Build a reputation instead of a personal brand.</a> “I find myself drawn more to what individuals are writing than publications; if others are like me, all the publications who treat their staff as disposable and interchangeable will be in for a rough ride when they try to replace them all with AI churn content. […] I read my first Ed Yong article because I was interested in COVID; his thoughtful writing and reporting earned my trust, so I started following him on Twitter — not The Atlantic.”</p>\n<p><a href=\"https://themarkup.org/hello-world/2023/02/04/journalistic-lessons-for-the-algorithmic-age\">Journalistic Lessons for the Algorithmic Age.</a> “Before I go, I wanted to share the lessons I learned building a newsroom that integrated engineers with journalists and sought to use a new model for accountability journalism: the scientific method.”</p>\n<p><a href=\"https://mailchi.mp/19thnews/i-wiped-my-eyes-and-wrote-the-facts\">'I wiped my eyes and wrote the facts'.</a> “As a reporter, I felt tasked with the duty of accurately representing this funeral and the vile circumstances that led to it. As a Black reporter, I felt a duty to bear witness to his unjust death and the burden of grief that came with it.” This edition of The 19th’s weekly newsletter is breathtakingly written. Yet another reason I’m proud to work there.</p>\n<p><a href=\"https://lyz.substack.com/p/medias-money-problem\">Media's Money Problem.</a> “Low pay and grueling hours mean barriers to entry that skew journalism toward a certain demographic — white and male. It’s impossible to do your best work shining light on the activities of elected officials when you make $12 an hour and those same elected officials are organizing social media campaigns to put you out of work altogether. And it’s impossible to cover the needed range and depth of stories when you are overworked and underpaid and understaffed.”</p>\n<h4>Science</h4>\n<p><a href=\"https://jayhancock.substack.com/p/lost-letters-show-erasure-of-dna\">Lost Letters Show Erasure Of DNA Heroine.</a> “It was Franklin who was sabotaged. Three times her pivotal results were shared by male scientists with other male scientists without her permission and behind her back — once when a PhD student gave Wilkins the picture, once when Wilkins showed it to Watson and again when a grant administrator showed a summary of her work to Crick.”</p>\n<p><a href=\"https://arstechnica.com/science/2023/02/squid-skin-inspires-novel-liquid-windows-for-greater-energy-savings\">Squid skin inspires novel “liquid windows” for greater energy savings.</a> “The idea of a building that can learn, that can adjust this dynamic array on its own to optimize for seasonal and daily changes in solar conditions, is very exciting for us.” No kidding!</p>\n<h4>Society</h4>\n<p><a href=\"https://themarkup.org/investigation/2023/02/28/l-a-s-scoring-system-for-subsidized-housing-gives-black-and-latino-people-experiencing-homelessness-lower-priority-scores\">L.A.’s Scoring System for Subsidized Housing Gives Black and Latino People Experiencing Homelessness Lower Priority Scores.</a> “An analysis of more than 130,000 VI‑SPDAT surveys taken in the Los Angeles area as far back as 2016 found that White people received scores considered “high acuity”—or most in need—more often than Black people, and that gap persisted year over year.”</p>\n<p><a href=\"https://19thnews.org/2023/02/abortion-data-rates-after-dobbs\">How abortion data rates will change after Dobbs.</a> “We find that there’s really, really significant levels of underreporting to the point where really, most survey data on abortion is is not useful, which is a real challenge because that’s a lot of how social science researchers collect data”</p>\n<p><a href=\"https://vannevar.blogspot.com/2023/02/austin-fedexdal-disaster-jfk-incursion.html\">Safety Systems Gone Wrong.</a> “Why do we tolerate a police system - ostensibly a public safety system - that kills more Americans than aviation does, with some cops walking around indifferent to safety? And yet we’re petrified about two airplanes getting too close.”</p>\n<p><a href=\"https://19thnews.org/2023/02/state-of-the-union-tyre-nichols-rowvaughn-wells\">‘They need to see’: RowVaughn Wells on what it means to attend Biden’s State of the Union address.</a> “For the first time at a State of the Union address on Tuesday night, the mother of a Black man killed by police will be a guest of the first lady of the United States. Other parents with similar tragedies will be in attendance as the guests of members of the House of Representatives; they will be visible reminders of the parade of unarmed Black Americans who have lost their lives, representing families calling for change in the wake of tragedy.”</p>\n<p><a href=\"https://19thnews.org/2023/02/family-medical-leave-law-30\">Advocates mark the 30th anniversary of the Family and Medical Leave Act.</a> “Advocates 30 years ago saw the passage of FMLA as the beginning, not the end, of what was possible at the federal level. But while hundreds of millions have benefited from the program, the United States remains the only wealthy nation without any national, guaranteed paid leave policy three decades on.”</p>\n<p><a href=\"https://19thnews.org/2023/02/child-care-crisis-economy-parents-jobs\">Child care crisis is causing parents to leave their jobs or get fired, study shows.</a> “Of the parents surveyed, 26 percent quit their jobs because of child care problems and 23 percent were fired. The number of parents who were fired or had their pay reduced is three times as high as it was just five years ago. The rate of parents quitting has doubled since 2018.“</p>\n<p><a href=\"https://19thnews.org/2023/02/where-is-abortion-legal-americans-unsure-poll-shows\">Where is abortion legal? Almost half of all Americans aren’t sure, new poll shows.</a> “Half of women are unsure if medication abortion is legal in their state, and a third don’t know if they are allowed to access emergency contraceptive pills, new polling from the Kaiser Family Foundation (KFF) found.”</p>\n<h4>Technology</h4>\n<p><a href=\"https://jacky.wtf/2023/2/7y35\">There's a reason why there's no United States version of NLNet.</a> “There’s a reason why there’s no United States version of NLNet - that’d encourage public services built by people using public dollars. That’d run counter to organizations like Microsoft, Accenture, IBM, Amazon and the like who make money by siloing government infrastructure and forcing citizens to accept sub-par solutions (that other groups have to hack around).”</p>\n<p><a href=\"https://ez.substack.com/p/techs-elite-hates-labor\">Tech's Elite Hates Labor.</a> “I believe that a worryingly large amount of the most powerful people in technology have seen the growth of workers’ rights as a symptom of a broken market.”</p>\n<p><a href=\"https://docs.google.com/document/d/15It9y-Nx8ZXV6b4yEzrBtMpIdnC6APURnMhvk5DRD_Q/edit\">Fediverse Funding Opportunities.</a> “At the moment, there’s funding for a handful of micro-grants (non-profit) or micro-investments (for-profit) up to ~$30k each. If your project needs greater funding, please submit it anyway; things can (and probably will) change quickly, and your proposal will help make the case for larger allocations to the fediverse.”</p>\n<p><a href=\"https://businessinsider.com/fire-blame-ceo-tech-employee-layoffs-google-facebook-salesforce-amazon-2023-2\">Blame the CEO for Tech Layoffs at Google, Facebook, Salesforce, Amazon.</a> “Any executive who participates in decision-making that leads to hundreds or thousands of people losing their jobs should be the one leading them out the door. Pichai and other tech CEOs shouldn’t be making $280 million a year or even $1 million a year — they should be fired for poorly managing some of the largest companies in the world.”</p>\n<p><a href=\"https://latimes.com/business/technology/story/2023-01-30/column-how-big-tech-is-using-mass-layoffs-to-bring-workers-to-heel\">Big Tech is using layoffs to crush worker power.</a> “Workers in an industry that had long been famously union-agnostic at best had been forming bonds, organizing and developing solidarity. Layoffs of this scale and suddenness can be a blow to that process. […] If there’s one thing that firing people in a large-scale and seemingly random way accomplishes, it’s instilling a sense of precarity, even fear, in those who remain.”</p>\n<p><a href=\"https://wired.com/story/tiktok-platforms-cory-doctorow\">The ‘Enshittification’ of TikTok.</a> “This is enshittification: Surpluses are first directed to users; then, once they’re locked in, surpluses go to suppliers; then once they’re locked in, the surplus is handed to shareholders and the platform becomes a useless pile of shit. From mobile app stores to Steam, from Facebook to Twitter, this is the enshittification lifecycle.”</p>\n<p><a href=\"https://words.filippo.io/full-time-maintainer\">I’m Now a Full-Time Professional Open Source Maintainer.</a> “Long term, I want this model to grow beyond me and become a known professional path. This experiment is both easier and harder for me than it will be for those after me: easier because I have an extensive personal network and the financial means to safely take risks; harder because it’s uncharted territory for both me and the clients and because there’s a lack of legal, administrative, and marketing tools. I hope that as things progress the barriers will lower, making the model accessible to more and more people.” Inspiring!</p>\n<p><a href=\"https://techdirt.com/2023/02/01/shotspotter-employees-not-only-have-the-power-to-alter-gunshot-reports-but-do-it-nearly-10-of-the-time\">ShotSpotter Employees Not Only Have The Power To Alter Gunshot Reports, But Do It Nearly 10% Of The Time.</a> “ShotSpotter’s human techs don’t just alter reports to distinguish things like a car’s backfiring from a suspected criminal’s gun firing. They also alter determinations and gunshot locations to better serve the needs of law enforcement agencies that interact with them.”</p>",
            "value": "This is my monthly roundup of the articles I found interesting. Here’s my list for February, 2023: a shorter list because it’s been a very hard month for lots of reasons.Notable ArticlesAISci-Fi Mag Pauses Submissions Amid Flood of AI-Generated Short Stories. “The rise of AI-powered chatbots is wreaking havoc on the literary world. Sci-fi publication Clarkesworld Magazine is temporarily suspending short story submissions, citing a surge in people using AI chatbots to “plagiarize” their writing.”AI-Generated Voice Firm Clamps Down After 4chan Makes Celebrity Voices for Abuse. “In one example, a generated voice that sounds like actor Emma Watson reads a section of Mein Kampf. In another, a voice very similar to Ben Shapiro makes racist remarks about Alexandria Ocasio-Cortez. In a third, someone saying “trans rights are human rights” is strangled.”ClimateDisasters displaced more than 3M Americans in 2022. “More than 3 million adults were forced to evacuate their homes in the past year because of a natural disaster, according to a new Census Bureau tally that marks a rare federal effort to assess the uprooting caused by hurricanes, floods and other events. The Census Bureau estimate far exceeds other counts of U.S. evacuees and reflects the uncertainty about how much disruption disasters and climate change are causing. Census figures show that 3.4 million adults were displaced in 2022, or 1.4 percent of the U.S. adult population.”CryptoSam Bankman-Fried is not a child. “SBF is being extended the benefit of the doubt that many are not so lucky to get. He is affluent, white, male, and accused of white-collar crimes, and so he is granted the charitable characterization of a naive boy. Meanwhile, the perception that Black children, particularly those accused of violent crimes, are adult criminals has earned its own term: adultification bias.”The Celsius examiner's report: a picture of fraud and incompetence. “For some reason, Pillay stops short of outright stating that “Celsius was a Ponzi scheme”, but the facts speak for themselves.”Culture‘The Last of Us’ Is Not a Video-Game Adaptation. “Here, we may rightly speak of interactivity: One may care about a character on television, but one must care for a character in a video game. In fact, The Last of Us suggested that care, by definition, means choosing to have no choice, holding onto another person so tightly their survival becomes an inescapable necessity.”The Mobile Phones of Doctor Who – The Motherlode of Props. “If you’re a Doctor Who fan - I promise that this post is going to please you greatly!” Reader, it did.Don’t write this, write that. “Yet despite all of this, I don’t believe you can ignore the audience. You can’t aim at them, you can’t change to suit an imaginary audience in the hope of getting a real one. But writing is not for writers, it is for readers and if they are not in your mind in some way, I think your writing becomes self-indulgent.”In ‘The Last of Us,’ a survivor of the AIDS crisis saw his partner's death honored. ““As I’m watching it, I’m like, ‘Oh my god,’ [‘The Last of Us’ co-showrunner] Craig Mazin wrote this piece that just made me feel like someone saw me and Robert,” he said. “Somehow Mazin wrote this piece of art that reflected not just the life that Robert and I had, a falling in love in this dystopian time, but the lives of so many of my friends who also found loves that they loved and lost.””DemocracyBiden, Sanders, Haley and the state of the 2024 presidential race. “I wanted to hear from some of the women I talk to about politics on their takeaways and what the week portends for the upcoming election cycle as both parties attempt to turn voters’ attention to the 2024 race. Their conclusion? The state of the union is incredibly fractious.”How much Biden talked about abortion, LGBTQ+ rights. “During his State of the Union address Tuesday evening, President Joe Biden devoted more words to abortion and fewer to LGBTQ+ rights in 2023 than in previous years, spending 72 and 35 words, respectively, on the topics out of a nearly 7,300-word speech.”A Mass. bill would cut prison time for organ donations. An advocate is calling the measure 'unethical and depraved.'. ““They’re a marginalized group in society, highly stigmatized and extremely vulnerable,” Cox said in an interview. “And so to incentivize the selling of your body parts in exchange for the most precious commodity in the world — which is time on this earth, and your freedom — was just so appalling.””HealthOne in Ten Lung Transplants Go to Covid-19 Patients: Here’s What We Know. “According to data from the United Network for Organ Transplants (UNOS), in the U.S., about one in 10 lung transplants now go to COVID-19 patients. [...] COVID seems to cause very severe pneumonia in some patients, leading to acute respiratory distress syndrome (ARDS) and even leading to pulmonary fibrosis in some patients.”MediaWikipedia’s Intentional Distortion of the History of the Holocaust. “Due to this group’s zealous handiwork, Wikipedia’s articles on the Holocaust in Poland minimize Polish antisemitism, exaggerate the Poles’ role in saving Jews, insinuate that most Jews supported Communism and conspired with Communists to betray Poles, blame Jews for their own persecution, and inflate Jewish collaboration with the Nazis.”Journalists Remain on Twitter, but Tweet Slightly Less. “As it turned out, not enough people were migrating off Twitter and onto the same platforms as Grimes for it to be a sufficient replacement. On Mastodon, she has a much smaller and less diverse community that didn’t let her obtain the same level of reporting. Likewise, the 40,000 followers she has accumulated over the past 15 years on Twitter weren’t gonna migrate overnight either.”Build a reputation instead of a personal brand. “I find myself drawn more to what individuals are writing than publications; if others are like me, all the publications who treat their staff as disposable and interchangeable will be in for a rough ride when they try to replace them all with AI churn content. […] I read my first Ed Yong article because I was interested in COVID; his thoughtful writing and reporting earned my trust, so I started following him on Twitter — not The Atlantic.”Journalistic Lessons for the Algorithmic Age. “Before I go, I wanted to share the lessons I learned building a newsroom that integrated engineers with journalists and sought to use a new model for accountability journalism: the scientific method.”'I wiped my eyes and wrote the facts'. “As a reporter, I felt tasked with the duty of accurately representing this funeral and the vile circumstances that led to it. As a Black reporter, I felt a duty to bear witness to his unjust death and the burden of grief that came with it.” This edition of The 19th’s weekly newsletter is breathtakingly written. Yet another reason I’m proud to work there.Media's Money Problem. “Low pay and grueling hours mean barriers to entry that skew journalism toward a certain demographic — white and male. It’s impossible to do your best work shining light on the activities of elected officials when you make $12 an hour and those same elected officials are organizing social media campaigns to put you out of work altogether. And it’s impossible to cover the needed range and depth of stories when you are overworked and underpaid and understaffed.”ScienceLost Letters Show Erasure Of DNA Heroine. “It was Franklin who was sabotaged. Three times her pivotal results were shared by male scientists with other male scientists without her permission and behind her back — once when a PhD student gave Wilkins the picture, once when Wilkins showed it to Watson and again when a grant administrator showed a summary of her work to Crick.”Squid skin inspires novel “liquid windows” for greater energy savings. “The idea of a building that can learn, that can adjust this dynamic array on its own to optimize for seasonal and daily changes in solar conditions, is very exciting for us.” No kidding!SocietyL.A.’s Scoring System for Subsidized Housing Gives Black and Latino People Experiencing Homelessness Lower Priority Scores. “An analysis of more than 130,000 VI‑SPDAT surveys taken in the Los Angeles area as far back as 2016 found that White people received scores considered “high acuity”—or most in need—more often than Black people, and that gap persisted year over year.”How abortion data rates will change after Dobbs. “We find that there’s really, really significant levels of underreporting to the point where really, most survey data on abortion is is not useful, which is a real challenge because that’s a lot of how social science researchers collect data”Safety Systems Gone Wrong. “Why do we tolerate a police system - ostensibly a public safety system - that kills more Americans than aviation does, with some cops walking around indifferent to safety? And yet we’re petrified about two airplanes getting too close.”‘They need to see’: RowVaughn Wells on what it means to attend Biden’s State of the Union address. “For the first time at a State of the Union address on Tuesday night, the mother of a Black man killed by police will be a guest of the first lady of the United States. Other parents with similar tragedies will be in attendance as the guests of members of the House of Representatives; they will be visible reminders of the parade of unarmed Black Americans who have lost their lives, representing families calling for change in the wake of tragedy.”Advocates mark the 30th anniversary of the Family and Medical Leave Act. “Advocates 30 years ago saw the passage of FMLA as the beginning, not the end, of what was possible at the federal level. But while hundreds of millions have benefited from the program, the United States remains the only wealthy nation without any national, guaranteed paid leave policy three decades on.”Child care crisis is causing parents to leave their jobs or get fired, study shows. “Of the parents surveyed, 26 percent quit their jobs because of child care problems and 23 percent were fired. The number of parents who were fired or had their pay reduced is three times as high as it was just five years ago. The rate of parents quitting has doubled since 2018.“Where is abortion legal? Almost half of all Americans aren’t sure, new poll shows. “Half of women are unsure if medication abortion is legal in their state, and a third don’t know if they are allowed to access emergency contraceptive pills, new polling from the Kaiser Family Foundation (KFF) found.”TechnologyThere's a reason why there's no United States version of NLNet. “There’s a reason why there’s no United States version of NLNet - that’d encourage public services built by people using public dollars. That’d run counter to organizations like Microsoft, Accenture, IBM, Amazon and the like who make money by siloing government infrastructure and forcing citizens to accept sub-par solutions (that other groups have to hack around).”Tech's Elite Hates Labor. “I believe that a worryingly large amount of the most powerful people in technology have seen the growth of workers’ rights as a symptom of a broken market.”Fediverse Funding Opportunities. “At the moment, there’s funding for a handful of micro-grants (non-profit) or micro-investments (for-profit) up to ~$30k each. If your project needs greater funding, please submit it anyway; things can (and probably will) change quickly, and your proposal will help make the case for larger allocations to the fediverse.”Blame the CEO for Tech Layoffs at Google, Facebook, Salesforce, Amazon. “Any executive who participates in decision-making that leads to hundreds or thousands of people losing their jobs should be the one leading them out the door. Pichai and other tech CEOs shouldn’t be making $280 million a year or even $1 million a year — they should be fired for poorly managing some of the largest companies in the world.”Big Tech is using layoffs to crush worker power. “Workers in an industry that had long been famously union-agnostic at best had been forming bonds, organizing and developing solidarity. Layoffs of this scale and suddenness can be a blow to that process. […] If there’s one thing that firing people in a large-scale and seemingly random way accomplishes, it’s instilling a sense of precarity, even fear, in those who remain.”The ‘Enshittification’ of TikTok. “This is enshittification: Surpluses are first directed to users; then, once they’re locked in, surpluses go to suppliers; then once they’re locked in, the surplus is handed to shareholders and the platform becomes a useless pile of shit. From mobile app stores to Steam, from Facebook to Twitter, this is the enshittification lifecycle.”I’m Now a Full-Time Professional Open Source Maintainer. “Long term, I want this model to grow beyond me and become a known professional path. This experiment is both easier and harder for me than it will be for those after me: easier because I have an extensive personal network and the financial means to safely take risks; harder because it’s uncharted territory for both me and the clients and because there’s a lack of legal, administrative, and marketing tools. I hope that as things progress the barriers will lower, making the model accessible to more and more people.” Inspiring!ShotSpotter Employees Not Only Have The Power To Alter Gunshot Reports, But Do It Nearly 10% Of The Time. “ShotSpotter’s human techs don’t just alter reports to distinguish things like a car’s backfiring from a suspected criminal’s gun firing. They also alter determinations and gunshot locations to better serve the needs of law enforcement agencies that interact with them.”"
          }
        ],
        "url": [
          "https://werd.io/2023/reading-watching-playing-using-february-2023"
        ],
        "published": [
          "2023-03-01T16:29:13+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "I moved to Philadelphia"
        ],
        "content": [
          {
            "html": "<p>So, I live in Philly now.</p>\n<p>Or to be more specific, Elkins Park, which is an area in Cheltenham Township, just on the other side of Philadelphia’s northern border. If you’ve read <a href=\"https://bookshop.org/a/7949/9781663616623\">Ann Patchett’s <em>The Dutch House</em></a>, you’re already familiar.</p>\n<p>I know comparatively little about the area, although I’ve had family in Pennsylvania for generations. My great aunt lived here in the city for a very long time and still misses it; my grandfather spent his early years a few hours away in <a href=\"https://bangorborough.org/\">Bangor</a>.</p>\n<p>I’m excited to learn, meet new people, and try new things. As the parent of a six month old and someone who still believes the pandemic exists, I’m <em>not</em> particularly excited to go to group events, but I’d love recommendations for things you think I should be doing.</p>",
            "value": "So, I live in Philly now.Or to be more specific, Elkins Park, which is an area in Cheltenham Township, just on the other side of Philadelphia’s northern border. If you’ve read Ann Patchett’s The Dutch House, you’re already familiar.I know comparatively little about the area, although I’ve had family in Pennsylvania for generations. My great aunt lived here in the city for a very long time and still misses it; my grandfather spent his early years a few hours away in Bangor.I’m excited to learn, meet new people, and try new things. As the parent of a six month old and someone who still believes the pandemic exists, I’m not particularly excited to go to group events, but I’d love recommendations for things you think I should be doing."
          }
        ],
        "url": [
          "https://werd.io/2023/i-moved-to-philadelphia"
        ],
        "published": [
          "2023-02-28T16:52:25+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "\"Enter your email address to keep reading. This is not a paywall.\"\n\nI beg to differ: it is a paywall. Just not one where the currency is cash. You're paying with your attention, your identity, and your data."
        ],
        "content": [
          {
            "html": "\"Enter your email address to keep reading. This is not a paywall.\"<br>\n<br>\nI beg to differ: it is a paywall. Just not one where the currency is cash. You're paying with your attention, your identity, and your data.",
            "value": "\"Enter your email address to keep reading. This is not a paywall.\"\n\nI beg to differ: it is a paywall. Just not one where the currency is cash. You're paying with your attention, your identity, and your data."
          }
        ],
        "url": [
          "https://werd.io/2023/quotenter-your-email-address-to-keep-reading"
        ],
        "published": [
          "2023-02-24T14:44:55+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "I need to do a better job of explaining what I mean"
        ],
        "content": [
          {
            "html": "<p>I’m grateful to have received feedback, from multiple people in multiple places, that some of my writing is hard to understand. My working life is so saturated with jargon that I often forget to stop and define terms - so, for example, while <em>I</em> know what I mean by “human-centered design” or “the open web”, I’m leaving some of my readers confused. Even when people are familiar with those terms, they can be so ambiguous that my definition may differ from theirs.</p>\n<p>I <em>love</em> feedback like this: it’s something I can actively work to get better at.</p>\n<p>So, first: this post is a commitment to make my writing more accessible, regardless of the reader’s background.</p>\n<p>Secondly: I’ve been wondering if there’s an opportunity to intentionally dive into those explanations. Let’s take “human-centered design” as an example: I think there’s value in not just defining it, but explaining how one might go about it, using how <em>I</em> try and practice it in my work as an illustration.</p>\n<p>I could do that here in this space, or in an accompanying website that is sometimes referenced from here. Explainers and documentation are not as time-centered as a blog is: while blogs and newsletters are organized like journals, where updates are included in subsequent entries, I think definitions and explainers are more useful when published as web pages that evolve over time.</p>\n<p>My very first blog, which has long since been lost to time, had a glossary feature that I built to support exactly these kinds of explanations. What I’m describing goes further than a glossary, but serves the same purpose: if I have a web page about “human-centered design” that evolves as my understanding evolves, every time I write a post that references that topic, I can link to it, and you’ll have a better idea of what I mean, as well as links to further resources.</p>\n<p>This isn’t a substitute for clearer writing - which, again, I’m going to work hard to provide - but hopefully can be a resource that deepens that writing and makes it more valuable.</p>\n<p>Let’s see. I’ll start with the very next post.</p>",
            "value": "I’m grateful to have received feedback, from multiple people in multiple places, that some of my writing is hard to understand. My working life is so saturated with jargon that I often forget to stop and define terms - so, for example, while I know what I mean by “human-centered design” or “the open web”, I’m leaving some of my readers confused. Even when people are familiar with those terms, they can be so ambiguous that my definition may differ from theirs.I love feedback like this: it’s something I can actively work to get better at.So, first: this post is a commitment to make my writing more accessible, regardless of the reader’s background.Secondly: I’ve been wondering if there’s an opportunity to intentionally dive into those explanations. Let’s take “human-centered design” as an example: I think there’s value in not just defining it, but explaining how one might go about it, using how I try and practice it in my work as an illustration.I could do that here in this space, or in an accompanying website that is sometimes referenced from here. Explainers and documentation are not as time-centered as a blog is: while blogs and newsletters are organized like journals, where updates are included in subsequent entries, I think definitions and explainers are more useful when published as web pages that evolve over time.My very first blog, which has long since been lost to time, had a glossary feature that I built to support exactly these kinds of explanations. What I’m describing goes further than a glossary, but serves the same purpose: if I have a web page about “human-centered design” that evolves as my understanding evolves, every time I write a post that references that topic, I can link to it, and you’ll have a better idea of what I mean, as well as links to further resources.This isn’t a substitute for clearer writing - which, again, I’m going to work hard to provide - but hopefully can be a resource that deepens that writing and makes it more valuable.Let’s see. I’ll start with the very next post."
          }
        ],
        "url": [
          "https://werd.io/2023/i-need-to-do-a-better-job-of-explaining-what"
        ],
        "published": [
          "2023-02-09T15:58:56+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "For a while I was deeply into the podcasting universe, but these days I really just want text that I can consume in my own way, at my own pace, using my own imagination. Call it impatience. But I love that podcasts exist and that so many people make and listen."
        ],
        "content": [
          {
            "html": "For a while I was deeply into the podcasting universe, but these days I really just want text that I can consume in my own way, at my own pace, using my own imagination. Call it impatience. But I love that podcasts exist and that so many people make and listen.",
            "value": "For a while I was deeply into the podcasting universe, but these days I really just want text that I can consume in my own way, at my own pace, using my own imagination. Call it impatience. But I love that podcasts exist and that so many people make and listen."
          }
        ],
        "url": [
          "https://werd.io/2023/for-a-while-i-was-deeply-into"
        ],
        "published": [
          "2023-02-05T18:16:48+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "Follow this site on the fediverse"
        ],
        "content": [
          {
            "html": "<p>You can now subscribe to my website on Mastodon / the fediverse by plugging <code>@werd.io@werd.io</code> into your search bar and hitting “follow”.</p>\n<p>It was really easy. Here’s how I did it:</p>\n<ol>\n<li>I signed up to <a href=\"https://fed.brid.gy/\">Bridgy Fed</a>\n</li>\n<li>Made sure my website produces an <a href=\"https://microformats.org/wiki/h-card\">h-card</a> that describes it well (Known does this out of the box).</li>\n<li>Added a single line to the top of my website redirects.</li>\n<li>That’s it.</li>\n</ol>\n<p><a href=\"https://snarfed.org/\">Ryan Barrett</a>, who builds and supports the <a href=\"https://brid.gy/\">Bridgy</a> set of services, is brilliant, and this simple tool is another reason why. I really appreciate how easy this was.</p>",
            "value": "You can now subscribe to my website on Mastodon / the fediverse by plugging @werd.io@werd.io into your search bar and hitting “follow”.It was really easy. Here’s how I did it:I signed up to Bridgy Fed\nMade sure my website produces an h-card that describes it well (Known does this out of the box).\nAdded a single line to the top of my website redirects.\nThat’s it.\nRyan Barrett, who builds and supports the Bridgy set of services, is brilliant, and this simple tool is another reason why. I really appreciate how easy this was."
          }
        ],
        "url": [
          "https://werd.io/2023/follow-this-site-on-the-fediverse"
        ],
        "published": [
          "2023-02-04T19:44:06+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "Resetting professional goals"
        ],
        "content": [
          {
            "html": "<p><img src=\"https://werd.io/file/63dda3a5bf1e9f60fe037bf2/thumb.jpg\" alt=\"Graffiti on a wall that reads: Dream big.\" width=\"1024\" height=\"682\"></p>\n<p>I’ve been spending some time looking carefully at my professional goals.</p>\n<p>A few years ago, I open sourced the <a href=\"https://github.com/benwerd/development\">mission / vision / tactical worksheet I’d been using</a>, which was inspired by high-level organizational strategy. First, it invites you to consider your “mission”:</p>\n<blockquote><p>This is your north star. For example, a possible mission statement is to work on technology that makes the world more equal. Another example of a mission statement is to work at startups building world-class products that change the world.</p></blockquote>\n<p>Then, your “vision”. For a company, the vision is the world you want to create through your mission and activities. For a person, that’s not far off:</p>\n<blockquote><p>This is where you want to see yourself in 5 or 10 years. One long-term goal is to be the founder of a generational tech company. Other long-term goals are to be a senior individual contributor engineer, or an engineering manager, or a product manager at a large tech giant.</p></blockquote>\n<p>And then the near-term steps:</p>\n<blockquote><p>What measurable, actionable steps bring you closer to your goal?</p></blockquote>\n<p>While I’ve found this to be a useful framework, it undeniably suffers from a lack of focus. For example, the definition of a “measurable, actionable step” could vary a great deal from person to person.</p>\n<p>Recently, through professional development at <a href=\"https://19thnews.org/\">The 19th</a>, I was introduced to <a href=\"https://www.managementcenter.org/resources/smartie-goals-worksheet/\">the Management Center’s SMARTIE goals</a>:</p>\n<blockquote><p>SMARTIE stands for Strategic, Measurable, Ambitious, Realistic, Time-bound, Inclusive, and Equitable. By incorporating an equity and inclusion component to your SMART goals, you can make sure your organization’s commitment to racial equity and inclusion is anchored by tangible and actionable steps.</p></blockquote>\n<p>The traditional <a href=\"https://www.mindtools.com/a4wo118/smart-goals\">definition of SMART goals</a> is Specific, Measurable, Achievable, Relevant, and Time-Bound. It’s a useful framework in itself, in the sense that at least it provides some structure and concreteness, but in its definitions it encourages you to diminish mission and values in your work. A goal that is Specific and Achievable is highly likely to just be iterative on what you’re already doing.</p>\n<p>In contrast, SMARTIE encourages you to dream. By replacing Specific with Strategic, we’re encouraged to think longer-term. By replacing Achievable with Ambitious, we’re given permission to stretch for what we <em>really</em> want. Swapping Relevant for Realistic reminds us to keep our feet on the ground, but in paired this with Achievable we’re being asked to find a productive middle ground between our dreams and reality. And then reminding us that our goals must be Inclusive and Equitable ensures that we consider our impact on others, and on our communities and ecosystems.</p>\n<p>I like it a lot.</p>\n<p>Giving me permission to make my goals values-oriented is, in itself, a big deal. I’ve often had to smuggle my values into goals and trade them off with the goals of the organization. Here, I’m asked to put them front and center.</p>\n<p>But the detail-oriented approach and demand for accountability has also made me reconsider my personal mission and vision.</p>\n<p>For years now, my mission has read: <em>To work on projects with the potential to make the world more equal and informed.</em> In itself, it’s been fairly useful: I’ve been able to look at opportunities and ask, “well, <em>does </em>this have the potential to do those things?” And it’s been easy to say “no” to opportunities that don’t.</p>\n<p>But it’s possible for an opportunity to have the potential to make the world more equal and informed but still not be a fit for what I want to do. It doesn’t communicate what I actually <em>do</em>, to myself or anyone else. For example, <a href=\"https://19thnews.org/\">The 19th</a>, my current employer, is clearly an organization with the potential to make the world more equal and informed - it’s a newsroom (check!) that particularly serves women, women of color and the LGBTQ+ community (check!) with the information, resources and community they need to be equal participants in our democracy (check!). So as an organization it’s aligned with my mission. But what does my mission say I should <em>do</em> there? Should I be an illustrator? I’d love that, but I don’t think they’d have me. A journalist? Again, I <em>wish</em>. No, based on my experience as an engineer, founder, and investor, I’m probably better off serving them on the technical side - and even then, by building, supporting, and advising on a particular kind of software.</p>\n<p>So it’s more accurate and useful to say that my mission is <em>to support organizations that have the potential to make the world more equal, open, and informed by building and supporting open web software and strategy</em>.</p>\n<p>It still needs workshopping. But we’re a lot closer: you still know I want to work to help make the world more equal and informed, but now you can more definitively say where I can be helpful and want to be working. It also emphasizes openness: there are plenty of allegedly equal worlds that are authoritarian or limited, and that’s not what I want to be a part of. And in specifying this greater detail, I can make more detailed choices.</p>\n<p>So, onto vision. Perhaps the most famous vision statement in computing is Microsoft’s original wish to create a world with “a microcomputer on every desk and in every home running Microsoft software”, which balanced an intent to markedly change the marketplace (and arguably the world) with making it obvious what Microsoft’s role in that transition would be.</p>\n<p>If a person or organization’s mission is fairly hard and fast, their vision is likely to change more often. Microsoft’s vision statement is no longer the above (in no small part because they achieved it). So what is mine? The world I want to bring into existence, based on my ambitions and values as they stand right now?</p>\n<p>Here’s my draft attempt: <em>To build and lead a diverse and inclusive generational organization that produces open source software, advice, and advocacy in service of making the world more equal, open, and informed</em>.</p>\n<p>Breaking it down: a <em>generational organization</em> inherently says not a startup that’s designed to exit quickly; I want to build something that will last a long time. It also leaves the form of the organization open: it could be a private company, a non-profit, a co-operative, and so on. <em>Diverse and inclusive</em> specifies that it should be an organization with diverse leadership and inclusive practices. <em>Produces open source software</em>is self-explanatory, but <em>advice and advocacy</em> is an important clause to me: it says I’m not just building software but also helping people think about their own policies, strategies, and use. I don’t just want to be a personal expert in this arena; I want to build an organization that shares that expertise in service of my mission.</p>\n<p>That doesn’t mean I want to do that <em>right this second</em>, or <em>from scratch</em>. I’m very happy at <a href=\"https://19thnews.org/\">The 19th</a> - and in many ways I <em>am</em> building this organization as a member of its Senior Leadership Team. (It’s a startup, so I think it’s also fair to say that <em>everyone</em> on the team is also building it.) But I don’t think I’d be so happy if I wasn’t learning so much about building a diverse organization, and about hitting that mission. The people I get to work with and the journalism and processes we produce are so good that I’m leveling up more and more the longer I stick around. And understanding that this is important to me helps me figure out what my more tactical goals need to be.</p>\n<p>Those tactical goals are where that SMARTIE framework comes into play. Knowing what my underlying mission is, and what I want to have achieved in 5 or 10 years, what are my concrete next steps over the next six to twelve months?</p>\n<p>The answer is a mix of the organization’s goals - I want to support it, remember? - and my own developmental tasks. I need to relearn how to center those values in my work, and communicate those values more clearly; I need to build more focused, structured reporting into my team’s policies and procedures; I need to hold us accountable to values as well as productivity. And I want, ambitiously, to lead the industry in doing all those things. There are more, of course, and there’s a lot of prioritization that needs to happen. But by reconsidering my personal mission and vision, and applying a different framework to the individual tactical goals I set out for myself and will be held accountable to, I’m much closer than I was.</p>\n<p> </p>\n<p><em>Photo by <a href=\"https://unsplash.com/@randytarampi?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">Randy Tarampi</a> on <a href=\"https://unsplash.com/s/photos/inspiration?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">Unsplash</a></em></p>",
            "value": "Graffiti on a wall that reads: Dream big. I’ve been spending some time looking carefully at my professional goals.A few years ago, I open sourced the mission / vision / tactical worksheet I’d been using, which was inspired by high-level organizational strategy. First, it invites you to consider your “mission”:This is your north star. For example, a possible mission statement is to work on technology that makes the world more equal. Another example of a mission statement is to work at startups building world-class products that change the world.Then, your “vision”. For a company, the vision is the world you want to create through your mission and activities. For a person, that’s not far off:This is where you want to see yourself in 5 or 10 years. One long-term goal is to be the founder of a generational tech company. Other long-term goals are to be a senior individual contributor engineer, or an engineering manager, or a product manager at a large tech giant.And then the near-term steps:What measurable, actionable steps bring you closer to your goal?While I’ve found this to be a useful framework, it undeniably suffers from a lack of focus. For example, the definition of a “measurable, actionable step” could vary a great deal from person to person.Recently, through professional development at The 19th, I was introduced to the Management Center’s SMARTIE goals:SMARTIE stands for Strategic, Measurable, Ambitious, Realistic, Time-bound, Inclusive, and Equitable. By incorporating an equity and inclusion component to your SMART goals, you can make sure your organization’s commitment to racial equity and inclusion is anchored by tangible and actionable steps.The traditional definition of SMART goals is Specific, Measurable, Achievable, Relevant, and Time-Bound. It’s a useful framework in itself, in the sense that at least it provides some structure and concreteness, but in its definitions it encourages you to diminish mission and values in your work. A goal that is Specific and Achievable is highly likely to just be iterative on what you’re already doing.In contrast, SMARTIE encourages you to dream. By replacing Specific with Strategic, we’re encouraged to think longer-term. By replacing Achievable with Ambitious, we’re given permission to stretch for what we really want. Swapping Relevant for Realistic reminds us to keep our feet on the ground, but in paired this with Achievable we’re being asked to find a productive middle ground between our dreams and reality. And then reminding us that our goals must be Inclusive and Equitable ensures that we consider our impact on others, and on our communities and ecosystems.I like it a lot.Giving me permission to make my goals values-oriented is, in itself, a big deal. I’ve often had to smuggle my values into goals and trade them off with the goals of the organization. Here, I’m asked to put them front and center.But the detail-oriented approach and demand for accountability has also made me reconsider my personal mission and vision.For years now, my mission has read: To work on projects with the potential to make the world more equal and informed. In itself, it’s been fairly useful: I’ve been able to look at opportunities and ask, “well, does this have the potential to do those things?” And it’s been easy to say “no” to opportunities that don’t.But it’s possible for an opportunity to have the potential to make the world more equal and informed but still not be a fit for what I want to do. It doesn’t communicate what I actually do, to myself or anyone else. For example, The 19th, my current employer, is clearly an organization with the potential to make the world more equal and informed - it’s a newsroom (check!) that particularly serves women, women of color and the LGBTQ+ community (check!) with the information, resources and community they need to be equal participants in our democracy (check!). So as an organization it’s aligned with my mission. But what does my mission say I should do there? Should I be an illustrator? I’d love that, but I don’t think they’d have me. A journalist? Again, I wish. No, based on my experience as an engineer, founder, and investor, I’m probably better off serving them on the technical side - and even then, by building, supporting, and advising on a particular kind of software.So it’s more accurate and useful to say that my mission is to support organizations that have the potential to make the world more equal, open, and informed by building and supporting open web software and strategy.It still needs workshopping. But we’re a lot closer: you still know I want to work to help make the world more equal and informed, but now you can more definitively say where I can be helpful and want to be working. It also emphasizes openness: there are plenty of allegedly equal worlds that are authoritarian or limited, and that’s not what I want to be a part of. And in specifying this greater detail, I can make more detailed choices.So, onto vision. Perhaps the most famous vision statement in computing is Microsoft’s original wish to create a world with “a microcomputer on every desk and in every home running Microsoft software”, which balanced an intent to markedly change the marketplace (and arguably the world) with making it obvious what Microsoft’s role in that transition would be.If a person or organization’s mission is fairly hard and fast, their vision is likely to change more often. Microsoft’s vision statement is no longer the above (in no small part because they achieved it). So what is mine? The world I want to bring into existence, based on my ambitions and values as they stand right now?Here’s my draft attempt: To build and lead a diverse and inclusive generational organization that produces open source software, advice, and advocacy in service of making the world more equal, open, and informed.Breaking it down: a generational organization inherently says not a startup that’s designed to exit quickly; I want to build something that will last a long time. It also leaves the form of the organization open: it could be a private company, a non-profit, a co-operative, and so on. Diverse and inclusive specifies that it should be an organization with diverse leadership and inclusive practices. Produces open source softwareis self-explanatory, but advice and advocacy is an important clause to me: it says I’m not just building software but also helping people think about their own policies, strategies, and use. I don’t just want to be a personal expert in this arena; I want to build an organization that shares that expertise in service of my mission.That doesn’t mean I want to do that right this second, or from scratch. I’m very happy at The 19th - and in many ways I am building this organization as a member of its Senior Leadership Team. (It’s a startup, so I think it’s also fair to say that everyone on the team is also building it.) But I don’t think I’d be so happy if I wasn’t learning so much about building a diverse organization, and about hitting that mission. The people I get to work with and the journalism and processes we produce are so good that I’m leveling up more and more the longer I stick around. And understanding that this is important to me helps me figure out what my more tactical goals need to be.Those tactical goals are where that SMARTIE framework comes into play. Knowing what my underlying mission is, and what I want to have achieved in 5 or 10 years, what are my concrete next steps over the next six to twelve months?The answer is a mix of the organization’s goals - I want to support it, remember? - and my own developmental tasks. I need to relearn how to center those values in my work, and communicate those values more clearly; I need to build more focused, structured reporting into my team’s policies and procedures; I need to hold us accountable to values as well as productivity. And I want, ambitiously, to lead the industry in doing all those things. There are more, of course, and there’s a lot of prioritization that needs to happen. But by reconsidering my personal mission and vision, and applying a different framework to the individual tactical goals I set out for myself and will be held accountable to, I’m much closer than I was. Photo by Randy Tarampi on Unsplash"
          }
        ],
        "url": [
          "https://werd.io/2023/resetting-professional-goals"
        ],
        "published": [
          "2023-02-04T00:16:20+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "Reading, watching, playing, using: January 2023"
        ],
        "content": [
          {
            "html": "<p>This is my monthly roundup of the books, articles, and streaming media I found interesting. Here's my list for January, 2023.</p>\n<h3>Apps + Websites</h3>\n<p><a href=\"https://permissionslipcr.com/\">Permission Slip.</a> “It’s no secret that a huge number of companies are collecting, buying and selling data about us. Find out what information they collect, and take action to help protect yourself.” An app by Consumer Reports that checks to see which businesses hold data about you - and then helps you to remove it. Great stuff.</p>\n<h3>Books</h3>\n<h4>Fiction</h4>\n<p><a href=\"https://bookshop.org/a/7949/9780765389121\">The Kaiju Preservation Society, by John Scalzi.</a> This was written as catharsis after the stress and trauma of 2020-21, and reading it was equally cathartic. The author calls it a pop song of a book, and that’s exactly right. It might not be Bach but it has a good beat and I’ll be humming it for months. If you’re looking for catharsis too, you could do much, much worse.</p>\n<h4>Nonfiction</h4>\n<p><a href=\"https://bookshop.org/a/7949/9780316365215\">Rest Is Resistance: A Manifesto, by Tricia Hersey.</a> In a lot of ways best read as a kind of sermon on self-sovereignty, Rest is Resistance is a treatise on fighting back against grind culture and prioritizing your needs over the needs of the exploitative economic system you happen to live in. So many of these harmful ideas are baked into American culture; so much so that some of the pleas here might seem obvious to foreign ears. Nonetheless, we need more of this work, and I found this book to be both affirming and necessary.</p>\n<h3>Notable Articles</h3>\n<h4>AI</h4>\n<p><a href=\"https://arstechnica.com/gadgets/2023/01/the-generative-ai-revolution-has-begun-how-did-we-get-here\">The generative AI revolution has begun—how did we get here?</a> “But there was also a surprise. The OpenAI researchers discovered that in making the models bigger, they didn’t just get better at producing text. The models could learn entirely new behaviors simply by being shown new training data. In particular, the researchers discovered that GPT3 could be trained to follow instructions in plain English without having to explicitly design the model that way.” A superb introduction.</p>\n<p><a href=\"https://futurism.com/seo-spammers-google-cnet-ai-generated-articles\">SEO Spammers Are Absolutely Thrilled Google Isn't Cracking Down on CNET's AI-Generated Articles.</a>“The implication was clear: that tools like ChatGPT will now allow scofflaws to pollute the internet with near-infinite quantities of bot-generated garbage, and that CNET have now paved the way. In a way, it served as a perfect illustration of a recent warning by Stanford and Georgetown academics that AI tech could rapidly start to fill the internet with endless quantities of misinformation and profiteering.”</p>\n<p><a href=\"https://time.com/6247678/openai-chatgpt-kenya-workers\">OpenAI Used Kenyan Workers on Less Than $2 Per Hour.</a> “One Sama worker tasked with reading and labeling text for OpenAI told TIME he suffered from recurring visions after reading a graphic description of a man having sex with a dog in the presence of a young child. “That was torture,” he said. “You will read a number of statements like that all through the week. By the time it gets to Friday, you are disturbed from thinking through that picture.””</p>\n<p><a href=\"https://theredhandfiles.com/chat-gpt-what-do-you-think\">I asked Chat GPT to write a song in the style of Nick Cave.</a> “ChatGPT has no inner being, it has been nowhere, it has endured nothing, it has not had the audacity to reach beyond its limitations, and hence it doesn’t have the capacity for a shared transcendent experience, as it has no limitations from which to transcend. ChatGPT’s melancholy role is that it is destined to imitate and can never have an authentic human experience, no matter how devalued and inconsequential the human experience may in time become.”</p>\n<p><a href=\"https://bert.org/2023/01/06/chatgpt-in-dr-sbaitso\">ChatGPT in DR SBAITSO.</a> “But it got me wondering, what if we replaced the internals of DR SBAITSO with ChatGPT but kept the weird synthesized voice?”</p>\n<p><a href=\"https://theverge.com/2023/1/5/23540261/apple-text-to-speech-audiobooks-ebooks-artificial-intelligence-narrator-madison-jackson\">Apple Books quietly launches AI-narrated audiobooks.</a> “Audiobooks narrated by a text-to-speech AI are now available via Apple’s Books service, in a move with potentially huge implications for the multi-billion dollar audiobook industry. Apple describes the new “digital narration” feature on its website as making “the creation of audiobooks more accessible to all,” by reducing “the cost and complexity” of producing them for authors and publishers.” Speaking as a frequent audiobook listener: do not want.</p>\n<p><a href=\"https://peopleofcolorintech.com/articles/facial-recognition-tech-used-to-jail-black-man-for-louisiana-theft-hes-never-been-to-louisiana\">Facial Recognition Tech Used To Jail Black Man For Louisiana Theft - He's Never Been To Louisiana.</a>“There were clear physical differences between Reid and the perpetrator in the surveillance footage, said Reid’s attorney. For example, there was a 40-pound difference in body weight and Reid had a mole on his face. […] Researchers have long noted racial biases in specific facial recognition software, and we’ve seen this play out in wrongful arrests, like those of Nijeer Parks, Robert Williams, and Michael Oliver—all Black men.“</p>\n<p><a href=\"https://maggieappleton.com/ai-dark-forest\">The Expanding Dark Forest and Generative AI.</a> “Hard exiting out of this cycle requires coming up with unquestionably original thoughts and theories. It means seeing and synthesising patterns across a broad range of sources: books, blogs, cultural narratives served up by media outlets, conversations, podcasts, lived experiences, and market trends. We can observe and analyse a much fuller range of inputs than bots and generative models can.”</p>\n<h4>Business</h4>\n<p><a href=\"https://axios.com/2023/01/25/americans-increasingly-disgruntled-at-work\">Americans are increasingly disgruntled at work.</a> “Of note: Workers who were in jobs that could be done remotely, but were forced to work on-site saw an increase of 7 points in active disengagement.”</p>\n<p><a href=\"https://mcsweeneys.net/articles/macroeconomic-changes-have-made-it-impossible-for-me-to-want-to-pay-you\">Macroeconomic Changes Have Made It Impossible for Me to Want to Pay You.</a> “There’s no easy way to say this: I have made the difficult decision to lay off over six thousand of you. In the past two years, we have achieved huge wins together. But unfortunately, the macroeconomic environment has shifted in ways none of us could have foreseen, from an economy in which I did feel like paying you, to one in which I’d rather not.”</p>\n<p><a href=\"https://longform.asmartbear.com/posts/extreme-questions\">Extreme questions to trigger new, better ideas.</a> “The following prompts jostle you out of tiny thinking. Each stretches some dimension of reality to an extreme. So extreme that it is nearly nonsense. But dramatically different perspectives can reveal distinctly new ideas. An idea that would be a 60% solution in an extreme hypothetical case, could be a 2x or even a 10x idea in reality.”</p>\n<p><a href=\"https://news.stanford.edu/2022/12/05/explains-recent-tech-layoffs-worried\">What explains recent tech layoffs, and why should we be worried?</a> “Layoffs often do not cut costs, as there are many instances of laid-off employees being hired back as contractors, with companies paying the contracting firm. Layoffs often do not increase stock prices, in part because layoffs can signal that a company is having difficulty. Layoffs do not increase productivity. Layoffs do not solve what is often the underlying problem, which is often an ineffective strategy, a loss of market share, or too little revenue. Layoffs are basically a bad decision.”</p>\n<p><a href=\"https://wsj.com/articles/your-coworkers-are-less-ambitious-bosses-adjust-to-the-new-order-11672441067\">Your Coworkers Are Less Ambitious; Bosses Adjust to the New Order.</a> “Many white-collar workers say the events of the past three years have reordered their priorities and showed them what they were missing when they were spending so much time at the office. Now that normalcy is returning, even some of the workers who used to be always on and always striving say they find themselves eyeing the clock as the day winds down, saying no to overtime work or even taking pay cuts for better work-life balance.” Good!</p>\n<h4>Climate</h4>\n<p><a href=\"https://theguardian.com/environment/2023/jan/18/revealed-forest-carbon-offsets-biggest-provider-worthless-verra-aoe\">Revealed: more than 90% of rainforest carbon offsets by biggest provider are worthless, analysis shows.</a>“The research into Verra, the world’s leading carbon standard for the rapidly growing $2bn (£1.6bn) voluntary offsets market, has found that, based on analysis of a significant percentage of the projects, more than 90% of their rainforest offset credits – among the most commonly used by companies – are likely to be “phantom credits” and do not represent genuine carbon reductions.”</p>\n<p><a href=\"https://ox.ac.uk/news/2023-01-06-compound-extreme-heat-and-drought-will-hit-90-world-population-oxford-study\">Compound extreme heat and drought will hit 90% of world population.</a> “The frequency of extreme compounding hazards is projected to intensify tenfold globally due to the combined effects of warming and decreases in terrestrial water storage, under the highest emission scenario. Over 90% of the world population and GDP is projected to be exposed to increasing compounding risks in the future climate, even under the lowest emission scenario.”</p>\n<h4>Culture</h4>\n<p><a href=\"https://haleynahman.substack.com/p/132-the-contagious-visual-blandness\">The contagious visual blandness of Netflix.</a> “There are more green screens and sound stages, more CGI, more fixing-it-in-post. As these production tools have gotten slicker and cheaper and thus more widely abused, it’s not that everything looks obviously shitty or too good to feel true, it’s actually that most things look mid in the exact same way. The ubiquity of the look is making it harder to spot, and the overall result is weightless and uncanny. An endless stream of glossy vehicles that are easy to watch and easier to forget.”</p>\n<p><a href=\"https://nytimes.com/2023/01/09/dining/noma-closing-rene-redzepi.html\">Noma, Rated the World’s Best Restaurant, Is Closing Its Doors.</a> “The Copenhagen chef René Redzepi says fine dining at the highest level, with its grueling hours and intense workplace culture, has hit a breaking point: “It’s unsustainable.”” Time to close with one last audacious s’mores dish?</p>\n<h4>Democracy</h4>\n<p><a href=\"https://dailytarheel.com/article/2023/01/university-unc-leaders-blindsided-trustees-decision-professional-school\">‘I’m flabbergasted’: UNC leaders blindsided by trustees' decision on School of Civic Life and Leadership.</a>“Mimi Chapman, chairperson of faculty, said she was “flabbergasted” in response to the exclusion of faculty input in the decision, which she said she considers to be an attack on shared University governance.” From the same university that denied tenure to Nikole Hannah-Jones.</p>\n<p><a href=\"https://vox.com/policy-and-politics/23573220/adam-schiff-california-senate-race-katie-porter-dianne-feinstein\">Adam Schiff to run against Porter for Feinstein’s California Senate seat.</a> “Lee is an old-school, anti-establishment liberal with widespread name recognition in the Bay Area. Khanna has built more of a name for himself as a technocrat and wonk in the tech, antitrust, and economic realm, and co-chaired Bernie Sanders’s 2020 presidential campaign. Porter comes from the Elizabeth Warren lane of the party. But Schiff’s congressional identity has been shaped by his establishment ties.”</p>\n<p><a href=\"https://19thnews.org/2023/01/states-consider-election-worker-protections-threats-voting\">Election workers could see expanded protections as threats continue.</a> “While election workers mostly powered through a smooth process in November, the threat of political violence continues, according to election officials and voting rights advocates. Ramping up protections for election workers will be critical this year for legislatures.”</p>\n<p><a href=\"https://npr.org/2023/01/19/1149547193/secret-execution-tapes-virginia\">NPR obtained secret tapes recorded by prison staff during Virginia executions.</a> “An NPR investigation can now reveal the tapes show the prison neglected to record key evidence during what was considered one of Virginia’s worst executions, and staff appeared unprepared for some of the jobs they were tasked to do in the death chamber.”</p>\n<p><a href=\"https://theguardian.com/technology/2023/jan/17/donelan-confirms-stiffer-online-safety-measures-after-backbench-pressure\">Donelan confirms stiffer online safety measures after backbench pressure.</a> “Under a further change to the bill, video footage that shows people crossing the Channel in small boats in a “positive light” will be added to a list of illegal content that all tech platforms must proactively prevent from reaching users.” How is this internet safety?!</p>\n<p><a href=\"https://kansascity.com/news/politics-government/article271158062.html\">Missouri House faces backlash for women’s dress code rule.</a> “Democrats have excoriated Republicans on social media for legislating over what women should be required to wear. Criticism of the rule change comes at a time when the treatment of women in Missouri has received national attention.”</p>\n<p><a href=\"https://theguardian.com/politics/2023/jan/10/spot-the-difference-boris-johnson-appears-scrubbed-from-photo-posted-by-grant-shapps\">Spot the difference: Boris Johnson appears scrubbed from photo posted by Shapps.</a> “Social media users were quick to point out that Johnson appeared to have been erased from the image – an identical picture is still on the No 10 Flickr account, dated 9 June 2021, with the former PM standing between Shapps and Hart.” How very Stalin of him.</p>\n<p><a href=\"https://theguardian.com/us-news/2023/jan/06/us-police-killings-record-number-2022\">‘It never stops’: killings by US police reach record high in 2022.</a> “US law enforcement killed at least 1,176 people in 2022, making it the deadliest year on record for police violence since experts first started tracking the killings, a new data analysis reveals.”</p>\n<p><a href=\"https://19thnews.org/2023/01/trans-health-care-bills-2023-legislative-session-lgbtq\">These anti-trans bills are being prepped for 2023 state legislative sessions.</a> “Lawmakers in at least eight states used the last two months of 2022 to prefile anti-transgender bills ahead of state legislative sessions convening this month — setting up another year of statehouse battles over trans rights, while targeting health care for trans adults in new ways.”</p>\n<p><a href=\"https://fastcompany.com/90824901/secret-money-fueling-conservative-anti-esg-push\">The secret money fueling the conservative anti-ESG push.</a> “This isn’t a grassroots movement, and it isn’t coming from the financial industry, where most experts argue that considering issues like climate is prudent for investors. “I think it’s motivated by politics,” says Witold Henisz, a professor at the University of Pennsylvania’s Wharton School. “They think it’s a political wedge issue. You can see some of the same patterns of money moving into the anti-ESG movement that pushed back against climate science in the aughts.””</p>\n<p><a href=\"https://nytimes.com/2023/01/03/opinion/george-santos-congress.html\">A Con Man Is Succeeding Me in Congress Today.</a> “But for now, there is no getting around the fact that Mr. Santos’s con game is a manifestation of a growing political phenomenon of saying or doing anything, with no automatic consequences. Whether it be far-right election deniers, personal attacks that call for violence against opponents, claims of false-flag mass shootings, extremists spouting the first thing that comes to mind and even one politician saying he could “shoot somebody” on Fifth Avenue and still not lose supporters.”</p>\n<h4>Health</h4>\n<p><a href=\"https://nature.com/articles/d41586-023-00118-w\">How our microbiome is shaped by family, friends and even neighbours.</a> “People living in the same household share more than just a roof. Be they family or flatmate, housemates tend to have the same microbes colonizing their bodies, and the longer the cohabitation, the more similar these microbiomes become. The conclusion raises the possibility that diseases linked to microbiome dysfunction, including cancer, diabetes and obesity, could be partly transmissible.”</p>\n<p><a href=\"https://19thnews.org/2023/01/gas-stove-asthma-health-concerns-public-housing\">Gas stove health concerns add urgency to calls for changes in public housing.</a> “Alarmingly, in a focus group conducted by the Public Health Law Center in Chicago, nearly 100 percent of public housing participants said they have also turned on their gas stoves to stay warm on cold days, which is an added danger for residents.”</p>\n<p><a href=\"https://mdpi.com/1660-4601/20/1/75\">Population Attributable Fraction of Gas Stoves and Childhood Asthma in the United States.</a> “The proportion of childhood asthma that could be theoretically prevented if gas stove use was not present (e.g., state-specific PAFs) varied by state (Illinois = 21.1%; California = 20.1%; New York = 18.8%; Massachusetts = 15.4%; Pennsylvania = 13.5%). Our results quantify the US public health burden attributed to gas stove use and childhood asthma.”</p>\n<p><a href=\"https://consumerreports.org/health/food-safety/lead-and-cadmium-in-dark-chocolate-a8480295550\">Lead and Cadmium Could Be in Your Dark Chocolate.</a> “The chocolate industry has been grappling with ways to lower those levels. To see how much of a risk these favorite treats pose, Consumer Reports scientists recently measured the amount of heavy metals in 28 dark chocolate bars. They detected cadmium and lead in all of them.”</p>\n<h4>Media</h4>\n<p><a href=\"https://washingtonpost.com/opinions/2023/01/30/newsrooms-news-reporting-objectivity-diversity\">Newsrooms that move beyond ‘objectivity’ can build trust.</a> “Newer, nonprofit news organizations often have launched with stated missions. The national digital news site the 19th, for example, aims to “elevate voices of women, people of color, and the LGBTQ+ community.””</p>\n<p><a href=\"https://19thnews.org/2023/01/three-years-of-the-19th-30-cities-54-employees-and-news-that-represents\">Three years of The 19th: 30 cities, 54 employees and news that represents.</a> “In the last year alone, we’ve grown at an astronomical pace: from 32 employees to 54, from a news organization that pledged to be the most representative in the nation to one where 65 percent of our staff is non-White, 30 percent are LGBTQ+ and 19 percent are living with disabilities. We’re now on the ground in more than 30 U.S. cities.” I’m so proud to be a part of this team.</p>\n<p><a href=\"https://annehelen.substack.com/p/layoff-brain\">Layoff Brain.</a> “Layoffs are the worst for the people who lose their job, but there’s a ripple effect on those who keep them — particularly if they keep them over the course of multiple layoffs. It’s a curious mix of guilt, relief, trepidation, and anger. Are you supposed to be grateful to the company whose primary leadership strategy seems to be keeping its workers trapped in fear? How do you trust your manager’s assurances of security further than the end of the next pay period?”</p>\n<p><a href=\"https://rollingstone.com/politics/politics-features/donald-trump-ditch-truth-social-for-twitter-facebook-1234665307\">Trump Looks to Abandon Truth Social, His Own Social Media Platform.</a> “Since late last year, former President Trump has informed several people close to him that he doesn’t want to re-up the exclusivity agreement with his social media company, Truth Social, two sources familiar with the matter tell Rolling Stone. “There’s not going to be a need for that,” is how one of the sources recalls Trump describing his soon-to-expire contractual obligation. […] Trump and some of his close allies have already brainstormed about him tweeting that, even though Big Tech tried to “silence” him over his lies about a “rigged election,” he was now back to make “the Left” miserable.”</p>\n<p><a href=\"https://techdirt.com/2023/01/04/journalists-and-others-should-leave-twitter-heres-how-they-can-get-started\">Journalists (And Others) Should Leave Twitter. Here’s How They Can Get Started.</a> “Many journalism organizations and public entities, such as local governments, believe Twitter is essential because it’s a place people know they can turn to when there’s big news — and find information from “verified accounts” that (barring a hack) ensure the source is who it’s claiming to be. So, they tell themselves, they have to stick around. This isn’t just short-sighted. It’s foolish.”</p>\n<p><a href=\"https://whatsnewinpublishing.com/publishers-you-should-start-using-mastodon-10-reasons-why\">Publishers, you should start using Mastodon: 10 reasons why.</a> “There are plenty of articles about why you should leave Twitter (or at least, cross-post to Mastodon) for ethical, safety, political, social, and security/privacy reasons. This post won’t do any of those things. Instead, all my arguments are about why it’s smart from a pure business, marketing, and influence perspective to use Mastodon as soon as possible.”</p>\n<h4>Science</h4>\n<p><a href=\"https://nytimes.com/2023/01/07/science/honeybee-vaccine.html\">U.S.D.A. Approves First Vaccine for Honeybees.</a> ““There are millions of beehives all over the world, and they don’t have a good health care system compared to other animals,” she said. “Now we have the tools to improve their resistance against diseases.”” Vaccines for bees!</p>\n<h4>Society</h4>\n<p><a href=\"https://19thnews.org/2023/01/a-vast-majority-of-americans-are-concerned-people-could-face-criminal-penalties-for-abortion\">A vast majority of Americans are concerned people could face criminal penalties for abortion.</a> “The data found that 80 percent of Americans are concerned that domestic abuse survivors could be reported by their abuser for getting an abortion. Eighty percent of people are also concerned that law enforcement could investigate people who have miscarriages or stillbirths if they are suspected of getting an abortion. The poll also found that 75 percent of people are concerned that people who get an abortion could be charged with a felony or go to jail.”</p>\n<p><a href=\"https://vice.com/en/article/z34ane/neo-nazi-homeschool-ohio\">Inside a US Neo-Nazi Homeschool Network With Thousands of Members.</a> “Since the group began in October 2021 it has openly embraced Nazi ideology and promoted white supremacy, while proudly discouraging parents from letting their white children play with or have any contact with people of any other race. Admins and members use racist, homophobic, and antisemitic slurs without shame, and quote Hitler and other Nazi leaders daily in a channel open to the public.”</p>\n<p><a href=\"https://aeon.co/essays/the-tragedy-of-the-commons-is-a-false-and-dangerous-myth\">The tragedy of the commons is a false and dangerous myth.</a> “Even before Hardin’s ‘The Tragedy of the Commons’ was published, however, the young political scientist Elinor Ostrom had proven him wrong. While Hardin speculated that the tragedy of the commons could be avoided only through total privatisation or total government control, Ostrom had witnessed groundwater users near her native Los Angeles hammer out a system for sharing their coveted resource.”</p>\n<p><a href=\"https://theconversation.com/pain-of-police-killings-ripples-outward-to-traumatize-black-people-and-communities-across-us-159624\">Pain of police killings ripples outward to traumatize Black people and communities across US.</a> “Evidence shows that many Black Americans across the U.S. experience police killings of other Black people as traumatic events, and that this trauma diminishes the ability of Black communities to thrive.” Sobering statistics.</p>\n<p><a href=\"https://theonion.com/u-s-officials-announce-plans-to-continue-pretending-br-1850036671\">U.S. Officials Announce Plans To Continue Pretending Brutal State-Sponsored Violence Not Supposed To Happen.</a> ““Today, as we deal with the fallout from the death of Tyre Nichols, myself and the highest officials in the American government pledge to keep acting like we don’t want our highly militarized police force to kill innocent civilians every day,” said President Joe Biden at a White House press conference, adding that he and his fellow elected officials would pretend to gasp, pray, and put on a big emotional show every time law enforcement carried out the exact murders against its own citizens they had both tacitly and publicly approved.”</p>\n<p><a href=\"https://epi.org/publication/unionization-2022\">Unionization increased by 200,000 in 2022: Tens of millions more wanted to join a union, but couldn’t .</a>“One crucial way we can promote a more prosperous, equitable economy is to dismantle existing barriers to union organizing and collective bargaining. It is urgent that policymakers enact reforms at the federal and state levels to protect and support workers’ right to unionize.”</p>\n<p><a href=\"https://againstmars.substack.com/p/why-elon-musk-and-the-billionaire\">Why Elon Musk and the billionaire space bros want to put people in space cages forever.</a> “That said, I disagree with Mr. Wanjek: it requires much more than libertarian naiveté to colonize space. Parking humans in containment shelters, on Mars or elsewhere, so as to breed them and select them like cattle — that requires malice.”</p>\n<p><a href=\"https://abcnews.go.com/US/2023-doomsday-clock-announcement-expect/story?id=96495463\">2023 'Doomsday Clock' moved 10 seconds closer to catastrophe.</a> “Scientists revealed on Tuesday that the “Doomsday Clock” has been moved up to 90 seconds before midnight -- the closest humanity has ever been to armageddon.” But everything else is going so well.</p>\n<p><a href=\"https://19thnews.org/2023/01/march-for-life-post-roe-anniversary-50-abortion-federal\">Post-Roe March for Life showed anti-abortion activists are far from done.</a> “The next steps for the movement were illustrated by the march’s new route this year: Instead of ending at the steps of the Supreme Court as they have for nearly five decades, activists ended their march at the U.S. Capitol — underscoring their continued push for Congress to enact a federal abortion ban.”</p>\n<p><a href=\"https://19thnews.org/2023/01/lgbtq-mental-health-youth-laws\">Anti-LGBTQ+ rhetoric and state laws are hurting youth mental health, poll shows.</a> “Seventy-one percent of the 716 surveyed LGBTQ+ youth, ranging from teenagers to young adults who took the online poll last fall, said that debates around state laws restricting the rights of LGBTQ+ young people had negatively impacted their mental health. Twenty-seven percent characterized the negative effect as severe.”</p>\n<p><a href=\"https://jessicawildfire.substack.com/p/we-convinced-our-school-to-bring\">We Convinced Our School to Bring Back Masks.</a> “As parents, it’s worth remembering that the persistent ones usually get what they want. Look at the anti-maskers. They didn’t give up. They kept pushing until they got their way. We don’t need to be that aggressive, but I think a lot of us get discouraged and give up. The anti-masker types never give up. They never seem to get tired. So if we want to beat them and win over middle earth, we have to match their energy.”</p>\n<p><a href=\"https://expo.se/2023/01/elon-musk-funded-nonprofit-run-mit-professor-offered-finance-swedish-pro-nazi-group\">Elon Musk-funded nonprofit run by MIT professor offered to finance Swedish pro-nazi group.</a> “The US-based and Elon Musk-funded Future of Life Institute, run by MIT professor and Swedish citizen Max Tegmark, offered a grant of $100,000 to right-wing extremists in Sweden, an Expo investigation reveals.”</p>\n<p><a href=\"https://wsj.com/articles/subway-mta-bart-public-transit-new-york-boston-san-francisco-11673198418\">Public Transit Goes Off the Rails With Fewer Riders, Dwindling Cash, Rising Crime.</a> “Several of the nation’s largest urban mass-transit systems are at a crossroads, with ridership still depressed three years into the pandemic and federal aid running out.”</p>\n<h4>Technology</h4>\n<p><a href=\"https://platformer.news/p/instagrams-co-founders-are-mounting\">Instagram's co-founders are mounting a comeback.</a> “TikTok’s innovation was to show you stuff using only algorithmic predictions, regardless of who your friends are or who you followed. It soon became the most downloaded app in the world. Artifact represents an effort to do the same thing, but for text.” Potentially an interesting app, based on an interesting insight.</p>\n<p><a href=\"https://washingtonpost.com/technology/2023/01/27/diversity-layoffs-meta-facebook\">Women, minorities lose ground in tech layoffs.</a> “The technology industry has long struggled to recruit a diverse workforce, but the recent spate of cuts by Silicon Valley companies has hit women particularly hard, according to recently published analyses of demographic data from the layoffs. Women and some minorities were particularly vulnerable to layoffs because they were newer to their jobs and occupied roles that companies were less interested in retaining, experts said.”</p>\n<p><a href=\"https://npr.org/2023/01/24/1151055903/doj-files-second-antitrust-suit-against-google-seeks-to-break-up-its-ad-business\">U.S. sues Google for allegedly breaking antitrust laws with its ad business.</a> ““For 15 years, Google has pursued a course of anticompetitive conduct that has allowed it to halt the rise of rival technologies, manipulate auction mechanics, to insulate itself from competition, and force advertisers and publishers to use its tools,” said Attorney General Merrick Garland at a press conference announcing the lawsuit.”</p>\n<p><a href=\"https://francine.substack.com/p/warning-do-not-other-me-because-of\">Warning: Do not “other” me because of my age.</a> “But I hate this new attention lavished on aging. Why? Because it “others” me. It puts me in a separate category from the rest of the world, and that is not how I think, feel, act, or want to be seen. All of a sudden I am not smart, pretty, successful, talented, or part of the family. I am “old.” I am somebody’s responsibility. I have to be told when to stop driving, and my checkbook can be taken away. I am a candidate for Senior Living (banishment to a place full of other old people).”</p>\n<p><a href=\"https://engadget.com/tweetbots-twitter-client-shutdown-195533095.html\">Tapbot shuts down Tweetbot as it pivots to Mastodon.</a> “Now that Twitter has confirmed it’s banning third-party clients, some of the most prominent alternatives are going away. Tapbots has shut down work on Tweetbot, one of the more popular iOS apps, as Twitter rendered it non-functional “in a blink of an eye.” The developer is instead pivoting to Ivory, an app for the open social platform Mastodon. While it’s limited to an invitation-only test for now, Tapbots hopes to make the software “better than Tweetbot ever could be.”” Likewise, Mastodon will be better than Twitter ever could be.</p>\n<p><a href=\"https://dailydot.com/debug/no-fly-list-us-tsa-unprotected-server-commuteair\">U.S. No Fly List Left on Unprotected Airline Server.</a> “Analysis of the server resulted in the discovery of a text file named “NoFly.csv,” a reference to the subset of individuals in the Terrorist Screening Database who have been barred from air travel due to having suspected or known ties to terrorist organizations.”</p>\n<p><a href=\"https://ft.com/content/99452cdd-5532-4c6a-85e6-733c2fde3e9c\">‘Passion economy’ platforms cut costs in tech downturn.</a> ““People are making choices,” said Rebecca McGrath, an internet analyst at Mintel. “Unless you’re very loyal to a creator, that’ll be one of the obvious things to drop.””</p>\n<p><a href=\"https://reuters.com/technology/tesla-video-promoting-self-driving-was-staged-engineer-testifies-2023-01-17\">Tesla video promoting self-driving was staged, engineer testifies.</a> “A 2016 video that Tesla used to promote its self-driving technology was staged to show capabilities like stopping at a red light and accelerating at a green light that the system did not have, according to testimony by a senior engineer.” They’re fun cars to drive, but don’t let them drive themselves.</p>\n<p><a href=\"https://blog.medium.com/medium-embraces-mastodon-19dcb873eb11\">Medium embraces Mastodon.</a> “Today, Medium is launching a Mastodon instance at <a class=\"autolink\" href=\"http://me.dm/\"></a><a href=\"http://me.dm/\" target=\"_blank\" rel=\"in-reply-to\" class=\"u-in-reply-to\">http://<wbr></wbr>me.dm/<wbr></wbr></a> to help our authors, publications and readers find a home in the fediverse. Mastodon is an emerging force for good in social media and we are excited to join this community.” Hell yeah.</p>\n<p><a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4296306\">The Effects of Online Content Moderation: Evidence from President Trump's Account Deletion.</a> “The toxicity of tweets sent by Trump followers relative to a representative sample of US Twitter users dropped by around 25% after the account deletion. Second, this effect is larger for pro-Trump tweets and Republican users. Third, Trump’s suspension reduced the total number of tweets, suggesting a drop in engagement. Fourth, we find effects on individuals who did not follow Trump directly but followed somebody that did, suggesting network spillovers.”</p>\n<p><a href=\"https://pxlnv.com/linklog/intercept-tesla-crash\">The Intercept Obtains Surveillance Footage of Tesla Crash on Bay Bridge.</a> “These semi-autonomous systems are playing the same sort of trick as ChatGPT: they offer a convincing but shallow impression of a competent driverless car without any broader context to fall back on.”</p>\n<p><a href=\"https://blog.nativesintech.org/apache-appropriation\">Apache® Appropriation.</a> “We urge The Apache® Software Foundation to take the necessary steps needed to express the ally-ship they promote so deeply on their website, to act in accordance with their own code of conduct, to “be careful in the words that [they] choose”, and change their name.” +1.</p>\n<p><a href=\"https://vice.com/en/article/v7dw8x/san-francisco-police-are-using-driverless-cars-as-mobile-surveillance-cameras\">San Francisco Police Are Using Driverless Cars as Mobile Surveillance Cameras.</a> “Law enforcement agencies already have access to automated license plate readers, geofence warrants, Ring Doorbell footage, as well as the ability to purchase location data. This practice will extend the reach of an already pervasive web of surveillance.”</p>\n<p><a href=\"https://apnews.com/article/social-media-seattle-lawsuits-mental-health-965a8f373e3bfed8157571912cc3b542\">Seattle schools sue tech giants over social media harm.</a> “[The lawsuit] blames [social media giants] for worsening mental health and behavioral disorders including anxiety, depression, disordered eating and cyberbullying; making it more difficult to educate students; and forcing schools to take steps such as hiring additional mental health professionals, developing lesson plans about the effects of social media, and providing additional training to teachers.”</p>\n<p><a href=\"https://nytimes.com/2023/01/04/us/seattle-fraud-office-space.html\">‘Office Space’ Inspired Engineer’s Theft Scheme, Police Say.</a> “A software engineer siphoned more than $300,000 from his employer by introducing what prosecutors called a “series of malicious software edits” that wired money into his personal account. If the scheme sounds like the plot of “Office Space,” that’s because the authorities said it was partly inspired by the movie.”</p>\n<p><a href=\"https://reb00ted.org/tech/20230124-activitystreams-model\">Activity Streams graphical model.</a> “So I did a bit of drawing just to make it clearer (for myself) what kind of data can be shipped around in the Fediverse. To be clear, this is only a small part of the overall stack, but an important one.” Useful work!</p>\n<h4>Twitter</h4>\n<p><a href=\"https://techcrunch.com/2023/01/25/elon-musk-twitter-antisemitic-hate-speech-lawsuit-germany\">Elon Musk’s Twitter hit with holocaust denial hate speech lawsuit in Germany.</a> “Current studies prove that 84% of posts containing antisemitic hate speech were not reviewed by social media platforms, as shown in a study by the Center for Countering Digital Hate. Which means that Twitter knows Jews are being publicly attacked on the platform every day and that antisemitism is becoming a normality in our society. And that the platform’s response is by no means adequate.”</p>\n<p><a href=\"https://daringfireball.net/linked/2023/01/14/information-twitter-slack-confirmation\">Daring Fireball: If You Needed Any More Confirmation, Internal Slack Messages at Twitter Show That Cutting Off Third-Party Clients Was 'Intentional'.</a> “Twitter can of course do what it wants, and Musk owns Twitter so he can do what he wants. But pulling the plug on these clients and ghosting everyone on communications about it is so absurdly disrespectful. Zero respect for the users for those apps, zero respect for the developers behind them — many of whom had been building on the Twitter platform for 10-15 years. Just a clown show.”</p>\n<p><a href=\"https://natematias.medium.com/how-twitter-misleads-us-about-how-many-people-have-left-and-what-to-do-about-it-bba484b6fed6\">How Twitter misleads us about how many people have left — and what to do about it.</a> “To outside observers, it can seem like Twitter users are continuing as before, seemingly unaware of the millions of people who have left. “You left Twitter?” a friend recently remarked, “I hadn’t noticed.” Yet many of the accounts I follow haven’t tweeted in ages, and roughly 15% of them have already set up accounts on Mastodon.” Some great tips in this piece.</p>",
            "value": "This is my monthly roundup of the books, articles, and streaming media I found interesting. Here's my list for January, 2023.Apps + WebsitesPermission Slip. “It’s no secret that a huge number of companies are collecting, buying and selling data about us. Find out what information they collect, and take action to help protect yourself.” An app by Consumer Reports that checks to see which businesses hold data about you - and then helps you to remove it. Great stuff.BooksFictionThe Kaiju Preservation Society, by John Scalzi. This was written as catharsis after the stress and trauma of 2020-21, and reading it was equally cathartic. The author calls it a pop song of a book, and that’s exactly right. It might not be Bach but it has a good beat and I’ll be humming it for months. If you’re looking for catharsis too, you could do much, much worse.NonfictionRest Is Resistance: A Manifesto, by Tricia Hersey. In a lot of ways best read as a kind of sermon on self-sovereignty, Rest is Resistance is a treatise on fighting back against grind culture and prioritizing your needs over the needs of the exploitative economic system you happen to live in. So many of these harmful ideas are baked into American culture; so much so that some of the pleas here might seem obvious to foreign ears. Nonetheless, we need more of this work, and I found this book to be both affirming and necessary.Notable ArticlesAIThe generative AI revolution has begun—how did we get here? “But there was also a surprise. The OpenAI researchers discovered that in making the models bigger, they didn’t just get better at producing text. The models could learn entirely new behaviors simply by being shown new training data. In particular, the researchers discovered that GPT3 could be trained to follow instructions in plain English without having to explicitly design the model that way.” A superb introduction.SEO Spammers Are Absolutely Thrilled Google Isn't Cracking Down on CNET's AI-Generated Articles.“The implication was clear: that tools like ChatGPT will now allow scofflaws to pollute the internet with near-infinite quantities of bot-generated garbage, and that CNET have now paved the way. In a way, it served as a perfect illustration of a recent warning by Stanford and Georgetown academics that AI tech could rapidly start to fill the internet with endless quantities of misinformation and profiteering.”OpenAI Used Kenyan Workers on Less Than $2 Per Hour. “One Sama worker tasked with reading and labeling text for OpenAI told TIME he suffered from recurring visions after reading a graphic description of a man having sex with a dog in the presence of a young child. “That was torture,” he said. “You will read a number of statements like that all through the week. By the time it gets to Friday, you are disturbed from thinking through that picture.””I asked Chat GPT to write a song in the style of Nick Cave. “ChatGPT has no inner being, it has been nowhere, it has endured nothing, it has not had the audacity to reach beyond its limitations, and hence it doesn’t have the capacity for a shared transcendent experience, as it has no limitations from which to transcend. ChatGPT’s melancholy role is that it is destined to imitate and can never have an authentic human experience, no matter how devalued and inconsequential the human experience may in time become.”ChatGPT in DR SBAITSO. “But it got me wondering, what if we replaced the internals of DR SBAITSO with ChatGPT but kept the weird synthesized voice?”Apple Books quietly launches AI-narrated audiobooks. “Audiobooks narrated by a text-to-speech AI are now available via Apple’s Books service, in a move with potentially huge implications for the multi-billion dollar audiobook industry. Apple describes the new “digital narration” feature on its website as making “the creation of audiobooks more accessible to all,” by reducing “the cost and complexity” of producing them for authors and publishers.” Speaking as a frequent audiobook listener: do not want.Facial Recognition Tech Used To Jail Black Man For Louisiana Theft - He's Never Been To Louisiana.“There were clear physical differences between Reid and the perpetrator in the surveillance footage, said Reid’s attorney. For example, there was a 40-pound difference in body weight and Reid had a mole on his face. […] Researchers have long noted racial biases in specific facial recognition software, and we’ve seen this play out in wrongful arrests, like those of Nijeer Parks, Robert Williams, and Michael Oliver—all Black men.“The Expanding Dark Forest and Generative AI. “Hard exiting out of this cycle requires coming up with unquestionably original thoughts and theories. It means seeing and synthesising patterns across a broad range of sources: books, blogs, cultural narratives served up by media outlets, conversations, podcasts, lived experiences, and market trends. We can observe and analyse a much fuller range of inputs than bots and generative models can.”BusinessAmericans are increasingly disgruntled at work. “Of note: Workers who were in jobs that could be done remotely, but were forced to work on-site saw an increase of 7 points in active disengagement.”Macroeconomic Changes Have Made It Impossible for Me to Want to Pay You. “There’s no easy way to say this: I have made the difficult decision to lay off over six thousand of you. In the past two years, we have achieved huge wins together. But unfortunately, the macroeconomic environment has shifted in ways none of us could have foreseen, from an economy in which I did feel like paying you, to one in which I’d rather not.”Extreme questions to trigger new, better ideas. “The following prompts jostle you out of tiny thinking. Each stretches some dimension of reality to an extreme. So extreme that it is nearly nonsense. But dramatically different perspectives can reveal distinctly new ideas. An idea that would be a 60% solution in an extreme hypothetical case, could be a 2x or even a 10x idea in reality.”What explains recent tech layoffs, and why should we be worried? “Layoffs often do not cut costs, as there are many instances of laid-off employees being hired back as contractors, with companies paying the contracting firm. Layoffs often do not increase stock prices, in part because layoffs can signal that a company is having difficulty. Layoffs do not increase productivity. Layoffs do not solve what is often the underlying problem, which is often an ineffective strategy, a loss of market share, or too little revenue. Layoffs are basically a bad decision.”Your Coworkers Are Less Ambitious; Bosses Adjust to the New Order. “Many white-collar workers say the events of the past three years have reordered their priorities and showed them what they were missing when they were spending so much time at the office. Now that normalcy is returning, even some of the workers who used to be always on and always striving say they find themselves eyeing the clock as the day winds down, saying no to overtime work or even taking pay cuts for better work-life balance.” Good!ClimateRevealed: more than 90% of rainforest carbon offsets by biggest provider are worthless, analysis shows.“The research into Verra, the world’s leading carbon standard for the rapidly growing $2bn (£1.6bn) voluntary offsets market, has found that, based on analysis of a significant percentage of the projects, more than 90% of their rainforest offset credits – among the most commonly used by companies – are likely to be “phantom credits” and do not represent genuine carbon reductions.”Compound extreme heat and drought will hit 90% of world population. “The frequency of extreme compounding hazards is projected to intensify tenfold globally due to the combined effects of warming and decreases in terrestrial water storage, under the highest emission scenario. Over 90% of the world population and GDP is projected to be exposed to increasing compounding risks in the future climate, even under the lowest emission scenario.”CultureThe contagious visual blandness of Netflix. “There are more green screens and sound stages, more CGI, more fixing-it-in-post. As these production tools have gotten slicker and cheaper and thus more widely abused, it’s not that everything looks obviously shitty or too good to feel true, it’s actually that most things look mid in the exact same way. The ubiquity of the look is making it harder to spot, and the overall result is weightless and uncanny. An endless stream of glossy vehicles that are easy to watch and easier to forget.”Noma, Rated the World’s Best Restaurant, Is Closing Its Doors. “The Copenhagen chef René Redzepi says fine dining at the highest level, with its grueling hours and intense workplace culture, has hit a breaking point: “It’s unsustainable.”” Time to close with one last audacious s’mores dish?Democracy‘I’m flabbergasted’: UNC leaders blindsided by trustees' decision on School of Civic Life and Leadership.“Mimi Chapman, chairperson of faculty, said she was “flabbergasted” in response to the exclusion of faculty input in the decision, which she said she considers to be an attack on shared University governance.” From the same university that denied tenure to Nikole Hannah-Jones.Adam Schiff to run against Porter for Feinstein’s California Senate seat. “Lee is an old-school, anti-establishment liberal with widespread name recognition in the Bay Area. Khanna has built more of a name for himself as a technocrat and wonk in the tech, antitrust, and economic realm, and co-chaired Bernie Sanders’s 2020 presidential campaign. Porter comes from the Elizabeth Warren lane of the party. But Schiff’s congressional identity has been shaped by his establishment ties.”Election workers could see expanded protections as threats continue. “While election workers mostly powered through a smooth process in November, the threat of political violence continues, according to election officials and voting rights advocates. Ramping up protections for election workers will be critical this year for legislatures.”NPR obtained secret tapes recorded by prison staff during Virginia executions. “An NPR investigation can now reveal the tapes show the prison neglected to record key evidence during what was considered one of Virginia’s worst executions, and staff appeared unprepared for some of the jobs they were tasked to do in the death chamber.”Donelan confirms stiffer online safety measures after backbench pressure. “Under a further change to the bill, video footage that shows people crossing the Channel in small boats in a “positive light” will be added to a list of illegal content that all tech platforms must proactively prevent from reaching users.” How is this internet safety?!Missouri House faces backlash for women’s dress code rule. “Democrats have excoriated Republicans on social media for legislating over what women should be required to wear. Criticism of the rule change comes at a time when the treatment of women in Missouri has received national attention.”Spot the difference: Boris Johnson appears scrubbed from photo posted by Shapps. “Social media users were quick to point out that Johnson appeared to have been erased from the image – an identical picture is still on the No 10 Flickr account, dated 9 June 2021, with the former PM standing between Shapps and Hart.” How very Stalin of him.‘It never stops’: killings by US police reach record high in 2022. “US law enforcement killed at least 1,176 people in 2022, making it the deadliest year on record for police violence since experts first started tracking the killings, a new data analysis reveals.”These anti-trans bills are being prepped for 2023 state legislative sessions. “Lawmakers in at least eight states used the last two months of 2022 to prefile anti-transgender bills ahead of state legislative sessions convening this month — setting up another year of statehouse battles over trans rights, while targeting health care for trans adults in new ways.”The secret money fueling the conservative anti-ESG push. “This isn’t a grassroots movement, and it isn’t coming from the financial industry, where most experts argue that considering issues like climate is prudent for investors. “I think it’s motivated by politics,” says Witold Henisz, a professor at the University of Pennsylvania’s Wharton School. “They think it’s a political wedge issue. You can see some of the same patterns of money moving into the anti-ESG movement that pushed back against climate science in the aughts.””A Con Man Is Succeeding Me in Congress Today. “But for now, there is no getting around the fact that Mr. Santos’s con game is a manifestation of a growing political phenomenon of saying or doing anything, with no automatic consequences. Whether it be far-right election deniers, personal attacks that call for violence against opponents, claims of false-flag mass shootings, extremists spouting the first thing that comes to mind and even one politician saying he could “shoot somebody” on Fifth Avenue and still not lose supporters.”HealthHow our microbiome is shaped by family, friends and even neighbours. “People living in the same household share more than just a roof. Be they family or flatmate, housemates tend to have the same microbes colonizing their bodies, and the longer the cohabitation, the more similar these microbiomes become. The conclusion raises the possibility that diseases linked to microbiome dysfunction, including cancer, diabetes and obesity, could be partly transmissible.”Gas stove health concerns add urgency to calls for changes in public housing. “Alarmingly, in a focus group conducted by the Public Health Law Center in Chicago, nearly 100 percent of public housing participants said they have also turned on their gas stoves to stay warm on cold days, which is an added danger for residents.”Population Attributable Fraction of Gas Stoves and Childhood Asthma in the United States. “The proportion of childhood asthma that could be theoretically prevented if gas stove use was not present (e.g., state-specific PAFs) varied by state (Illinois = 21.1%; California = 20.1%; New York = 18.8%; Massachusetts = 15.4%; Pennsylvania = 13.5%). Our results quantify the US public health burden attributed to gas stove use and childhood asthma.”Lead and Cadmium Could Be in Your Dark Chocolate. “The chocolate industry has been grappling with ways to lower those levels. To see how much of a risk these favorite treats pose, Consumer Reports scientists recently measured the amount of heavy metals in 28 dark chocolate bars. They detected cadmium and lead in all of them.”MediaNewsrooms that move beyond ‘objectivity’ can build trust. “Newer, nonprofit news organizations often have launched with stated missions. The national digital news site the 19th, for example, aims to “elevate voices of women, people of color, and the LGBTQ+ community.””Three years of The 19th: 30 cities, 54 employees and news that represents. “In the last year alone, we’ve grown at an astronomical pace: from 32 employees to 54, from a news organization that pledged to be the most representative in the nation to one where 65 percent of our staff is non-White, 30 percent are LGBTQ+ and 19 percent are living with disabilities. We’re now on the ground in more than 30 U.S. cities.” I’m so proud to be a part of this team.Layoff Brain. “Layoffs are the worst for the people who lose their job, but there’s a ripple effect on those who keep them — particularly if they keep them over the course of multiple layoffs. It’s a curious mix of guilt, relief, trepidation, and anger. Are you supposed to be grateful to the company whose primary leadership strategy seems to be keeping its workers trapped in fear? How do you trust your manager’s assurances of security further than the end of the next pay period?”Trump Looks to Abandon Truth Social, His Own Social Media Platform. “Since late last year, former President Trump has informed several people close to him that he doesn’t want to re-up the exclusivity agreement with his social media company, Truth Social, two sources familiar with the matter tell Rolling Stone. “There’s not going to be a need for that,” is how one of the sources recalls Trump describing his soon-to-expire contractual obligation. […] Trump and some of his close allies have already brainstormed about him tweeting that, even though Big Tech tried to “silence” him over his lies about a “rigged election,” he was now back to make “the Left” miserable.”Journalists (And Others) Should Leave Twitter. Here’s How They Can Get Started. “Many journalism organizations and public entities, such as local governments, believe Twitter is essential because it’s a place people know they can turn to when there’s big news — and find information from “verified accounts” that (barring a hack) ensure the source is who it’s claiming to be. So, they tell themselves, they have to stick around. This isn’t just short-sighted. It’s foolish.”Publishers, you should start using Mastodon: 10 reasons why. “There are plenty of articles about why you should leave Twitter (or at least, cross-post to Mastodon) for ethical, safety, political, social, and security/privacy reasons. This post won’t do any of those things. Instead, all my arguments are about why it’s smart from a pure business, marketing, and influence perspective to use Mastodon as soon as possible.”ScienceU.S.D.A. Approves First Vaccine for Honeybees. ““There are millions of beehives all over the world, and they don’t have a good health care system compared to other animals,” she said. “Now we have the tools to improve their resistance against diseases.”” Vaccines for bees!SocietyA vast majority of Americans are concerned people could face criminal penalties for abortion. “The data found that 80 percent of Americans are concerned that domestic abuse survivors could be reported by their abuser for getting an abortion. Eighty percent of people are also concerned that law enforcement could investigate people who have miscarriages or stillbirths if they are suspected of getting an abortion. The poll also found that 75 percent of people are concerned that people who get an abortion could be charged with a felony or go to jail.”Inside a US Neo-Nazi Homeschool Network With Thousands of Members. “Since the group began in October 2021 it has openly embraced Nazi ideology and promoted white supremacy, while proudly discouraging parents from letting their white children play with or have any contact with people of any other race. Admins and members use racist, homophobic, and antisemitic slurs without shame, and quote Hitler and other Nazi leaders daily in a channel open to the public.”The tragedy of the commons is a false and dangerous myth. “Even before Hardin’s ‘The Tragedy of the Commons’ was published, however, the young political scientist Elinor Ostrom had proven him wrong. While Hardin speculated that the tragedy of the commons could be avoided only through total privatisation or total government control, Ostrom had witnessed groundwater users near her native Los Angeles hammer out a system for sharing their coveted resource.”Pain of police killings ripples outward to traumatize Black people and communities across US. “Evidence shows that many Black Americans across the U.S. experience police killings of other Black people as traumatic events, and that this trauma diminishes the ability of Black communities to thrive.” Sobering statistics.U.S. Officials Announce Plans To Continue Pretending Brutal State-Sponsored Violence Not Supposed To Happen. ““Today, as we deal with the fallout from the death of Tyre Nichols, myself and the highest officials in the American government pledge to keep acting like we don’t want our highly militarized police force to kill innocent civilians every day,” said President Joe Biden at a White House press conference, adding that he and his fellow elected officials would pretend to gasp, pray, and put on a big emotional show every time law enforcement carried out the exact murders against its own citizens they had both tacitly and publicly approved.”Unionization increased by 200,000 in 2022: Tens of millions more wanted to join a union, but couldn’t .“One crucial way we can promote a more prosperous, equitable economy is to dismantle existing barriers to union organizing and collective bargaining. It is urgent that policymakers enact reforms at the federal and state levels to protect and support workers’ right to unionize.”Why Elon Musk and the billionaire space bros want to put people in space cages forever. “That said, I disagree with Mr. Wanjek: it requires much more than libertarian naiveté to colonize space. Parking humans in containment shelters, on Mars or elsewhere, so as to breed them and select them like cattle — that requires malice.”2023 'Doomsday Clock' moved 10 seconds closer to catastrophe. “Scientists revealed on Tuesday that the “Doomsday Clock” has been moved up to 90 seconds before midnight -- the closest humanity has ever been to armageddon.” But everything else is going so well.Post-Roe March for Life showed anti-abortion activists are far from done. “The next steps for the movement were illustrated by the march’s new route this year: Instead of ending at the steps of the Supreme Court as they have for nearly five decades, activists ended their march at the U.S. Capitol — underscoring their continued push for Congress to enact a federal abortion ban.”Anti-LGBTQ+ rhetoric and state laws are hurting youth mental health, poll shows. “Seventy-one percent of the 716 surveyed LGBTQ+ youth, ranging from teenagers to young adults who took the online poll last fall, said that debates around state laws restricting the rights of LGBTQ+ young people had negatively impacted their mental health. Twenty-seven percent characterized the negative effect as severe.”We Convinced Our School to Bring Back Masks. “As parents, it’s worth remembering that the persistent ones usually get what they want. Look at the anti-maskers. They didn’t give up. They kept pushing until they got their way. We don’t need to be that aggressive, but I think a lot of us get discouraged and give up. The anti-masker types never give up. They never seem to get tired. So if we want to beat them and win over middle earth, we have to match their energy.”Elon Musk-funded nonprofit run by MIT professor offered to finance Swedish pro-nazi group. “The US-based and Elon Musk-funded Future of Life Institute, run by MIT professor and Swedish citizen Max Tegmark, offered a grant of $100,000 to right-wing extremists in Sweden, an Expo investigation reveals.”Public Transit Goes Off the Rails With Fewer Riders, Dwindling Cash, Rising Crime. “Several of the nation’s largest urban mass-transit systems are at a crossroads, with ridership still depressed three years into the pandemic and federal aid running out.”TechnologyInstagram's co-founders are mounting a comeback. “TikTok’s innovation was to show you stuff using only algorithmic predictions, regardless of who your friends are or who you followed. It soon became the most downloaded app in the world. Artifact represents an effort to do the same thing, but for text.” Potentially an interesting app, based on an interesting insight.Women, minorities lose ground in tech layoffs. “The technology industry has long struggled to recruit a diverse workforce, but the recent spate of cuts by Silicon Valley companies has hit women particularly hard, according to recently published analyses of demographic data from the layoffs. Women and some minorities were particularly vulnerable to layoffs because they were newer to their jobs and occupied roles that companies were less interested in retaining, experts said.”U.S. sues Google for allegedly breaking antitrust laws with its ad business. ““For 15 years, Google has pursued a course of anticompetitive conduct that has allowed it to halt the rise of rival technologies, manipulate auction mechanics, to insulate itself from competition, and force advertisers and publishers to use its tools,” said Attorney General Merrick Garland at a press conference announcing the lawsuit.”Warning: Do not “other” me because of my age. “But I hate this new attention lavished on aging. Why? Because it “others” me. It puts me in a separate category from the rest of the world, and that is not how I think, feel, act, or want to be seen. All of a sudden I am not smart, pretty, successful, talented, or part of the family. I am “old.” I am somebody’s responsibility. I have to be told when to stop driving, and my checkbook can be taken away. I am a candidate for Senior Living (banishment to a place full of other old people).”Tapbot shuts down Tweetbot as it pivots to Mastodon. “Now that Twitter has confirmed it’s banning third-party clients, some of the most prominent alternatives are going away. Tapbots has shut down work on Tweetbot, one of the more popular iOS apps, as Twitter rendered it non-functional “in a blink of an eye.” The developer is instead pivoting to Ivory, an app for the open social platform Mastodon. While it’s limited to an invitation-only test for now, Tapbots hopes to make the software “better than Tweetbot ever could be.”” Likewise, Mastodon will be better than Twitter ever could be.U.S. No Fly List Left on Unprotected Airline Server. “Analysis of the server resulted in the discovery of a text file named “NoFly.csv,” a reference to the subset of individuals in the Terrorist Screening Database who have been barred from air travel due to having suspected or known ties to terrorist organizations.”‘Passion economy’ platforms cut costs in tech downturn. ““People are making choices,” said Rebecca McGrath, an internet analyst at Mintel. “Unless you’re very loyal to a creator, that’ll be one of the obvious things to drop.””Tesla video promoting self-driving was staged, engineer testifies. “A 2016 video that Tesla used to promote its self-driving technology was staged to show capabilities like stopping at a red light and accelerating at a green light that the system did not have, according to testimony by a senior engineer.” They’re fun cars to drive, but don’t let them drive themselves.Medium embraces Mastodon. “Today, Medium is launching a Mastodon instance at http://me.dm/ to help our authors, publications and readers find a home in the fediverse. Mastodon is an emerging force for good in social media and we are excited to join this community.” Hell yeah.The Effects of Online Content Moderation: Evidence from President Trump's Account Deletion. “The toxicity of tweets sent by Trump followers relative to a representative sample of US Twitter users dropped by around 25% after the account deletion. Second, this effect is larger for pro-Trump tweets and Republican users. Third, Trump’s suspension reduced the total number of tweets, suggesting a drop in engagement. Fourth, we find effects on individuals who did not follow Trump directly but followed somebody that did, suggesting network spillovers.”The Intercept Obtains Surveillance Footage of Tesla Crash on Bay Bridge. “These semi-autonomous systems are playing the same sort of trick as ChatGPT: they offer a convincing but shallow impression of a competent driverless car without any broader context to fall back on.”Apache® Appropriation. “We urge The Apache® Software Foundation to take the necessary steps needed to express the ally-ship they promote so deeply on their website, to act in accordance with their own code of conduct, to “be careful in the words that [they] choose”, and change their name.” +1.San Francisco Police Are Using Driverless Cars as Mobile Surveillance Cameras. “Law enforcement agencies already have access to automated license plate readers, geofence warrants, Ring Doorbell footage, as well as the ability to purchase location data. This practice will extend the reach of an already pervasive web of surveillance.”Seattle schools sue tech giants over social media harm. “[The lawsuit] blames [social media giants] for worsening mental health and behavioral disorders including anxiety, depression, disordered eating and cyberbullying; making it more difficult to educate students; and forcing schools to take steps such as hiring additional mental health professionals, developing lesson plans about the effects of social media, and providing additional training to teachers.”‘Office Space’ Inspired Engineer’s Theft Scheme, Police Say. “A software engineer siphoned more than $300,000 from his employer by introducing what prosecutors called a “series of malicious software edits” that wired money into his personal account. If the scheme sounds like the plot of “Office Space,” that’s because the authorities said it was partly inspired by the movie.”Activity Streams graphical model. “So I did a bit of drawing just to make it clearer (for myself) what kind of data can be shipped around in the Fediverse. To be clear, this is only a small part of the overall stack, but an important one.” Useful work!TwitterElon Musk’s Twitter hit with holocaust denial hate speech lawsuit in Germany. “Current studies prove that 84% of posts containing antisemitic hate speech were not reviewed by social media platforms, as shown in a study by the Center for Countering Digital Hate. Which means that Twitter knows Jews are being publicly attacked on the platform every day and that antisemitism is becoming a normality in our society. And that the platform’s response is by no means adequate.”Daring Fireball: If You Needed Any More Confirmation, Internal Slack Messages at Twitter Show That Cutting Off Third-Party Clients Was 'Intentional'. “Twitter can of course do what it wants, and Musk owns Twitter so he can do what he wants. But pulling the plug on these clients and ghosting everyone on communications about it is so absurdly disrespectful. Zero respect for the users for those apps, zero respect for the developers behind them — many of whom had been building on the Twitter platform for 10-15 years. Just a clown show.”How Twitter misleads us about how many people have left — and what to do about it. “To outside observers, it can seem like Twitter users are continuing as before, seemingly unaware of the millions of people who have left. “You left Twitter?” a friend recently remarked, “I hadn’t noticed.” Yet many of the accounts I follow haven’t tweeted in ages, and roughly 15% of them have already set up accounts on Mastodon.” Some great tips in this piece."
          }
        ],
        "in-reply-to": [
          "http://me.dm/"
        ],
        "url": [
          "https://werd.io/2023/reading-watching-playing-using-january-2023"
        ],
        "published": [
          "2023-02-01T17:00:46+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "Which sales enablement tool powers all those template-driven follow-up-heavy cold emails? I hereby petition that we yeet it directly into the sun."
        ],
        "content": [
          {
            "html": "Which sales enablement tool powers all those template-driven follow-up-heavy cold emails? I hereby petition that we yeet it directly into the sun.",
            "value": "Which sales enablement tool powers all those template-driven follow-up-heavy cold emails? I hereby petition that we yeet it directly into the sun."
          }
        ],
        "url": [
          "https://werd.io/2023/which-sales-enablement-tool-powers-all-those"
        ],
        "published": [
          "2023-01-31T19:16:39+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "Few things terrify me more than yoga, which is really a terror and dissatisfaction with my own body. I would like to fix that."
        ],
        "content": [
          {
            "html": "Few things terrify me more than yoga, which is really a terror and dissatisfaction with my own body. I would like to fix that.",
            "value": "Few things terrify me more than yoga, which is really a terror and dissatisfaction with my own body. I would like to fix that."
          }
        ],
        "url": [
          "https://werd.io/2023/few-things-terrify-me-more-than-yoga"
        ],
        "published": [
          "2023-01-31T17:32:55+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "I’m worried I have delayed onset long covid. I’ve had very strong fatigue, shortness of breath, congestion, and muscle aches for weeks. I can tell that having these symptoms while taking care of a baby is not going to be a walk in the park. Really hoping I can overcome them."
        ],
        "content": [
          {
            "html": "I’m worried I have delayed onset long covid. I’ve had very strong fatigue, shortness of breath, congestion, and muscle aches for weeks. I can tell that having these symptoms while taking care of a baby is not going to be a walk in the park. Really hoping I can overcome them.",
            "value": "I’m worried I have delayed onset long covid. I’ve had very strong fatigue, shortness of breath, congestion, and muscle aches for weeks. I can tell that having these symptoms while taking care of a baby is not going to be a walk in the park. Really hoping I can overcome them."
          }
        ],
        "url": [
          "https://werd.io/2023/im-worried-i-have-delayed-onset-long"
        ],
        "published": [
          "2023-01-30T03:44:12+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "What’s the last book you read and loved?"
        ],
        "content": [
          {
            "html": "What’s the last book you read and loved?",
            "value": "What’s the last book you read and loved?"
          }
        ],
        "url": [
          "https://werd.io/2023/whats-the-last-book-you-read-and"
        ],
        "published": [
          "2023-01-29T12:52:59+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "Tonight"
        ],
        "content": [
          {
            "html": "<p>I have two things on my mind tonight.</p>\n<p>First: <a href=\"https://www.cnn.com/2023/01/27/us/tyre-nichols-memphis-friday/index.html\">the brutal murder of Tyre Nichols by Memphis police officers</a>, far from the first <a href=\"https://www.washingtonpost.com/graphics/investigations/police-shootings-database/#database-header\">or even the fiftieth murder</a> by police so far this year. </p>\n<p>Second: <a href=\"https://everytownresearch.org/report/the-impact-of-active-shooter-drills-in-schools/\">active shooter drills in schools, which aren’t proven to save lives but do lead to anxiety and depression in children</a>.</p>\n<p>This country has violence burned into its bones. It’s in the air and visible in the holsters on the belts of police officers, in open carry, in the ongoing injustice of the death penalty. It’s in its stoic men, in its value of strength over intelligence and brute force over creativity, and in the militarization of everyday life. It’s in its failure to repair the gaping wounds of slavery and segregation, and in tribalism over solidarity. It’s in its failure to care for the poor, to put a roof over the head of the homeless, and to heal the sick. It’s in the value it places in wealth over kindness and fairness.</p>\n<p>It’s reductive to suggest there’s an easy answer. The rot is ingrained; a simultaneous equation made of simultaneous equations. But I can make some observations.</p>\n<p>A different question is this: what should we do about our son?</p>",
            "value": "I have two things on my mind tonight.First: the brutal murder of Tyre Nichols by Memphis police officers, far from the first or even the fiftieth murder by police so far this year. Second: active shooter drills in schools, which aren’t proven to save lives but do lead to anxiety and depression in children.This country has violence burned into its bones. It’s in the air and visible in the holsters on the belts of police officers, in open carry, in the ongoing injustice of the death penalty. It’s in its stoic men, in its value of strength over intelligence and brute force over creativity, and in the militarization of everyday life. It’s in its failure to repair the gaping wounds of slavery and segregation, and in tribalism over solidarity. It’s in its failure to care for the poor, to put a roof over the head of the homeless, and to heal the sick. It’s in the value it places in wealth over kindness and fairness.It’s reductive to suggest there’s an easy answer. The rot is ingrained; a simultaneous equation made of simultaneous equations. But I can make some observations.A different question is this: what should we do about our son?"
          }
        ],
        "url": [
          "https://werd.io/2023/tonight"
        ],
        "published": [
          "2023-01-28T05:32:49+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "It's only a podcast if it's open"
        ],
        "content": [
          {
            "html": "<p><img src=\"https://werd.io/file/63d3270d581a475e990a9602/thumb.jpg\" alt=\"A podcasting setup with a microphone and a laptop\" width=\"1024\" height=\"683\"></p>\n<p>Quick PSA:</p>\n<p><strong>A podcast is only a podcast if you can listen to it anywhere.</strong></p>\n<p>Just like a newsletter isn’t a newsletter if you can’t subscribe using any email address, the point of a podcast is that you can listen to it in any podcast app. It just works.</p>\n<p>If your podcast only works in Spotify or Apple Podcasts or another proprietary app, perhaps because of an exclusivity arrangement, it’s just serial audio. The content may be wonderful, but you’re missing out on the complete set of potential listeners in order to focus on one app’s existing username.</p>\n<p>In some ways that’s fine - after all, you can’t watch a Netflix show in any app but Netflix’s - but it’s not a podcast. It’s something else. It’s just a show on someone’s channel.</p>\n<p>The way podcasts work is by releasing episodes as attachments on an RSS feed. You don’t need to <em>know</em> that this is how it happens - all you need to know is that it doesn’t matter which podcast app you prefer, just as it doesn’t matter which browser you use to access your favorite website. The point of these platforms is that you have the choice.</p>\n<p>That’s important for listeners, but it’s also important for producers. Tech companies are notoriously fickle, and signing an exclusivity deal with one inexorably ties your future into their evolving business strategies.</p>\n<p>It might make sense to make an exclusive deal with a streaming platform if they’re going to give you <a href=\"https://www.nytimes.com/2022/02/17/arts/music/spotify-joe-rogan-misinformation.html\">$200 million like Joe Rogan</a>. (I tend to think this is win-win: Spotify thinks it has something unique, while the rest of us aren’t bothered with Rogan’s show.) But if you’re making a deal for a fraction of that money, know that you’re losing out on reaching out to a whole ecosystem in exchange for tying yourself to the business model of a startup that might change business model on a dime and leave your show - or even your whole production company - in the dirt.</p>\n<p>The media industry is littered with the graves of companies that tied themselves to onerous distribution contracts. There’s no need. Podcasts are open, available everywhere, and easily monetizable once you’ve got a subscribed audience. You don’t need to prostrate yourself for a company that, ultimately, doesn’t care about your future.</p>",
            "value": "A podcasting setup with a microphone and a laptop Quick PSA:A podcast is only a podcast if you can listen to it anywhere.Just like a newsletter isn’t a newsletter if you can’t subscribe using any email address, the point of a podcast is that you can listen to it in any podcast app. It just works.If your podcast only works in Spotify or Apple Podcasts or another proprietary app, perhaps because of an exclusivity arrangement, it’s just serial audio. The content may be wonderful, but you’re missing out on the complete set of potential listeners in order to focus on one app’s existing username.In some ways that’s fine - after all, you can’t watch a Netflix show in any app but Netflix’s - but it’s not a podcast. It’s something else. It’s just a show on someone’s channel.The way podcasts work is by releasing episodes as attachments on an RSS feed. You don’t need to know that this is how it happens - all you need to know is that it doesn’t matter which podcast app you prefer, just as it doesn’t matter which browser you use to access your favorite website. The point of these platforms is that you have the choice.That’s important for listeners, but it’s also important for producers. Tech companies are notoriously fickle, and signing an exclusivity deal with one inexorably ties your future into their evolving business strategies.It might make sense to make an exclusive deal with a streaming platform if they’re going to give you $200 million like Joe Rogan. (I tend to think this is win-win: Spotify thinks it has something unique, while the rest of us aren’t bothered with Rogan’s show.) But if you’re making a deal for a fraction of that money, know that you’re losing out on reaching out to a whole ecosystem in exchange for tying yourself to the business model of a startup that might change business model on a dime and leave your show - or even your whole production company - in the dirt.The media industry is littered with the graves of companies that tied themselves to onerous distribution contracts. There’s no need. Podcasts are open, available everywhere, and easily monetizable once you’ve got a subscribed audience. You don’t need to prostrate yourself for a company that, ultimately, doesn’t care about your future."
          }
        ],
        "url": [
          "https://werd.io/2023/its-only-a-podcast-if-its-open"
        ],
        "published": [
          "2023-01-27T01:19:48+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "Introducing WerdStore"
        ],
        "content": [
          {
            "html": "<p>I wanted to understand what’s involved in setting up an online store, so I’ve <a href=\"https://www.etsy.com/shop/WerdStore\">created an Etsy store to accompany my website</a>. Everything is made and fulfilled by <a href=\"https://printful.com/\">Printful</a>, which seems to work pretty well.</p>\n<p>Anyway, this is my favorite item in the store right now:</p>\n<p><a href=\"https://www.etsy.com/listing/1388585650/holmes-musk-neumann-bankman-fried?click_key=3277dc32d59a26752883c9452f0410d64af2c80c:1388585650&amp;click_sum=5f272fe7\"><img src=\"https://werd.io/file/63d2acf2a36b448a02059a02\" alt=\"Holmes &amp; Musk &amp; Neumann &amp; Bankman-Fried T-shirt\" width=\"1000\" height=\"1000\"></a></p>\n<p>I’ll add new stuff from time to time. This is mostly for fun, but also, like I said, a bit for my own education.</p>",
            "value": "I wanted to understand what’s involved in setting up an online store, so I’ve created an Etsy store to accompany my website. Everything is made and fulfilled by Printful, which seems to work pretty well.Anyway, this is my favorite item in the store right now: Holmes & Musk & Neumann & Bankman-Fried T-shirt I’ll add new stuff from time to time. This is mostly for fun, but also, like I said, a bit for my own education."
          }
        ],
        "url": [
          "https://werd.io/2023/introducing-werdstore"
        ],
        "published": [
          "2023-01-26T16:41:54+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "Finding that the cognitive load of plugging into Mastodon is approaching the cognitive load of being plugged into Twitter. It's not the content of the conversations; it's the river of content itself. I'm going to give myself a break today and see how it feels."
        ],
        "content": [
          {
            "html": "Finding that the cognitive load of plugging into Mastodon is approaching the cognitive load of being plugged into Twitter. It's not the content of the conversations; it's the river of content itself. I'm going to give myself a break today and see how it feels.",
            "value": "Finding that the cognitive load of plugging into Mastodon is approaching the cognitive load of being plugged into Twitter. It's not the content of the conversations; it's the river of content itself. I'm going to give myself a break today and see how it feels."
          }
        ],
        "url": [
          "https://werd.io/2023/finding-that-the-cognitive-load-of-plugging"
        ],
        "published": [
          "2023-01-25T17:49:35+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "I think it's a fair question to ask why the Washington Post is laying off journalists right now. Other orgs have activist investors or fragile bottom lines; it has Jeff Bezos. Given that layoffs don't really work, what's the point beyond optics?"
        ],
        "content": [
          {
            "html": "I think it's a fair question to ask why the Washington Post is laying off journalists right now. Other orgs have activist investors or fragile bottom lines; it has Jeff Bezos. Given that layoffs don't really work, what's the point beyond optics?",
            "value": "I think it's a fair question to ask why the Washington Post is laying off journalists right now. Other orgs have activist investors or fragile bottom lines; it has Jeff Bezos. Given that layoffs don't really work, what's the point beyond optics?"
          }
        ],
        "url": [
          "https://werd.io/2023/i-think-it039s-a-fair-question-to"
        ],
        "published": [
          "2023-01-24T22:37:25+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "Organizing my blog"
        ],
        "content": [
          {
            "html": "<p>I’ve been wondering about adding more organization to my site. As of right now, the homepage is a mix of long-form posts, short thoughts, and links I consider interesting, presented as a stream. It’s a genuine representation of what I’m reading and thinking about, and each post’s permalink page looks fine to me, but it doesn’t quite hold together as a whole. If you <a href=\"https://werd.io/\">look at my homepage with fresh eyes</a>, my stream is a hodgepodge. There’s no <em>through line</em>.</p>\n<p>One way to get around this might be to split my homepage into columns: one big column for latest long-form pieces, and a smaller column for links. <a href=\"https://waxy.org/\">Andy Baio’s site does this pretty well</a>, for example.</p>\n<p>On the other hand, sites like <a href=\"https://www.theverge.com/\">The Verge</a> present notes, links, and articles in one stream. I find it a little confusing to read, but there’s at least precedent for my approach. Of course, my site is more or less monochrome, while they clearly have a visual design team on-staff. One thing I really like is that (as befits a tech publication rather than a single-author blog) they don’t just display the latest long-form post on the homepage; you’ve got to click through. This is similar to the WordPress setup we use <a href=\"https://19thnews.org/\">at my day job at The 19th</a>.</p>\n<p>I think I’m just sick of my design and need to try something else out. What do you think? Drop me a line if there’s a blog design you particularly like, or if you’d like to see me organize my stuff in a particular way.</p>",
            "value": "I’ve been wondering about adding more organization to my site. As of right now, the homepage is a mix of long-form posts, short thoughts, and links I consider interesting, presented as a stream. It’s a genuine representation of what I’m reading and thinking about, and each post’s permalink page looks fine to me, but it doesn’t quite hold together as a whole. If you look at my homepage with fresh eyes, my stream is a hodgepodge. There’s no through line.One way to get around this might be to split my homepage into columns: one big column for latest long-form pieces, and a smaller column for links. Andy Baio’s site does this pretty well, for example.On the other hand, sites like The Verge present notes, links, and articles in one stream. I find it a little confusing to read, but there’s at least precedent for my approach. Of course, my site is more or less monochrome, while they clearly have a visual design team on-staff. One thing I really like is that (as befits a tech publication rather than a single-author blog) they don’t just display the latest long-form post on the homepage; you’ve got to click through. This is similar to the WordPress setup we use at my day job at The 19th.I think I’m just sick of my design and need to try something else out. What do you think? Drop me a line if there’s a blog design you particularly like, or if you’d like to see me organize my stuff in a particular way."
          }
        ],
        "url": [
          "https://werd.io/2023/organizing-my-blog"
        ],
        "published": [
          "2023-01-24T20:51:34+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "I'm not sure how \"centrist\" became equated with \"reasonable\". In a place where the entire political spectrum (and Overton window) is shifted to the right, the center is still right. Is that truly reasonable and equitable? Or is it just comfortable to powers that be?"
        ],
        "content": [
          {
            "html": "I'm not sure how \"centrist\" became equated with \"reasonable\". In a place where the entire political spectrum (and Overton window) is shifted to the right, the center is still right. Is that truly reasonable and equitable? Or is it just comfortable to powers that be?",
            "value": "I'm not sure how \"centrist\" became equated with \"reasonable\". In a place where the entire political spectrum (and Overton window) is shifted to the right, the center is still right. Is that truly reasonable and equitable? Or is it just comfortable to powers that be?"
          }
        ],
        "url": [
          "https://werd.io/2023/i039m-not-sure-how-quotcentristquot-became-equated"
        ],
        "published": [
          "2023-01-23T18:28:59+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "Speaking loudly about ethics in tech and media is more important than it's ever been. And it'll only become more important as time goes on. Use your voice - please."
        ],
        "content": [
          {
            "html": "Speaking loudly about ethics in tech and media is more important than it's ever been. And it'll only become more important as time goes on. Use your voice - please.",
            "value": "Speaking loudly about ethics in tech and media is more important than it's ever been. And it'll only become more important as time goes on. Use your voice - please."
          }
        ],
        "url": [
          "https://werd.io/2023/speaking-loudly-about-ethics-in-tech-and"
        ],
        "published": [
          "2023-01-22T17:44:24+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "Looking beyond copaganda"
        ],
        "content": [
          {
            "html": "<p>American TV is saturated with <a href=\"https://en.wikipedia.org/wiki/Copaganda\">copaganda</a>: media intended to sway public perception in favor of the police. Even in a world where it’s become clear that the police disproportionately kill people of color and otherwise enforce adverse power dynamics for oppressed communities, we see show after show after show where the police are unambiguously the good guys. Often those maverick cops get their good guy jobs done by flaunting the rules - because, after all, what possible good could those rules possibly do?</p>\n<p><a href=\"https://www.vanityfair.com/hollywood/2020/06/tv-and-cops\">As Aaron Rahsaan Thomas, the co-creator of S.W.A.T., put it</a>:</p>\n<blockquote><p>Traditionally, the domain of TV police procedurals has been as morality plays, where clear lines are drawn. The past 60 years have seen shows like Dragnet, The Untouchables, and Adam 12 establish a formula where, within an hour of story, good lawmen, also known as square-jawed white cops, defeat bad guys, often known as poor people of color. This stark clarity, indulging the idea of the hero cop, often provides a sense of satisfaction for some viewers in an otherwise complicated world.</p></blockquote>\n<p>It’s worth considering <em>which</em> viewers. His whole piece is an important read, particularly on white voice even in the face of diverse casting. </p>\n<p>I’d love to see more shows - <em>any</em> shows, actually - about law enforcement that move beyond this narrative and are willing to discuss the complicated power differentials that underpin oppression. There’s so much to talk about here, so much great drama that speaks to peoples’ lived experiences, yet I wonder if it would even be possible to put it on the air.</p>\n<p>Copaganda is part of the culture. Some of it was certainly produced with the explicit intention of swaying the public towards law enforcement. But it’s a trope now: these are established categories of drama that perpetuate themselves because we’ve come to expect them. Just as <a href=\"https://www.vice.com/en/article/4x3vg3/how-the-cia-turned-american-literature-into-a-content-farm\">the CIA funded Iowa Writer’s Workshop and shaped modern American literature as a result</a>, police PR has shaped television.</p>\n<p>As that last linked piece puts it:</p>\n<blockquote><p>Maybe it's just a reminder that we need to be wary of the sandboxes we’re building our castles in, of the institutions that define our creative thought so wholly that we often forget (or never bother to ask) how and why they were established in the first place. </p></blockquote>\n<p>British TV does a slightly better job, perhaps partially because Britain tends to hold a bit less reverence for its institutions (at least if you squint a bit and don’t ask too many questions about the enduring legacy of its empire). I enjoyed both seasons of <a href=\"https://tv.apple.com/us/show/slow-horses/umc.cmc.2szz3fdt71tl1ulnbp8utgq5o\">Slow Horses</a>, a British drama about dysfunctional MI5 agents who find themselves working against establishment corruption that is at least as formidable as any outside force. Back in the nineties, the BBC show <a href=\"https://en.wikipedia.org/wiki/Between_the_Lines_(TV_series)\">Between the Lines</a> dealt directly with police corruption. They’re both great TV, but while the protagonists in both cases are from a semi-ostracized branch of the powers that be, they’re still formally a part of that established order. I would love to see drama fully drawn from the perspective of people who wind up on the wrong side of it.</p>\n<p><em>The Wire</em> might come the closest, at least in intention. Its star, Wendell Pierce, <a href=\"https://www.yahoo.com/entertainment/wendell-pierce-the-wire-copaganda-dont-hang-up-181137716.html\">speaking to Yahoo Entertainment last year</a>:</p>\n<blockquote><p>Sure, you're recognizing the individuals that were lost in a system that perpetuated this sort of misconduct, and maybe you had empathy for some of the individuals in that system. But in no way did we celebrate the moral ambiguity, the moral inconsistencies and the failures of the police — quite the opposite. We showed the dysfunction of the police and hopefully awakened people to why it needs to be changed.</p></blockquote>\n<p>But the real answer is going to lead from more diversity at the highest levels of television. You’re not going to get an authentic story about communities who have been oppressed unless you greenlight shows written by people from those communities, again and again and again. There’s a lot of work to do.</p>\n<p><a href=\"https://www.vanityfair.com/hollywood/2020/06/tv-and-cops\">Aaron Rahsaan Thomas again</a>:</p>\n<blockquote><p>I often hear platitudes about hiring more diversity at the lowest levels and tolerating new points of view from “cooler” white writers, but rarely hear how any writer of color can manage a career to get to a point where their voice drives a show and impacts the worldwide narrative on these stories.</p></blockquote>\n<p>Please, let’s get on it. I want to watch some TV.</p>",
            "value": "American TV is saturated with copaganda: media intended to sway public perception in favor of the police. Even in a world where it’s become clear that the police disproportionately kill people of color and otherwise enforce adverse power dynamics for oppressed communities, we see show after show after show where the police are unambiguously the good guys. Often those maverick cops get their good guy jobs done by flaunting the rules - because, after all, what possible good could those rules possibly do?As Aaron Rahsaan Thomas, the co-creator of S.W.A.T., put it:Traditionally, the domain of TV police procedurals has been as morality plays, where clear lines are drawn. The past 60 years have seen shows like Dragnet, The Untouchables, and Adam 12 establish a formula where, within an hour of story, good lawmen, also known as square-jawed white cops, defeat bad guys, often known as poor people of color. This stark clarity, indulging the idea of the hero cop, often provides a sense of satisfaction for some viewers in an otherwise complicated world.It’s worth considering which viewers. His whole piece is an important read, particularly on white voice even in the face of diverse casting. I’d love to see more shows - any shows, actually - about law enforcement that move beyond this narrative and are willing to discuss the complicated power differentials that underpin oppression. There’s so much to talk about here, so much great drama that speaks to peoples’ lived experiences, yet I wonder if it would even be possible to put it on the air.Copaganda is part of the culture. Some of it was certainly produced with the explicit intention of swaying the public towards law enforcement. But it’s a trope now: these are established categories of drama that perpetuate themselves because we’ve come to expect them. Just as the CIA funded Iowa Writer’s Workshop and shaped modern American literature as a result, police PR has shaped television.As that last linked piece puts it:Maybe it's just a reminder that we need to be wary of the sandboxes we’re building our castles in, of the institutions that define our creative thought so wholly that we often forget (or never bother to ask) how and why they were established in the first place. British TV does a slightly better job, perhaps partially because Britain tends to hold a bit less reverence for its institutions (at least if you squint a bit and don’t ask too many questions about the enduring legacy of its empire). I enjoyed both seasons of Slow Horses, a British drama about dysfunctional MI5 agents who find themselves working against establishment corruption that is at least as formidable as any outside force. Back in the nineties, the BBC show Between the Lines dealt directly with police corruption. They’re both great TV, but while the protagonists in both cases are from a semi-ostracized branch of the powers that be, they’re still formally a part of that established order. I would love to see drama fully drawn from the perspective of people who wind up on the wrong side of it.The Wire might come the closest, at least in intention. Its star, Wendell Pierce, speaking to Yahoo Entertainment last year:Sure, you're recognizing the individuals that were lost in a system that perpetuated this sort of misconduct, and maybe you had empathy for some of the individuals in that system. But in no way did we celebrate the moral ambiguity, the moral inconsistencies and the failures of the police — quite the opposite. We showed the dysfunction of the police and hopefully awakened people to why it needs to be changed.But the real answer is going to lead from more diversity at the highest levels of television. You’re not going to get an authentic story about communities who have been oppressed unless you greenlight shows written by people from those communities, again and again and again. There’s a lot of work to do.Aaron Rahsaan Thomas again:I often hear platitudes about hiring more diversity at the lowest levels and tolerating new points of view from “cooler” white writers, but rarely hear how any writer of color can manage a career to get to a point where their voice drives a show and impacts the worldwide narrative on these stories.Please, let’s get on it. I want to watch some TV."
          }
        ],
        "url": [
          "https://werd.io/2023/looking-beyond-copaganda"
        ],
        "published": [
          "2023-01-22T16:59:56+00:00"
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "author": [
          {
            "type": [
              "h-card"
            ],
            "properties": {
              "url": [
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd",
                "https://werd.io/profile/benwerd"
              ],
              "photo": [
                "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
              ],
              "name": [
                "Ben Werdmuller"
              ]
            },
            "value": "Ben Werdmuller"
          }
        ],
        "name": [
          "A web-based science fiction literary journal"
        ],
        "content": [
          {
            "html": "<p>I had an idea for an online science fiction literary journal.</p>\n<p>First: it’s on the web and free to access on beautiful, standards-based, responsive, blazing-fast web pages. Nobody ever <em>needs</em> to pay to read its content. It’s all out there, paywall-free, and anyone can link to it and share it. That means that authors can share links to their work without worrying that someone can’t see it, which in particular will allow emerging authors to find audiences frictionlessly. The website publishes roughly one story per week.</p>\n<p>Second: you can subscribe via email, RSS, and ActivityPub. However you get your content is a-ok. Every new story is shared on social media, there’s a Flipboard publication, and so on - if you want the content to come to you, it will. Every piece is illustrated by a real, human illustrator, in part so that they show up beautifully on every platform.</p>\n<p>Third: the journal is patronage-supported. Anyone can put money in and will be acknowledged on the supporters page, in the order of the amount of money you’ve paid in your contribution history. Above a threshold, these acknowledgments have a full referrer link to a contributor’s website. Every payment is always acknowledged.</p>\n<p>Fourth: everyone is paid fairly. Authors and illustrators both get a one-off fair, flat rate payment, as well as a portion of the patronage contributions. Payouts are proportional to views in the month of the payout, and are above and beyond the original fair payout - so they’re kind of a bonus rather than forcing their full earnings for their work to be based on attention. But if a particular short story continues to be popular for a year or two, the author sees compensation for that.</p>\n<p>Fifth: there is an annual compendium of short stories, published as a real, hardbound book. Authors and illustrators see royalties from this, too. No further rights are sought aside from the website and the book, so authors and artists are free to bring their work elsewhere and secure further rights however they wish.</p>\n<p>Sixth: it’s not going to be profitable. But it would be a fun labor of love that also hopefully provides both monetary and career support for artists.</p>\n<p>Probably don’t let me actually do this right now. But it’s fun to think about.</p>",
            "value": "I had an idea for an online science fiction literary journal.First: it’s on the web and free to access on beautiful, standards-based, responsive, blazing-fast web pages. Nobody ever needs to pay to read its content. It’s all out there, paywall-free, and anyone can link to it and share it. That means that authors can share links to their work without worrying that someone can’t see it, which in particular will allow emerging authors to find audiences frictionlessly. The website publishes roughly one story per week.Second: you can subscribe via email, RSS, and ActivityPub. However you get your content is a-ok. Every new story is shared on social media, there’s a Flipboard publication, and so on - if you want the content to come to you, it will. Every piece is illustrated by a real, human illustrator, in part so that they show up beautifully on every platform.Third: the journal is patronage-supported. Anyone can put money in and will be acknowledged on the supporters page, in the order of the amount of money you’ve paid in your contribution history. Above a threshold, these acknowledgments have a full referrer link to a contributor’s website. Every payment is always acknowledged.Fourth: everyone is paid fairly. Authors and illustrators both get a one-off fair, flat rate payment, as well as a portion of the patronage contributions. Payouts are proportional to views in the month of the payout, and are above and beyond the original fair payout - so they’re kind of a bonus rather than forcing their full earnings for their work to be based on attention. But if a particular short story continues to be popular for a year or two, the author sees compensation for that.Fifth: there is an annual compendium of short stories, published as a real, hardbound book. Authors and illustrators see royalties from this, too. No further rights are sought aside from the website and the book, so authors and artists are free to bring their work elsewhere and secure further rights however they wish.Sixth: it’s not going to be profitable. But it would be a fun labor of love that also hopefully provides both monetary and career support for artists.Probably don’t let me actually do this right now. But it’s fun to think about."
          }
        ],
        "url": [
          "https://werd.io/2023/a-web-based-science-fiction-literary-journal"
        ],
        "published": [
          "2023-01-21T17:26:06+00:00"
        ]
      }
    }
  ],
  "rels": {
    "apple-touch-icon": [
      "https://werd.io/gfx/logos/apple-icon-57x57.png",
      "https://werd.io/gfx/logos/apple-icon-72x72.png",
      "https://werd.io/gfx/logos/apple-icon-114x114.png",
      "https://werd.io/gfx/logos/apple-icon-144x144.png",
      "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
    ],
    "icon": [
      "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
    ],
    "shortcut": [
      "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
    ],
    "apple-touch-icon-precomposed": [
      "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
    ],
    "manifest": [
      "https://werd.io/chrome/manifest.json"
    ],
    "schema.DC": [
      "https://purl.org/dc/elements/1.1/"
    ],
    "stylesheet": [
      "https://werd.io/vendor/twbs/bootstrap/dist/css/bootstrap.min.css",
      "https://werd.io/vendor/npm-asset/bootstrap-accessibility-plugin/plugins/css/bootstrap-accessibility.css",
      "https://werd.io/vendor/forkawesome/fork-awesome/css/fork-awesome.min.css",
      "https://werd.io/vendor/forkawesome/fork-awesome/css/v5-compat.min.css",
      "https://werd.io/css/1659102598/known.min.css",
      "https://werd.io/vendor/npm-asset/bootstrap-toggle/css/bootstrap-toggle.min.css",
      "https://werd.io/vendor/idno/mentionjs/recommended-styles.css",
      "https://werd.io/vendor/npm-asset/eonasdan-bootstrap-datetimepicker/build/css/bootstrap-datetimepicker.min.css",
      "https://werd.io/Themes/CornmarketStreet/css/default.css",
      "https://fonts.googleapis.com/css?family=Merriweather:300,300i,400,400i,700,700i",
      "https://werd.io/vendor/npm-asset/mediaelement/build/mediaelementplayer.min.css"
    ],
    "alternate": [
      "https://werd.io/profile/benwerd?_t=rss",
      "https://werd.io/content/all?_t=rss",
      "https://werd.io/content/bookmarkedpages?_t=rss",
      "https://granary.io/url?url=https://werd.io/content/all/&input=html&output=atom&hub=https://bridgy-fed.superfeedr.com/"
    ],
    "feed": [
      "https://werd.io/profile/benwerd?_t=rss",
      "https://werd.io/content/all?_t=rss",
      "https://werd.io/content/all",
      "https://werd.io/content/bookmarkedpages?_t=rss"
    ],
    "http://webmention.org/": [
      "https://werd.io/webmention/"
    ],
    "webmention": [
      "https://werd.io/webmention/"
    ],
    "hub": [
      "https://withknown.superfeedr.com/"
    ],
    "me": [
      "https://github.com/benwerd",
      "https://www.linkedin.com/in/benwerd",
      "https://werd.social/@ben",
      "https://19thnews.org/"
    ],
    "openid.delegate": [
      "https://werd.io/"
    ],
    "openid.server": [
      "https://indieauth.com/openid"
    ],
    "authorization_endpoint": [
      "https://werd.io/indieauth/auth"
    ],
    "token_endpoint": [
      "https://werd.io/indieauth/token"
    ],
    "micropub": [
      "https://werd.io/micropub/endpoint"
    ],
    "canonical": [
      "https://werd.io/2023/a-web-based-science-fiction-literary-journal"
    ],
    "permalink": [
      "https://werd.io/2023/if-you-incentivize-someone-to-increase-engagement",
      "https://werd.io/2023/metadata-standards-for-publishers",
      "https://werd.io/2023/small-communities-federated-together-using-the-same",
      "https://werd.io/2023/reading-watching-playing-using-february-2023",
      "https://werd.io/2023/i-moved-to-philadelphia",
      "https://werd.io/2023/quotenter-your-email-address-to-keep-reading",
      "https://werd.io/2023/i-need-to-do-a-better-job-of-explaining-what",
      "https://werd.io/2023/for-a-while-i-was-deeply-into",
      "https://werd.io/2023/follow-this-site-on-the-fediverse",
      "https://werd.io/2023/resetting-professional-goals",
      "https://werd.io/2023/reading-watching-playing-using-january-2023",
      "https://werd.io/2023/which-sales-enablement-tool-powers-all-those",
      "https://werd.io/2023/few-things-terrify-me-more-than-yoga",
      "https://werd.io/2023/im-worried-i-have-delayed-onset-long",
      "https://werd.io/2023/whats-the-last-book-you-read-and",
      "https://werd.io/2023/tonight",
      "https://werd.io/2023/its-only-a-podcast-if-its-open",
      "https://werd.io/2023/introducing-werdstore",
      "https://werd.io/2023/finding-that-the-cognitive-load-of-plugging",
      "https://werd.io/2023/i-think-it039s-a-fair-question-to",
      "https://werd.io/2023/organizing-my-blog",
      "https://werd.io/2023/i039m-not-sure-how-quotcentristquot-became-equated",
      "https://werd.io/2023/speaking-loudly-about-ethics-in-tech-and",
      "https://werd.io/2023/looking-beyond-copaganda",
      "https://werd.io/2023/a-web-based-science-fiction-literary-journal"
    ],
    "in-reply-to": [
      "http://me.dm/"
    ],
    "next": [
      "https://werd.io/profile/benwerd?offset=0"
    ],
    "prev": [
      "https://werd.io/profile/benwerd?offset=25"
    ]
  },
  "rel-urls": {
    "https://werd.io/gfx/logos/apple-icon-57x57.png": {
      "rels": [
        "apple-touch-icon"
      ]
    },
    "https://werd.io/gfx/logos/apple-icon-72x72.png": {
      "rels": [
        "apple-touch-icon"
      ]
    },
    "https://werd.io/gfx/logos/apple-icon-114x114.png": {
      "rels": [
        "apple-touch-icon"
      ]
    },
    "https://werd.io/gfx/logos/apple-icon-144x144.png": {
      "rels": [
        "apple-touch-icon"
      ]
    },
    "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg": {
      "rels": [
        "icon",
        "shortcut"
      ],
      "type": "image/jpg"
    },
    "https://werd.io/chrome/manifest.json": {
      "rels": [
        "manifest"
      ]
    },
    "https://purl.org/dc/elements/1.1/": {
      "rels": [
        "schema.DC"
      ]
    },
    "https://werd.io/vendor/twbs/bootstrap/dist/css/bootstrap.min.css": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://werd.io/vendor/npm-asset/bootstrap-accessibility-plugin/plugins/css/bootstrap-accessibility.css": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://werd.io/vendor/forkawesome/fork-awesome/css/fork-awesome.min.css": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://werd.io/vendor/forkawesome/fork-awesome/css/v5-compat.min.css": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://werd.io/css/1659102598/known.min.css": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://werd.io/vendor/npm-asset/bootstrap-toggle/css/bootstrap-toggle.min.css": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://werd.io/vendor/idno/mentionjs/recommended-styles.css": {
      "rels": [
        "stylesheet"
      ],
      "type": "text/css"
    },
    "https://werd.io/vendor/npm-asset/eonasdan-bootstrap-datetimepicker/build/css/bootstrap-datetimepicker.min.css": {
      "rels": [
        "stylesheet"
      ],
      "type": "text/css"
    },
    "https://werd.io/profile/benwerd?_t=rss": {
      "rels": [
        "alternate"
      ],
      "title": "Ben Werdmuller",
      "type": "application/rss+xml"
    },
    "https://werd.io/content/all?_t=rss": {
      "rels": [
        "alternate",
        "feed"
      ],
      "title": "Ben Werdmuller: all content",
      "type": "application/rss+xml"
    },
    "https://werd.io/content/all": {
      "rels": [
        "feed"
      ],
      "title": "Ben Werdmuller",
      "type": "text/html"
    },
    "https://werd.io/webmention/": {
      "rels": [
        "http://webmention.org/"
      ]
    },
    "https://withknown.superfeedr.com/": {
      "rels": [
        "hub"
      ]
    },
    "https://github.com/benwerd": {
      "rels": [
        "me"
      ]
    },
    "https://www.linkedin.com/in/benwerd": {
      "rels": [
        "me"
      ]
    },
    "https://werd.social/@ben": {
      "rels": [
        "me"
      ]
    },
    "https://19thnews.org/": {
      "rels": [
        "me"
      ]
    },
    "https://werd.io/": {
      "rels": [
        "openid.delegate"
      ]
    },
    "https://indieauth.com/openid": {
      "rels": [
        "openid.server"
      ]
    },
    "https://werd.io/indieauth/auth": {
      "rels": [
        "authorization_endpoint"
      ]
    },
    "https://werd.io/indieauth/token": {
      "rels": [
        "token_endpoint"
      ]
    },
    "https://werd.io/micropub/endpoint": {
      "rels": [
        "micropub"
      ]
    },
    "https://werd.io/2023/a-web-based-science-fiction-literary-journal": {
      "rels": [
        "canonical"
      ]
    },
    "https://werd.io/content/bookmarkedpages?_t=rss": {
      "rels": [
        "alternate",
        "feed"
      ],
      "title": "Ben Werdmuller: links",
      "type": "application/rss+xml"
    },
    "https://granary.io/url?url=https://werd.io/content/all/&input=html&output=atom&hub=https://bridgy-fed.superfeedr.com/": {
      "rels": [
        "alternate"
      ],
      "type": "application/atom+xml"
    },
    "https://werd.io/Themes/CornmarketStreet/css/default.css": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://fonts.googleapis.com/css?family=Merriweather:300,300i,400,400i,700,700i": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://werd.io/2023/if-you-incentivize-someone-to-increase-engagement": {
      "rels": [
        "permalink"
      ],
      "text": "\nMarch 9, 2023\n"
    },
    "https://werd.io/2023/metadata-standards-for-publishers": {
      "rels": [
        "permalink"
      ],
      "text": "\nMarch 8, 2023\n"
    },
    "https://werd.io/2023/small-communities-federated-together-using-the-same": {
      "rels": [
        "permalink"
      ],
      "text": "\nMarch 3, 2023\n"
    },
    "https://werd.io/2023/reading-watching-playing-using-february-2023": {
      "rels": [
        "permalink"
      ],
      "text": "\nMarch 1, 2023\n"
    },
    "https://werd.io/2023/i-moved-to-philadelphia": {
      "rels": [
        "permalink"
      ],
      "text": "\nFebruary 28, 2023\n"
    },
    "https://werd.io/2023/quotenter-your-email-address-to-keep-reading": {
      "rels": [
        "permalink"
      ],
      "text": "\nFebruary 24, 2023\n"
    },
    "https://werd.io/2023/i-need-to-do-a-better-job-of-explaining-what": {
      "rels": [
        "permalink"
      ],
      "text": "\nFebruary 9, 2023\n"
    },
    "https://werd.io/2023/for-a-while-i-was-deeply-into": {
      "rels": [
        "permalink"
      ],
      "text": "\nFebruary 5, 2023\n"
    },
    "https://werd.io/2023/follow-this-site-on-the-fediverse": {
      "rels": [
        "permalink"
      ],
      "text": "\nFebruary 4, 2023\n"
    },
    "https://werd.io/2023/resetting-professional-goals": {
      "rels": [
        "permalink"
      ],
      "text": "\nFebruary 4, 2023\n"
    },
    "http://me.dm/": {
      "rels": [
        "in-reply-to"
      ],
      "text": "http://me.dm/"
    },
    "https://werd.io/2023/reading-watching-playing-using-january-2023": {
      "rels": [
        "permalink"
      ],
      "text": "\nFebruary 1, 2023\n"
    },
    "https://werd.io/2023/which-sales-enablement-tool-powers-all-those": {
      "rels": [
        "permalink"
      ],
      "text": "\nJanuary 31, 2023\n"
    },
    "https://werd.io/2023/few-things-terrify-me-more-than-yoga": {
      "rels": [
        "permalink"
      ],
      "text": "\nJanuary 31, 2023\n"
    },
    "https://werd.io/2023/im-worried-i-have-delayed-onset-long": {
      "rels": [
        "permalink"
      ],
      "text": "\nJanuary 30, 2023\n"
    },
    "https://werd.io/2023/whats-the-last-book-you-read-and": {
      "rels": [
        "permalink"
      ],
      "text": "\nJanuary 29, 2023\n"
    },
    "https://werd.io/2023/tonight": {
      "rels": [
        "permalink"
      ],
      "text": "\n January 28, 2023\n"
    },
    "https://werd.io/2023/its-only-a-podcast-if-its-open": {
      "rels": [
        "permalink"
      ],
      "text": "\nJanuary 27, 2023\n"
    },
    "https://werd.io/2023/introducing-werdstore": {
      "rels": [
        "permalink"
      ],
      "text": "\nJanuary 26, 2023\n"
    },
    "https://werd.io/2023/finding-that-the-cognitive-load-of-plugging": {
      "rels": [
        "permalink"
      ],
      "text": "\nJanuary 25, 2023\n"
    },
    "https://werd.io/2023/i-think-it039s-a-fair-question-to": {
      "rels": [
        "permalink"
      ],
      "text": "\nJanuary 24, 2023\n"
    },
    "https://werd.io/2023/organizing-my-blog": {
      "rels": [
        "permalink"
      ],
      "text": "\nJanuary 24, 2023\n"
    },
    "https://werd.io/2023/i039m-not-sure-how-quotcentristquot-became-equated": {
      "rels": [
        "permalink"
      ],
      "text": "\nJanuary 23, 2023\n"
    },
    "https://werd.io/2023/speaking-loudly-about-ethics-in-tech-and": {
      "rels": [
        "permalink"
      ],
      "text": "\nJanuary 22, 2023\n"
    },
    "https://werd.io/2023/looking-beyond-copaganda": {
      "rels": [
        "permalink"
      ],
      "text": "\nJanuary 22, 2023\n"
    },
    "https://werd.io/profile/benwerd?offset=0": {
      "rels": [
        "next"
      ],
      "title": "Newer",
      "text": "« Newer"
    },
    "https://werd.io/profile/benwerd?offset=25": {
      "rels": [
        "prev"
      ],
      "title": "Older",
      "text": "Older »"
    },
    "https://werd.io/vendor/npm-asset/mediaelement/build/mediaelementplayer.min.css": {
      "rels": [
        "stylesheet"
      ]
    }
  }
}