{
  "items": [
    {
      "type": [
        "h-feed"
      ],
      "properties": {
        "name": [
          "Ben Werdmuller"
        ],
        "url": [
          "https://github.com/benwerd",
          "https://www.linkedin.com/in/benwerd",
          "https://werd.social/@ben",
          "https://19thnews.org/"
        ]
      },
      "children": [
        {
          "type": [
            "h-card"
          ],
          "properties": {
            "url": [
              "https://werd.io/profile/benwerd",
              "https://werd.io/profile/benwerd",
              "https://github.com/benwerd",
              "https://www.linkedin.com/in/benwerd",
              "https://werd.social/@ben",
              "https://19thnews.org/"
            ],
            "photo": [
              "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
            ],
            "profile": [
              "Ben Werdmuller"
            ],
            "name": [
              "Ben Werdmuller"
            ],
            "note": [
              {
                "html": "<div class=\"highlightedText\">\n<p><span style=\"font-weight: 400\"><br>I work and write at the intersection of technology, media, and society.<br><br>I've been a startup founder, mission-driven VC, engineer, and product lead. Right now I'm Chief Technology Officer at <a href=\"https://19thnews.org/\" style=\"color: #4c93cb\">The 19th</a>.<br><br><a href=\"https://werd.social/@ben\" style=\"color: #4c93cb\">Follow me on Mastodon</a> or <a href=\"https://newsletter.werd.io/\" style=\"color: #4c93cb\">subscribe via email</a>.<br><br></span></p>\n</div>",
                "value": "I work and write at the intersection of technology, media, and society.I've been a startup founder, mission-driven VC, engineer, and product lead. Right now I'm Chief Technology Officer at The 19th.Follow me on Mastodon or subscribe via email."
              }
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "author": [
              {
                "type": [
                  "h-card"
                ],
                "properties": {
                  "url": [
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd"
                  ],
                  "photo": [
                    "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
                  ],
                  "name": [
                    "Ben Werdmuller"
                  ]
                },
                "value": "Ben Werdmuller"
              }
            ],
            "bookmark-of": [
              "https://19thnews.org/2023/02/where-is-abortion-legal-americans-unsure-poll-shows/"
            ],
            "name": [
              "Where is abortion legal? Almost half of all Americans aren’t sure, new poll shows"
            ],
            "content": [
              {
                "html": "<p>“Half of women are unsure if medication abortion is legal in their state, and a third don’t know if they are allowed to access emergency contraceptive pills, new polling from the Kaiser Family Foundation (KFF) found.” <a href=\"https://werd.io/tag/Society\" class=\"p-category\" rel=\"tag\">#Society</a></p>",
                "value": "“Half of women are unsure if medication abortion is legal in their state, and a third don’t know if they are allowed to access emergency contraceptive pills, new polling from the Kaiser Family Foundation (KFF) found.” #Society"
              }
            ],
            "category": [
              "#Society"
            ],
            "url": [
              "https://werd.io/2023/where-is-abortion-legal-almost-half-of-all-americans-arent"
            ],
            "published": [
              "2023-02-02T04:54:15+00:00"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "author": [
              {
                "type": [
                  "h-card"
                ],
                "properties": {
                  "url": [
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd"
                  ],
                  "photo": [
                    "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
                  ],
                  "name": [
                    "Ben Werdmuller"
                  ]
                },
                "value": "Ben Werdmuller"
              }
            ],
            "bookmark-of": [
              "https://www.techdirt.com/2023/02/01/shotspotter-employees-not-only-have-the-power-to-alter-gunshot-reports-but-do-it-nearly-10-of-the-time/"
            ],
            "name": [
              "ShotSpotter Employees Not Only Have The Power To Alter Gunshot Reports, But Do It Nearly 10% Of The Time"
            ],
            "content": [
              {
                "html": "<p>“ShotSpotter’s human techs don’t just alter reports to distinguish things like a car’s backfiring from a suspected criminal’s gun firing. They also alter determinations and gunshot locations to better serve the needs of law enforcement agencies that interact with them.” <a href=\"https://werd.io/tag/Technology\" class=\"p-category\" rel=\"tag\">#Technology</a></p>",
                "value": "“ShotSpotter’s human techs don’t just alter reports to distinguish things like a car’s backfiring from a suspected criminal’s gun firing. They also alter determinations and gunshot locations to better serve the needs of law enforcement agencies that interact with them.” #Technology"
              }
            ],
            "category": [
              "#Technology"
            ],
            "url": [
              "https://werd.io/2023/shotspotter-employees-not-only-have-the-power-to-alter-gunshot"
            ],
            "published": [
              "2023-02-02T04:27:28+00:00"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "author": [
              {
                "type": [
                  "h-card"
                ],
                "properties": {
                  "url": [
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd"
                  ],
                  "photo": [
                    "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
                  ],
                  "name": [
                    "Ben Werdmuller"
                  ]
                },
                "value": "Ben Werdmuller"
              }
            ],
            "bookmark-of": [
              "https://lyz.substack.com/p/medias-money-problem"
            ],
            "name": [
              "Media's Money Problem"
            ],
            "content": [
              {
                "html": "<p>“Low pay and grueling hours mean barriers to entry that skew journalism toward a certain demographic — white and male. It’s impossible to do your best work shining light on the activities of elected officials when you make $12 an hour and those same elected officials are organizing social media campaigns to put you out of work altogether. And it’s impossible to cover the needed range and depth of stories when you are overworked and underpaid and understaffed.” <a href=\"https://werd.io/tag/Media\" class=\"p-category\" rel=\"tag\">#Media</a></p>",
                "value": "“Low pay and grueling hours mean barriers to entry that skew journalism toward a certain demographic — white and male. It’s impossible to do your best work shining light on the activities of elected officials when you make $12 an hour and those same elected officials are organizing social media campaigns to put you out of work altogether. And it’s impossible to cover the needed range and depth of stories when you are overworked and underpaid and understaffed.” #Media"
              }
            ],
            "category": [
              "#Media"
            ],
            "url": [
              "https://werd.io/2023/medias-money-problem"
            ],
            "published": [
              "2023-02-02T04:27:27+00:00"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "author": [
              {
                "type": [
                  "h-card"
                ],
                "properties": {
                  "url": [
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd"
                  ],
                  "photo": [
                    "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
                  ],
                  "name": [
                    "Ben Werdmuller"
                  ]
                },
                "value": "Ben Werdmuller"
              }
            ],
            "name": [
              "Reading, watching, playing, using: January 2023"
            ],
            "content": [
              {
                "html": "<p>This is my monthly roundup of the books, articles, and streaming media I found interesting. Here's my list for January, 2023.</p>\n<h3>Apps + Websites</h3>\n<p><a href=\"https://permissionslipcr.com/\">Permission Slip.</a> “It’s no secret that a huge number of companies are collecting, buying and selling data about us. Find out what information they collect, and take action to help protect yourself.” An app by Consumer Reports that checks to see which businesses hold data about you - and then helps you to remove it. Great stuff.</p>\n<h3>Books</h3>\n<h4>Fiction</h4>\n<p><a href=\"https://bookshop.org/a/7949/9780765389121\">The Kaiju Preservation Society, by John Scalzi.</a> This was written as catharsis after the stress and trauma of 2020-21, and reading it was equally cathartic. The author calls it a pop song of a book, and that’s exactly right. It might not be Bach but it has a good beat and I’ll be humming it for months. If you’re looking for catharsis too, you could do much, much worse.</p>\n<h4>Nonfiction</h4>\n<p><a href=\"https://bookshop.org/a/7949/9780316365215\">Rest Is Resistance: A Manifesto, by Tricia Hersey.</a> In a lot of ways best read as a kind of sermon on self-sovereignty, Rest is Resistance is a treatise on fighting back against grind culture and prioritizing your needs over the needs of the exploitative economic system you happen to live in. So many of these harmful ideas are baked into American culture; so much so that some of the pleas here might seem obvious to foreign ears. Nonetheless, we need more of this work, and I found this book to be both affirming and necessary.</p>\n<h3>Notable Articles</h3>\n<h4>AI</h4>\n<p><a href=\"https://arstechnica.com/gadgets/2023/01/the-generative-ai-revolution-has-begun-how-did-we-get-here\">The generative AI revolution has begun—how did we get here?</a> “But there was also a surprise. The OpenAI researchers discovered that in making the models bigger, they didn’t just get better at producing text. The models could learn entirely new behaviors simply by being shown new training data. In particular, the researchers discovered that GPT3 could be trained to follow instructions in plain English without having to explicitly design the model that way.” A superb introduction.</p>\n<p><a href=\"https://futurism.com/seo-spammers-google-cnet-ai-generated-articles\">SEO Spammers Are Absolutely Thrilled Google Isn't Cracking Down on CNET's AI-Generated Articles.</a>“The implication was clear: that tools like ChatGPT will now allow scofflaws to pollute the internet with near-infinite quantities of bot-generated garbage, and that CNET have now paved the way. In a way, it served as a perfect illustration of a recent warning by Stanford and Georgetown academics that AI tech could rapidly start to fill the internet with endless quantities of misinformation and profiteering.”</p>\n<p><a href=\"https://time.com/6247678/openai-chatgpt-kenya-workers\">OpenAI Used Kenyan Workers on Less Than $2 Per Hour.</a> “One Sama worker tasked with reading and labeling text for OpenAI told TIME he suffered from recurring visions after reading a graphic description of a man having sex with a dog in the presence of a young child. “That was torture,” he said. “You will read a number of statements like that all through the week. By the time it gets to Friday, you are disturbed from thinking through that picture.””</p>\n<p><a href=\"https://theredhandfiles.com/chat-gpt-what-do-you-think\">I asked Chat GPT to write a song in the style of Nick Cave.</a> “ChatGPT has no inner being, it has been nowhere, it has endured nothing, it has not had the audacity to reach beyond its limitations, and hence it doesn’t have the capacity for a shared transcendent experience, as it has no limitations from which to transcend. ChatGPT’s melancholy role is that it is destined to imitate and can never have an authentic human experience, no matter how devalued and inconsequential the human experience may in time become.”</p>\n<p><a href=\"https://bert.org/2023/01/06/chatgpt-in-dr-sbaitso\">ChatGPT in DR SBAITSO.</a> “But it got me wondering, what if we replaced the internals of DR SBAITSO with ChatGPT but kept the weird synthesized voice?”</p>\n<p><a href=\"https://theverge.com/2023/1/5/23540261/apple-text-to-speech-audiobooks-ebooks-artificial-intelligence-narrator-madison-jackson\">Apple Books quietly launches AI-narrated audiobooks.</a> “Audiobooks narrated by a text-to-speech AI are now available via Apple’s Books service, in a move with potentially huge implications for the multi-billion dollar audiobook industry. Apple describes the new “digital narration” feature on its website as making “the creation of audiobooks more accessible to all,” by reducing “the cost and complexity” of producing them for authors and publishers.” Speaking as a frequent audiobook listener: do not want.</p>\n<p><a href=\"https://peopleofcolorintech.com/articles/facial-recognition-tech-used-to-jail-black-man-for-louisiana-theft-hes-never-been-to-louisiana\">Facial Recognition Tech Used To Jail Black Man For Louisiana Theft - He's Never Been To Louisiana.</a>“There were clear physical differences between Reid and the perpetrator in the surveillance footage, said Reid’s attorney. For example, there was a 40-pound difference in body weight and Reid had a mole on his face. […] Researchers have long noted racial biases in specific facial recognition software, and we’ve seen this play out in wrongful arrests, like those of Nijeer Parks, Robert Williams, and Michael Oliver—all Black men.“</p>\n<p><a href=\"https://maggieappleton.com/ai-dark-forest\">The Expanding Dark Forest and Generative AI.</a> “Hard exiting out of this cycle requires coming up with unquestionably original thoughts and theories. It means seeing and synthesising patterns across a broad range of sources: books, blogs, cultural narratives served up by media outlets, conversations, podcasts, lived experiences, and market trends. We can observe and analyse a much fuller range of inputs than bots and generative models can.”</p>\n<h4>Business</h4>\n<p><a href=\"https://axios.com/2023/01/25/americans-increasingly-disgruntled-at-work\">Americans are increasingly disgruntled at work.</a> “Of note: Workers who were in jobs that could be done remotely, but were forced to work on-site saw an increase of 7 points in active disengagement.”</p>\n<p><a href=\"https://mcsweeneys.net/articles/macroeconomic-changes-have-made-it-impossible-for-me-to-want-to-pay-you\">Macroeconomic Changes Have Made It Impossible for Me to Want to Pay You.</a> “There’s no easy way to say this: I have made the difficult decision to lay off over six thousand of you. In the past two years, we have achieved huge wins together. But unfortunately, the macroeconomic environment has shifted in ways none of us could have foreseen, from an economy in which I did feel like paying you, to one in which I’d rather not.”</p>\n<p><a href=\"https://longform.asmartbear.com/posts/extreme-questions\">Extreme questions to trigger new, better ideas.</a> “The following prompts jostle you out of tiny thinking. Each stretches some dimension of reality to an extreme. So extreme that it is nearly nonsense. But dramatically different perspectives can reveal distinctly new ideas. An idea that would be a 60% solution in an extreme hypothetical case, could be a 2x or even a 10x idea in reality.”</p>\n<p><a href=\"https://news.stanford.edu/2022/12/05/explains-recent-tech-layoffs-worried\">What explains recent tech layoffs, and why should we be worried?</a> “Layoffs often do not cut costs, as there are many instances of laid-off employees being hired back as contractors, with companies paying the contracting firm. Layoffs often do not increase stock prices, in part because layoffs can signal that a company is having difficulty. Layoffs do not increase productivity. Layoffs do not solve what is often the underlying problem, which is often an ineffective strategy, a loss of market share, or too little revenue. Layoffs are basically a bad decision.”</p>\n<p><a href=\"https://wsj.com/articles/your-coworkers-are-less-ambitious-bosses-adjust-to-the-new-order-11672441067\">Your Coworkers Are Less Ambitious; Bosses Adjust to the New Order.</a> “Many white-collar workers say the events of the past three years have reordered their priorities and showed them what they were missing when they were spending so much time at the office. Now that normalcy is returning, even some of the workers who used to be always on and always striving say they find themselves eyeing the clock as the day winds down, saying no to overtime work or even taking pay cuts for better work-life balance.” Good!</p>\n<h4>Climate</h4>\n<p><a href=\"https://theguardian.com/environment/2023/jan/18/revealed-forest-carbon-offsets-biggest-provider-worthless-verra-aoe\">Revealed: more than 90% of rainforest carbon offsets by biggest provider are worthless, analysis shows.</a>“The research into Verra, the world’s leading carbon standard for the rapidly growing $2bn (£1.6bn) voluntary offsets market, has found that, based on analysis of a significant percentage of the projects, more than 90% of their rainforest offset credits – among the most commonly used by companies – are likely to be “phantom credits” and do not represent genuine carbon reductions.”</p>\n<p><a href=\"https://ox.ac.uk/news/2023-01-06-compound-extreme-heat-and-drought-will-hit-90-world-population-oxford-study\">Compound extreme heat and drought will hit 90% of world population.</a> “The frequency of extreme compounding hazards is projected to intensify tenfold globally due to the combined effects of warming and decreases in terrestrial water storage, under the highest emission scenario. Over 90% of the world population and GDP is projected to be exposed to increasing compounding risks in the future climate, even under the lowest emission scenario.”</p>\n<h4>Culture</h4>\n<p><a href=\"https://haleynahman.substack.com/p/132-the-contagious-visual-blandness\">The contagious visual blandness of Netflix.</a> “There are more green screens and sound stages, more CGI, more fixing-it-in-post. As these production tools have gotten slicker and cheaper and thus more widely abused, it’s not that everything looks obviously shitty or too good to feel true, it’s actually that most things look mid in the exact same way. The ubiquity of the look is making it harder to spot, and the overall result is weightless and uncanny. An endless stream of glossy vehicles that are easy to watch and easier to forget.”</p>\n<p><a href=\"https://nytimes.com/2023/01/09/dining/noma-closing-rene-redzepi.html\">Noma, Rated the World’s Best Restaurant, Is Closing Its Doors.</a> “The Copenhagen chef René Redzepi says fine dining at the highest level, with its grueling hours and intense workplace culture, has hit a breaking point: “It’s unsustainable.”” Time to close with one last audacious s’mores dish?</p>\n<h4>Democracy</h4>\n<p><a href=\"https://dailytarheel.com/article/2023/01/university-unc-leaders-blindsided-trustees-decision-professional-school\">‘I’m flabbergasted’: UNC leaders blindsided by trustees' decision on School of Civic Life and Leadership.</a>“Mimi Chapman, chairperson of faculty, said she was “flabbergasted” in response to the exclusion of faculty input in the decision, which she said she considers to be an attack on shared University governance.” From the same university that denied tenure to Nikole Hannah-Jones.</p>\n<p><a href=\"https://vox.com/policy-and-politics/23573220/adam-schiff-california-senate-race-katie-porter-dianne-feinstein\">Adam Schiff to run against Porter for Feinstein’s California Senate seat.</a> “Lee is an old-school, anti-establishment liberal with widespread name recognition in the Bay Area. Khanna has built more of a name for himself as a technocrat and wonk in the tech, antitrust, and economic realm, and co-chaired Bernie Sanders’s 2020 presidential campaign. Porter comes from the Elizabeth Warren lane of the party. But Schiff’s congressional identity has been shaped by his establishment ties.”</p>\n<p><a href=\"https://19thnews.org/2023/01/states-consider-election-worker-protections-threats-voting\">Election workers could see expanded protections as threats continue.</a> “While election workers mostly powered through a smooth process in November, the threat of political violence continues, according to election officials and voting rights advocates. Ramping up protections for election workers will be critical this year for legislatures.”</p>\n<p><a href=\"https://npr.org/2023/01/19/1149547193/secret-execution-tapes-virginia\">NPR obtained secret tapes recorded by prison staff during Virginia executions.</a> “An NPR investigation can now reveal the tapes show the prison neglected to record key evidence during what was considered one of Virginia’s worst executions, and staff appeared unprepared for some of the jobs they were tasked to do in the death chamber.”</p>\n<p><a href=\"https://theguardian.com/technology/2023/jan/17/donelan-confirms-stiffer-online-safety-measures-after-backbench-pressure\">Donelan confirms stiffer online safety measures after backbench pressure.</a> “Under a further change to the bill, video footage that shows people crossing the Channel in small boats in a “positive light” will be added to a list of illegal content that all tech platforms must proactively prevent from reaching users.” How is this internet safety?!</p>\n<p><a href=\"https://kansascity.com/news/politics-government/article271158062.html\">Missouri House faces backlash for women’s dress code rule.</a> “Democrats have excoriated Republicans on social media for legislating over what women should be required to wear. Criticism of the rule change comes at a time when the treatment of women in Missouri has received national attention.”</p>\n<p><a href=\"https://theguardian.com/politics/2023/jan/10/spot-the-difference-boris-johnson-appears-scrubbed-from-photo-posted-by-grant-shapps\">Spot the difference: Boris Johnson appears scrubbed from photo posted by Shapps.</a> “Social media users were quick to point out that Johnson appeared to have been erased from the image – an identical picture is still on the No 10 Flickr account, dated 9 June 2021, with the former PM standing between Shapps and Hart.” How very Stalin of him.</p>\n<p><a href=\"https://theguardian.com/us-news/2023/jan/06/us-police-killings-record-number-2022\">‘It never stops’: killings by US police reach record high in 2022.</a> “US law enforcement killed at least 1,176 people in 2022, making it the deadliest year on record for police violence since experts first started tracking the killings, a new data analysis reveals.”</p>\n<p><a href=\"https://19thnews.org/2023/01/trans-health-care-bills-2023-legislative-session-lgbtq\">These anti-trans bills are being prepped for 2023 state legislative sessions.</a> “Lawmakers in at least eight states used the last two months of 2022 to prefile anti-transgender bills ahead of state legislative sessions convening this month — setting up another year of statehouse battles over trans rights, while targeting health care for trans adults in new ways.”</p>\n<p><a href=\"https://fastcompany.com/90824901/secret-money-fueling-conservative-anti-esg-push\">The secret money fueling the conservative anti-ESG push.</a> “This isn’t a grassroots movement, and it isn’t coming from the financial industry, where most experts argue that considering issues like climate is prudent for investors. “I think it’s motivated by politics,” says Witold Henisz, a professor at the University of Pennsylvania’s Wharton School. “They think it’s a political wedge issue. You can see some of the same patterns of money moving into the anti-ESG movement that pushed back against climate science in the aughts.””</p>\n<p><a href=\"https://nytimes.com/2023/01/03/opinion/george-santos-congress.html\">A Con Man Is Succeeding Me in Congress Today.</a> “But for now, there is no getting around the fact that Mr. Santos’s con game is a manifestation of a growing political phenomenon of saying or doing anything, with no automatic consequences. Whether it be far-right election deniers, personal attacks that call for violence against opponents, claims of false-flag mass shootings, extremists spouting the first thing that comes to mind and even one politician saying he could “shoot somebody” on Fifth Avenue and still not lose supporters.”</p>\n<h4>Health</h4>\n<p><a href=\"https://nature.com/articles/d41586-023-00118-w\">How our microbiome is shaped by family, friends and even neighbours.</a> “People living in the same household share more than just a roof. Be they family or flatmate, housemates tend to have the same microbes colonizing their bodies, and the longer the cohabitation, the more similar these microbiomes become. The conclusion raises the possibility that diseases linked to microbiome dysfunction, including cancer, diabetes and obesity, could be partly transmissible.”</p>\n<p><a href=\"https://19thnews.org/2023/01/gas-stove-asthma-health-concerns-public-housing\">Gas stove health concerns add urgency to calls for changes in public housing.</a> “Alarmingly, in a focus group conducted by the Public Health Law Center in Chicago, nearly 100 percent of public housing participants said they have also turned on their gas stoves to stay warm on cold days, which is an added danger for residents.”</p>\n<p><a href=\"https://mdpi.com/1660-4601/20/1/75\">Population Attributable Fraction of Gas Stoves and Childhood Asthma in the United States.</a> “The proportion of childhood asthma that could be theoretically prevented if gas stove use was not present (e.g., state-specific PAFs) varied by state (Illinois = 21.1%; California = 20.1%; New York = 18.8%; Massachusetts = 15.4%; Pennsylvania = 13.5%). Our results quantify the US public health burden attributed to gas stove use and childhood asthma.”</p>\n<p><a href=\"https://consumerreports.org/health/food-safety/lead-and-cadmium-in-dark-chocolate-a8480295550\">Lead and Cadmium Could Be in Your Dark Chocolate.</a> “The chocolate industry has been grappling with ways to lower those levels. To see how much of a risk these favorite treats pose, Consumer Reports scientists recently measured the amount of heavy metals in 28 dark chocolate bars. They detected cadmium and lead in all of them.”</p>\n<h4>Media</h4>\n<p><a href=\"https://washingtonpost.com/opinions/2023/01/30/newsrooms-news-reporting-objectivity-diversity\">Newsrooms that move beyond ‘objectivity’ can build trust.</a> “Newer, nonprofit news organizations often have launched with stated missions. The national digital news site the 19th, for example, aims to “elevate voices of women, people of color, and the LGBTQ+ community.””</p>\n<p><a href=\"https://19thnews.org/2023/01/three-years-of-the-19th-30-cities-54-employees-and-news-that-represents\">Three years of The 19th: 30 cities, 54 employees and news that represents.</a> “In the last year alone, we’ve grown at an astronomical pace: from 32 employees to 54, from a news organization that pledged to be the most representative in the nation to one where 65 percent of our staff is non-White, 30 percent are LGBTQ+ and 19 percent are living with disabilities. We’re now on the ground in more than 30 U.S. cities.” I’m so proud to be a part of this team.</p>\n<p><a href=\"https://annehelen.substack.com/p/layoff-brain\">Layoff Brain.</a> “Layoffs are the worst for the people who lose their job, but there’s a ripple effect on those who keep them — particularly if they keep them over the course of multiple layoffs. It’s a curious mix of guilt, relief, trepidation, and anger. Are you supposed to be grateful to the company whose primary leadership strategy seems to be keeping its workers trapped in fear? How do you trust your manager’s assurances of security further than the end of the next pay period?”</p>\n<p><a href=\"https://rollingstone.com/politics/politics-features/donald-trump-ditch-truth-social-for-twitter-facebook-1234665307\">Trump Looks to Abandon Truth Social, His Own Social Media Platform.</a> “Since late last year, former President Trump has informed several people close to him that he doesn’t want to re-up the exclusivity agreement with his social media company, Truth Social, two sources familiar with the matter tell Rolling Stone. “There’s not going to be a need for that,” is how one of the sources recalls Trump describing his soon-to-expire contractual obligation. […] Trump and some of his close allies have already brainstormed about him tweeting that, even though Big Tech tried to “silence” him over his lies about a “rigged election,” he was now back to make “the Left” miserable.”</p>\n<p><a href=\"https://techdirt.com/2023/01/04/journalists-and-others-should-leave-twitter-heres-how-they-can-get-started\">Journalists (And Others) Should Leave Twitter. Here’s How They Can Get Started.</a> “Many journalism organizations and public entities, such as local governments, believe Twitter is essential because it’s a place people know they can turn to when there’s big news — and find information from “verified accounts” that (barring a hack) ensure the source is who it’s claiming to be. So, they tell themselves, they have to stick around. This isn’t just short-sighted. It’s foolish.”</p>\n<p><a href=\"https://whatsnewinpublishing.com/publishers-you-should-start-using-mastodon-10-reasons-why\">Publishers, you should start using Mastodon: 10 reasons why.</a> “There are plenty of articles about why you should leave Twitter (or at least, cross-post to Mastodon) for ethical, safety, political, social, and security/privacy reasons. This post won’t do any of those things. Instead, all my arguments are about why it’s smart from a pure business, marketing, and influence perspective to use Mastodon as soon as possible.”</p>\n<h4>Science</h4>\n<p><a href=\"https://nytimes.com/2023/01/07/science/honeybee-vaccine.html\">U.S.D.A. Approves First Vaccine for Honeybees.</a> ““There are millions of beehives all over the world, and they don’t have a good health care system compared to other animals,” she said. “Now we have the tools to improve their resistance against diseases.”” Vaccines for bees!</p>\n<h4>Society</h4>\n<p><a href=\"https://19thnews.org/2023/01/a-vast-majority-of-americans-are-concerned-people-could-face-criminal-penalties-for-abortion\">A vast majority of Americans are concerned people could face criminal penalties for abortion.</a> “The data found that 80 percent of Americans are concerned that domestic abuse survivors could be reported by their abuser for getting an abortion. Eighty percent of people are also concerned that law enforcement could investigate people who have miscarriages or stillbirths if they are suspected of getting an abortion. The poll also found that 75 percent of people are concerned that people who get an abortion could be charged with a felony or go to jail.”</p>\n<p><a href=\"https://vice.com/en/article/z34ane/neo-nazi-homeschool-ohio\">Inside a US Neo-Nazi Homeschool Network With Thousands of Members.</a> “Since the group began in October 2021 it has openly embraced Nazi ideology and promoted white supremacy, while proudly discouraging parents from letting their white children play with or have any contact with people of any other race. Admins and members use racist, homophobic, and antisemitic slurs without shame, and quote Hitler and other Nazi leaders daily in a channel open to the public.”</p>\n<p><a href=\"https://aeon.co/essays/the-tragedy-of-the-commons-is-a-false-and-dangerous-myth\">The tragedy of the commons is a false and dangerous myth.</a> “Even before Hardin’s ‘The Tragedy of the Commons’ was published, however, the young political scientist Elinor Ostrom had proven him wrong. While Hardin speculated that the tragedy of the commons could be avoided only through total privatisation or total government control, Ostrom had witnessed groundwater users near her native Los Angeles hammer out a system for sharing their coveted resource.”</p>\n<p><a href=\"https://theconversation.com/pain-of-police-killings-ripples-outward-to-traumatize-black-people-and-communities-across-us-159624\">Pain of police killings ripples outward to traumatize Black people and communities across US.</a> “Evidence shows that many Black Americans across the U.S. experience police killings of other Black people as traumatic events, and that this trauma diminishes the ability of Black communities to thrive.” Sobering statistics.</p>\n<p><a href=\"https://theonion.com/u-s-officials-announce-plans-to-continue-pretending-br-1850036671\">U.S. Officials Announce Plans To Continue Pretending Brutal State-Sponsored Violence Not Supposed To Happen.</a> ““Today, as we deal with the fallout from the death of Tyre Nichols, myself and the highest officials in the American government pledge to keep acting like we don’t want our highly militarized police force to kill innocent civilians every day,” said President Joe Biden at a White House press conference, adding that he and his fellow elected officials would pretend to gasp, pray, and put on a big emotional show every time law enforcement carried out the exact murders against its own citizens they had both tacitly and publicly approved.”</p>\n<p><a href=\"https://epi.org/publication/unionization-2022\">Unionization increased by 200,000 in 2022: Tens of millions more wanted to join a union, but couldn’t .</a>“One crucial way we can promote a more prosperous, equitable economy is to dismantle existing barriers to union organizing and collective bargaining. It is urgent that policymakers enact reforms at the federal and state levels to protect and support workers’ right to unionize.”</p>\n<p><a href=\"https://againstmars.substack.com/p/why-elon-musk-and-the-billionaire\">Why Elon Musk and the billionaire space bros want to put people in space cages forever.</a> “That said, I disagree with Mr. Wanjek: it requires much more than libertarian naiveté to colonize space. Parking humans in containment shelters, on Mars or elsewhere, so as to breed them and select them like cattle — that requires malice.”</p>\n<p><a href=\"https://abcnews.go.com/US/2023-doomsday-clock-announcement-expect/story?id=96495463\">2023 'Doomsday Clock' moved 10 seconds closer to catastrophe.</a> “Scientists revealed on Tuesday that the “Doomsday Clock” has been moved up to 90 seconds before midnight -- the closest humanity has ever been to armageddon.” But everything else is going so well.</p>\n<p><a href=\"https://19thnews.org/2023/01/march-for-life-post-roe-anniversary-50-abortion-federal\">Post-Roe March for Life showed anti-abortion activists are far from done.</a> “The next steps for the movement were illustrated by the march’s new route this year: Instead of ending at the steps of the Supreme Court as they have for nearly five decades, activists ended their march at the U.S. Capitol — underscoring their continued push for Congress to enact a federal abortion ban.”</p>\n<p><a href=\"https://19thnews.org/2023/01/lgbtq-mental-health-youth-laws\">Anti-LGBTQ+ rhetoric and state laws are hurting youth mental health, poll shows.</a> “Seventy-one percent of the 716 surveyed LGBTQ+ youth, ranging from teenagers to young adults who took the online poll last fall, said that debates around state laws restricting the rights of LGBTQ+ young people had negatively impacted their mental health. Twenty-seven percent characterized the negative effect as severe.”</p>\n<p><a href=\"https://jessicawildfire.substack.com/p/we-convinced-our-school-to-bring\">We Convinced Our School to Bring Back Masks.</a> “As parents, it’s worth remembering that the persistent ones usually get what they want. Look at the anti-maskers. They didn’t give up. They kept pushing until they got their way. We don’t need to be that aggressive, but I think a lot of us get discouraged and give up. The anti-masker types never give up. They never seem to get tired. So if we want to beat them and win over middle earth, we have to match their energy.”</p>\n<p><a href=\"https://expo.se/2023/01/elon-musk-funded-nonprofit-run-mit-professor-offered-finance-swedish-pro-nazi-group\">Elon Musk-funded nonprofit run by MIT professor offered to finance Swedish pro-nazi group.</a> “The US-based and Elon Musk-funded Future of Life Institute, run by MIT professor and Swedish citizen Max Tegmark, offered a grant of $100,000 to right-wing extremists in Sweden, an Expo investigation reveals.”</p>\n<p><a href=\"https://wsj.com/articles/subway-mta-bart-public-transit-new-york-boston-san-francisco-11673198418\">Public Transit Goes Off the Rails With Fewer Riders, Dwindling Cash, Rising Crime.</a> “Several of the nation’s largest urban mass-transit systems are at a crossroads, with ridership still depressed three years into the pandemic and federal aid running out.”</p>\n<h4>Technology</h4>\n<p><a href=\"https://platformer.news/p/instagrams-co-founders-are-mounting\">Instagram's co-founders are mounting a comeback.</a> “TikTok’s innovation was to show you stuff using only algorithmic predictions, regardless of who your friends are or who you followed. It soon became the most downloaded app in the world. Artifact represents an effort to do the same thing, but for text.” Potentially an interesting app, based on an interesting insight.</p>\n<p><a href=\"https://washingtonpost.com/technology/2023/01/27/diversity-layoffs-meta-facebook\">Women, minorities lose ground in tech layoffs.</a> “The technology industry has long struggled to recruit a diverse workforce, but the recent spate of cuts by Silicon Valley companies has hit women particularly hard, according to recently published analyses of demographic data from the layoffs. Women and some minorities were particularly vulnerable to layoffs because they were newer to their jobs and occupied roles that companies were less interested in retaining, experts said.”</p>\n<p><a href=\"https://npr.org/2023/01/24/1151055903/doj-files-second-antitrust-suit-against-google-seeks-to-break-up-its-ad-business\">U.S. sues Google for allegedly breaking antitrust laws with its ad business.</a> ““For 15 years, Google has pursued a course of anticompetitive conduct that has allowed it to halt the rise of rival technologies, manipulate auction mechanics, to insulate itself from competition, and force advertisers and publishers to use its tools,” said Attorney General Merrick Garland at a press conference announcing the lawsuit.”</p>\n<p><a href=\"https://francine.substack.com/p/warning-do-not-other-me-because-of\">Warning: Do not “other” me because of my age.</a> “But I hate this new attention lavished on aging. Why? Because it “others” me. It puts me in a separate category from the rest of the world, and that is not how I think, feel, act, or want to be seen. All of a sudden I am not smart, pretty, successful, talented, or part of the family. I am “old.” I am somebody’s responsibility. I have to be told when to stop driving, and my checkbook can be taken away. I am a candidate for Senior Living (banishment to a place full of other old people).”</p>\n<p><a href=\"https://engadget.com/tweetbots-twitter-client-shutdown-195533095.html\">Tapbot shuts down Tweetbot as it pivots to Mastodon.</a> “Now that Twitter has confirmed it’s banning third-party clients, some of the most prominent alternatives are going away. Tapbots has shut down work on Tweetbot, one of the more popular iOS apps, as Twitter rendered it non-functional “in a blink of an eye.” The developer is instead pivoting to Ivory, an app for the open social platform Mastodon. While it’s limited to an invitation-only test for now, Tapbots hopes to make the software “better than Tweetbot ever could be.”” Likewise, Mastodon will be better than Twitter ever could be.</p>\n<p><a href=\"https://dailydot.com/debug/no-fly-list-us-tsa-unprotected-server-commuteair\">U.S. No Fly List Left on Unprotected Airline Server.</a> “Analysis of the server resulted in the discovery of a text file named “NoFly.csv,” a reference to the subset of individuals in the Terrorist Screening Database who have been barred from air travel due to having suspected or known ties to terrorist organizations.”</p>\n<p><a href=\"https://ft.com/content/99452cdd-5532-4c6a-85e6-733c2fde3e9c\">‘Passion economy’ platforms cut costs in tech downturn.</a> ““People are making choices,” said Rebecca McGrath, an internet analyst at Mintel. “Unless you’re very loyal to a creator, that’ll be one of the obvious things to drop.””</p>\n<p><a href=\"https://reuters.com/technology/tesla-video-promoting-self-driving-was-staged-engineer-testifies-2023-01-17\">Tesla video promoting self-driving was staged, engineer testifies.</a> “A 2016 video that Tesla used to promote its self-driving technology was staged to show capabilities like stopping at a red light and accelerating at a green light that the system did not have, according to testimony by a senior engineer.” They’re fun cars to drive, but don’t let them drive themselves.</p>\n<p><a href=\"https://blog.medium.com/medium-embraces-mastodon-19dcb873eb11\">Medium embraces Mastodon.</a> “Today, Medium is launching a Mastodon instance at <a class=\"autolink\" href=\"http://me.dm/\"></a><a href=\"http://me.dm/\" target=\"_blank\">http://<wbr></wbr>me.dm/<wbr></wbr></a> to help our authors, publications and readers find a home in the fediverse. Mastodon is an emerging force for good in social media and we are excited to join this community.” Hell yeah.</p>\n<p><a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4296306\">The Effects of Online Content Moderation: Evidence from President Trump's Account Deletion.</a> “The toxicity of tweets sent by Trump followers relative to a representative sample of US Twitter users dropped by around 25% after the account deletion. Second, this effect is larger for pro-Trump tweets and Republican users. Third, Trump’s suspension reduced the total number of tweets, suggesting a drop in engagement. Fourth, we find effects on individuals who did not follow Trump directly but followed somebody that did, suggesting network spillovers.”</p>\n<p><a href=\"https://pxlnv.com/linklog/intercept-tesla-crash\">The Intercept Obtains Surveillance Footage of Tesla Crash on Bay Bridge.</a> “These semi-autonomous systems are playing the same sort of trick as ChatGPT: they offer a convincing but shallow impression of a competent driverless car without any broader context to fall back on.”</p>\n<p><a href=\"https://blog.nativesintech.org/apache-appropriation\">Apache® Appropriation.</a> “We urge The Apache® Software Foundation to take the necessary steps needed to express the ally-ship they promote so deeply on their website, to act in accordance with their own code of conduct, to “be careful in the words that [they] choose”, and change their name.” +1.</p>\n<p><a href=\"https://vice.com/en/article/v7dw8x/san-francisco-police-are-using-driverless-cars-as-mobile-surveillance-cameras\">San Francisco Police Are Using Driverless Cars as Mobile Surveillance Cameras.</a> “Law enforcement agencies already have access to automated license plate readers, geofence warrants, Ring Doorbell footage, as well as the ability to purchase location data. This practice will extend the reach of an already pervasive web of surveillance.”</p>\n<p><a href=\"https://apnews.com/article/social-media-seattle-lawsuits-mental-health-965a8f373e3bfed8157571912cc3b542\">Seattle schools sue tech giants over social media harm.</a> “[The lawsuit] blames [social media giants] for worsening mental health and behavioral disorders including anxiety, depression, disordered eating and cyberbullying; making it more difficult to educate students; and forcing schools to take steps such as hiring additional mental health professionals, developing lesson plans about the effects of social media, and providing additional training to teachers.”</p>\n<p><a href=\"https://nytimes.com/2023/01/04/us/seattle-fraud-office-space.html\">‘Office Space’ Inspired Engineer’s Theft Scheme, Police Say.</a> “A software engineer siphoned more than $300,000 from his employer by introducing what prosecutors called a “series of malicious software edits” that wired money into his personal account. If the scheme sounds like the plot of “Office Space,” that’s because the authorities said it was partly inspired by the movie.”</p>\n<p><a href=\"https://reb00ted.org/tech/20230124-activitystreams-model\">Activity Streams graphical model.</a> “So I did a bit of drawing just to make it clearer (for myself) what kind of data can be shipped around in the Fediverse. To be clear, this is only a small part of the overall stack, but an important one.” Useful work!</p>\n<h4>Twitter</h4>\n<p><a href=\"https://techcrunch.com/2023/01/25/elon-musk-twitter-antisemitic-hate-speech-lawsuit-germany\">Elon Musk’s Twitter hit with holocaust denial hate speech lawsuit in Germany.</a> “Current studies prove that 84% of posts containing antisemitic hate speech were not reviewed by social media platforms, as shown in a study by the Center for Countering Digital Hate. Which means that Twitter knows Jews are being publicly attacked on the platform every day and that antisemitism is becoming a normality in our society. And that the platform’s response is by no means adequate.”</p>\n<p><a href=\"https://daringfireball.net/linked/2023/01/14/information-twitter-slack-confirmation\">Daring Fireball: If You Needed Any More Confirmation, Internal Slack Messages at Twitter Show That Cutting Off Third-Party Clients Was 'Intentional'.</a> “Twitter can of course do what it wants, and Musk owns Twitter so he can do what he wants. But pulling the plug on these clients and ghosting everyone on communications about it is so absurdly disrespectful. Zero respect for the users for those apps, zero respect for the developers behind them — many of whom had been building on the Twitter platform for 10-15 years. Just a clown show.”</p>\n<p><a href=\"https://natematias.medium.com/how-twitter-misleads-us-about-how-many-people-have-left-and-what-to-do-about-it-bba484b6fed6\">How Twitter misleads us about how many people have left — and what to do about it.</a> “To outside observers, it can seem like Twitter users are continuing as before, seemingly unaware of the millions of people who have left. “You left Twitter?” a friend recently remarked, “I hadn’t noticed.” Yet many of the accounts I follow haven’t tweeted in ages, and roughly 15% of them have already set up accounts on Mastodon.” Some great tips in this piece.</p>",
                "value": "This is my monthly roundup of the books, articles, and streaming media I found interesting. Here's my list for January, 2023.Apps + WebsitesPermission Slip. “It’s no secret that a huge number of companies are collecting, buying and selling data about us. Find out what information they collect, and take action to help protect yourself.” An app by Consumer Reports that checks to see which businesses hold data about you - and then helps you to remove it. Great stuff.BooksFictionThe Kaiju Preservation Society, by John Scalzi. This was written as catharsis after the stress and trauma of 2020-21, and reading it was equally cathartic. The author calls it a pop song of a book, and that’s exactly right. It might not be Bach but it has a good beat and I’ll be humming it for months. If you’re looking for catharsis too, you could do much, much worse.NonfictionRest Is Resistance: A Manifesto, by Tricia Hersey. In a lot of ways best read as a kind of sermon on self-sovereignty, Rest is Resistance is a treatise on fighting back against grind culture and prioritizing your needs over the needs of the exploitative economic system you happen to live in. So many of these harmful ideas are baked into American culture; so much so that some of the pleas here might seem obvious to foreign ears. Nonetheless, we need more of this work, and I found this book to be both affirming and necessary.Notable ArticlesAIThe generative AI revolution has begun—how did we get here? “But there was also a surprise. The OpenAI researchers discovered that in making the models bigger, they didn’t just get better at producing text. The models could learn entirely new behaviors simply by being shown new training data. In particular, the researchers discovered that GPT3 could be trained to follow instructions in plain English without having to explicitly design the model that way.” A superb introduction.SEO Spammers Are Absolutely Thrilled Google Isn't Cracking Down on CNET's AI-Generated Articles.“The implication was clear: that tools like ChatGPT will now allow scofflaws to pollute the internet with near-infinite quantities of bot-generated garbage, and that CNET have now paved the way. In a way, it served as a perfect illustration of a recent warning by Stanford and Georgetown academics that AI tech could rapidly start to fill the internet with endless quantities of misinformation and profiteering.”OpenAI Used Kenyan Workers on Less Than $2 Per Hour. “One Sama worker tasked with reading and labeling text for OpenAI told TIME he suffered from recurring visions after reading a graphic description of a man having sex with a dog in the presence of a young child. “That was torture,” he said. “You will read a number of statements like that all through the week. By the time it gets to Friday, you are disturbed from thinking through that picture.””I asked Chat GPT to write a song in the style of Nick Cave. “ChatGPT has no inner being, it has been nowhere, it has endured nothing, it has not had the audacity to reach beyond its limitations, and hence it doesn’t have the capacity for a shared transcendent experience, as it has no limitations from which to transcend. ChatGPT’s melancholy role is that it is destined to imitate and can never have an authentic human experience, no matter how devalued and inconsequential the human experience may in time become.”ChatGPT in DR SBAITSO. “But it got me wondering, what if we replaced the internals of DR SBAITSO with ChatGPT but kept the weird synthesized voice?”Apple Books quietly launches AI-narrated audiobooks. “Audiobooks narrated by a text-to-speech AI are now available via Apple’s Books service, in a move with potentially huge implications for the multi-billion dollar audiobook industry. Apple describes the new “digital narration” feature on its website as making “the creation of audiobooks more accessible to all,” by reducing “the cost and complexity” of producing them for authors and publishers.” Speaking as a frequent audiobook listener: do not want.Facial Recognition Tech Used To Jail Black Man For Louisiana Theft - He's Never Been To Louisiana.“There were clear physical differences between Reid and the perpetrator in the surveillance footage, said Reid’s attorney. For example, there was a 40-pound difference in body weight and Reid had a mole on his face. […] Researchers have long noted racial biases in specific facial recognition software, and we’ve seen this play out in wrongful arrests, like those of Nijeer Parks, Robert Williams, and Michael Oliver—all Black men.“The Expanding Dark Forest and Generative AI. “Hard exiting out of this cycle requires coming up with unquestionably original thoughts and theories. It means seeing and synthesising patterns across a broad range of sources: books, blogs, cultural narratives served up by media outlets, conversations, podcasts, lived experiences, and market trends. We can observe and analyse a much fuller range of inputs than bots and generative models can.”BusinessAmericans are increasingly disgruntled at work. “Of note: Workers who were in jobs that could be done remotely, but were forced to work on-site saw an increase of 7 points in active disengagement.”Macroeconomic Changes Have Made It Impossible for Me to Want to Pay You. “There’s no easy way to say this: I have made the difficult decision to lay off over six thousand of you. In the past two years, we have achieved huge wins together. But unfortunately, the macroeconomic environment has shifted in ways none of us could have foreseen, from an economy in which I did feel like paying you, to one in which I’d rather not.”Extreme questions to trigger new, better ideas. “The following prompts jostle you out of tiny thinking. Each stretches some dimension of reality to an extreme. So extreme that it is nearly nonsense. But dramatically different perspectives can reveal distinctly new ideas. An idea that would be a 60% solution in an extreme hypothetical case, could be a 2x or even a 10x idea in reality.”What explains recent tech layoffs, and why should we be worried? “Layoffs often do not cut costs, as there are many instances of laid-off employees being hired back as contractors, with companies paying the contracting firm. Layoffs often do not increase stock prices, in part because layoffs can signal that a company is having difficulty. Layoffs do not increase productivity. Layoffs do not solve what is often the underlying problem, which is often an ineffective strategy, a loss of market share, or too little revenue. Layoffs are basically a bad decision.”Your Coworkers Are Less Ambitious; Bosses Adjust to the New Order. “Many white-collar workers say the events of the past three years have reordered their priorities and showed them what they were missing when they were spending so much time at the office. Now that normalcy is returning, even some of the workers who used to be always on and always striving say they find themselves eyeing the clock as the day winds down, saying no to overtime work or even taking pay cuts for better work-life balance.” Good!ClimateRevealed: more than 90% of rainforest carbon offsets by biggest provider are worthless, analysis shows.“The research into Verra, the world’s leading carbon standard for the rapidly growing $2bn (£1.6bn) voluntary offsets market, has found that, based on analysis of a significant percentage of the projects, more than 90% of their rainforest offset credits – among the most commonly used by companies – are likely to be “phantom credits” and do not represent genuine carbon reductions.”Compound extreme heat and drought will hit 90% of world population. “The frequency of extreme compounding hazards is projected to intensify tenfold globally due to the combined effects of warming and decreases in terrestrial water storage, under the highest emission scenario. Over 90% of the world population and GDP is projected to be exposed to increasing compounding risks in the future climate, even under the lowest emission scenario.”CultureThe contagious visual blandness of Netflix. “There are more green screens and sound stages, more CGI, more fixing-it-in-post. As these production tools have gotten slicker and cheaper and thus more widely abused, it’s not that everything looks obviously shitty or too good to feel true, it’s actually that most things look mid in the exact same way. The ubiquity of the look is making it harder to spot, and the overall result is weightless and uncanny. An endless stream of glossy vehicles that are easy to watch and easier to forget.”Noma, Rated the World’s Best Restaurant, Is Closing Its Doors. “The Copenhagen chef René Redzepi says fine dining at the highest level, with its grueling hours and intense workplace culture, has hit a breaking point: “It’s unsustainable.”” Time to close with one last audacious s’mores dish?Democracy‘I’m flabbergasted’: UNC leaders blindsided by trustees' decision on School of Civic Life and Leadership.“Mimi Chapman, chairperson of faculty, said she was “flabbergasted” in response to the exclusion of faculty input in the decision, which she said she considers to be an attack on shared University governance.” From the same university that denied tenure to Nikole Hannah-Jones.Adam Schiff to run against Porter for Feinstein’s California Senate seat. “Lee is an old-school, anti-establishment liberal with widespread name recognition in the Bay Area. Khanna has built more of a name for himself as a technocrat and wonk in the tech, antitrust, and economic realm, and co-chaired Bernie Sanders’s 2020 presidential campaign. Porter comes from the Elizabeth Warren lane of the party. But Schiff’s congressional identity has been shaped by his establishment ties.”Election workers could see expanded protections as threats continue. “While election workers mostly powered through a smooth process in November, the threat of political violence continues, according to election officials and voting rights advocates. Ramping up protections for election workers will be critical this year for legislatures.”NPR obtained secret tapes recorded by prison staff during Virginia executions. “An NPR investigation can now reveal the tapes show the prison neglected to record key evidence during what was considered one of Virginia’s worst executions, and staff appeared unprepared for some of the jobs they were tasked to do in the death chamber.”Donelan confirms stiffer online safety measures after backbench pressure. “Under a further change to the bill, video footage that shows people crossing the Channel in small boats in a “positive light” will be added to a list of illegal content that all tech platforms must proactively prevent from reaching users.” How is this internet safety?!Missouri House faces backlash for women’s dress code rule. “Democrats have excoriated Republicans on social media for legislating over what women should be required to wear. Criticism of the rule change comes at a time when the treatment of women in Missouri has received national attention.”Spot the difference: Boris Johnson appears scrubbed from photo posted by Shapps. “Social media users were quick to point out that Johnson appeared to have been erased from the image – an identical picture is still on the No 10 Flickr account, dated 9 June 2021, with the former PM standing between Shapps and Hart.” How very Stalin of him.‘It never stops’: killings by US police reach record high in 2022. “US law enforcement killed at least 1,176 people in 2022, making it the deadliest year on record for police violence since experts first started tracking the killings, a new data analysis reveals.”These anti-trans bills are being prepped for 2023 state legislative sessions. “Lawmakers in at least eight states used the last two months of 2022 to prefile anti-transgender bills ahead of state legislative sessions convening this month — setting up another year of statehouse battles over trans rights, while targeting health care for trans adults in new ways.”The secret money fueling the conservative anti-ESG push. “This isn’t a grassroots movement, and it isn’t coming from the financial industry, where most experts argue that considering issues like climate is prudent for investors. “I think it’s motivated by politics,” says Witold Henisz, a professor at the University of Pennsylvania’s Wharton School. “They think it’s a political wedge issue. You can see some of the same patterns of money moving into the anti-ESG movement that pushed back against climate science in the aughts.””A Con Man Is Succeeding Me in Congress Today. “But for now, there is no getting around the fact that Mr. Santos’s con game is a manifestation of a growing political phenomenon of saying or doing anything, with no automatic consequences. Whether it be far-right election deniers, personal attacks that call for violence against opponents, claims of false-flag mass shootings, extremists spouting the first thing that comes to mind and even one politician saying he could “shoot somebody” on Fifth Avenue and still not lose supporters.”HealthHow our microbiome is shaped by family, friends and even neighbours. “People living in the same household share more than just a roof. Be they family or flatmate, housemates tend to have the same microbes colonizing their bodies, and the longer the cohabitation, the more similar these microbiomes become. The conclusion raises the possibility that diseases linked to microbiome dysfunction, including cancer, diabetes and obesity, could be partly transmissible.”Gas stove health concerns add urgency to calls for changes in public housing. “Alarmingly, in a focus group conducted by the Public Health Law Center in Chicago, nearly 100 percent of public housing participants said they have also turned on their gas stoves to stay warm on cold days, which is an added danger for residents.”Population Attributable Fraction of Gas Stoves and Childhood Asthma in the United States. “The proportion of childhood asthma that could be theoretically prevented if gas stove use was not present (e.g., state-specific PAFs) varied by state (Illinois = 21.1%; California = 20.1%; New York = 18.8%; Massachusetts = 15.4%; Pennsylvania = 13.5%). Our results quantify the US public health burden attributed to gas stove use and childhood asthma.”Lead and Cadmium Could Be in Your Dark Chocolate. “The chocolate industry has been grappling with ways to lower those levels. To see how much of a risk these favorite treats pose, Consumer Reports scientists recently measured the amount of heavy metals in 28 dark chocolate bars. They detected cadmium and lead in all of them.”MediaNewsrooms that move beyond ‘objectivity’ can build trust. “Newer, nonprofit news organizations often have launched with stated missions. The national digital news site the 19th, for example, aims to “elevate voices of women, people of color, and the LGBTQ+ community.””Three years of The 19th: 30 cities, 54 employees and news that represents. “In the last year alone, we’ve grown at an astronomical pace: from 32 employees to 54, from a news organization that pledged to be the most representative in the nation to one where 65 percent of our staff is non-White, 30 percent are LGBTQ+ and 19 percent are living with disabilities. We’re now on the ground in more than 30 U.S. cities.” I’m so proud to be a part of this team.Layoff Brain. “Layoffs are the worst for the people who lose their job, but there’s a ripple effect on those who keep them — particularly if they keep them over the course of multiple layoffs. It’s a curious mix of guilt, relief, trepidation, and anger. Are you supposed to be grateful to the company whose primary leadership strategy seems to be keeping its workers trapped in fear? How do you trust your manager’s assurances of security further than the end of the next pay period?”Trump Looks to Abandon Truth Social, His Own Social Media Platform. “Since late last year, former President Trump has informed several people close to him that he doesn’t want to re-up the exclusivity agreement with his social media company, Truth Social, two sources familiar with the matter tell Rolling Stone. “There’s not going to be a need for that,” is how one of the sources recalls Trump describing his soon-to-expire contractual obligation. […] Trump and some of his close allies have already brainstormed about him tweeting that, even though Big Tech tried to “silence” him over his lies about a “rigged election,” he was now back to make “the Left” miserable.”Journalists (And Others) Should Leave Twitter. Here’s How They Can Get Started. “Many journalism organizations and public entities, such as local governments, believe Twitter is essential because it’s a place people know they can turn to when there’s big news — and find information from “verified accounts” that (barring a hack) ensure the source is who it’s claiming to be. So, they tell themselves, they have to stick around. This isn’t just short-sighted. It’s foolish.”Publishers, you should start using Mastodon: 10 reasons why. “There are plenty of articles about why you should leave Twitter (or at least, cross-post to Mastodon) for ethical, safety, political, social, and security/privacy reasons. This post won’t do any of those things. Instead, all my arguments are about why it’s smart from a pure business, marketing, and influence perspective to use Mastodon as soon as possible.”ScienceU.S.D.A. Approves First Vaccine for Honeybees. ““There are millions of beehives all over the world, and they don’t have a good health care system compared to other animals,” she said. “Now we have the tools to improve their resistance against diseases.”” Vaccines for bees!SocietyA vast majority of Americans are concerned people could face criminal penalties for abortion. “The data found that 80 percent of Americans are concerned that domestic abuse survivors could be reported by their abuser for getting an abortion. Eighty percent of people are also concerned that law enforcement could investigate people who have miscarriages or stillbirths if they are suspected of getting an abortion. The poll also found that 75 percent of people are concerned that people who get an abortion could be charged with a felony or go to jail.”Inside a US Neo-Nazi Homeschool Network With Thousands of Members. “Since the group began in October 2021 it has openly embraced Nazi ideology and promoted white supremacy, while proudly discouraging parents from letting their white children play with or have any contact with people of any other race. Admins and members use racist, homophobic, and antisemitic slurs without shame, and quote Hitler and other Nazi leaders daily in a channel open to the public.”The tragedy of the commons is a false and dangerous myth. “Even before Hardin’s ‘The Tragedy of the Commons’ was published, however, the young political scientist Elinor Ostrom had proven him wrong. While Hardin speculated that the tragedy of the commons could be avoided only through total privatisation or total government control, Ostrom had witnessed groundwater users near her native Los Angeles hammer out a system for sharing their coveted resource.”Pain of police killings ripples outward to traumatize Black people and communities across US. “Evidence shows that many Black Americans across the U.S. experience police killings of other Black people as traumatic events, and that this trauma diminishes the ability of Black communities to thrive.” Sobering statistics.U.S. Officials Announce Plans To Continue Pretending Brutal State-Sponsored Violence Not Supposed To Happen. ““Today, as we deal with the fallout from the death of Tyre Nichols, myself and the highest officials in the American government pledge to keep acting like we don’t want our highly militarized police force to kill innocent civilians every day,” said President Joe Biden at a White House press conference, adding that he and his fellow elected officials would pretend to gasp, pray, and put on a big emotional show every time law enforcement carried out the exact murders against its own citizens they had both tacitly and publicly approved.”Unionization increased by 200,000 in 2022: Tens of millions more wanted to join a union, but couldn’t .“One crucial way we can promote a more prosperous, equitable economy is to dismantle existing barriers to union organizing and collective bargaining. It is urgent that policymakers enact reforms at the federal and state levels to protect and support workers’ right to unionize.”Why Elon Musk and the billionaire space bros want to put people in space cages forever. “That said, I disagree with Mr. Wanjek: it requires much more than libertarian naiveté to colonize space. Parking humans in containment shelters, on Mars or elsewhere, so as to breed them and select them like cattle — that requires malice.”2023 'Doomsday Clock' moved 10 seconds closer to catastrophe. “Scientists revealed on Tuesday that the “Doomsday Clock” has been moved up to 90 seconds before midnight -- the closest humanity has ever been to armageddon.” But everything else is going so well.Post-Roe March for Life showed anti-abortion activists are far from done. “The next steps for the movement were illustrated by the march’s new route this year: Instead of ending at the steps of the Supreme Court as they have for nearly five decades, activists ended their march at the U.S. Capitol — underscoring their continued push for Congress to enact a federal abortion ban.”Anti-LGBTQ+ rhetoric and state laws are hurting youth mental health, poll shows. “Seventy-one percent of the 716 surveyed LGBTQ+ youth, ranging from teenagers to young adults who took the online poll last fall, said that debates around state laws restricting the rights of LGBTQ+ young people had negatively impacted their mental health. Twenty-seven percent characterized the negative effect as severe.”We Convinced Our School to Bring Back Masks. “As parents, it’s worth remembering that the persistent ones usually get what they want. Look at the anti-maskers. They didn’t give up. They kept pushing until they got their way. We don’t need to be that aggressive, but I think a lot of us get discouraged and give up. The anti-masker types never give up. They never seem to get tired. So if we want to beat them and win over middle earth, we have to match their energy.”Elon Musk-funded nonprofit run by MIT professor offered to finance Swedish pro-nazi group. “The US-based and Elon Musk-funded Future of Life Institute, run by MIT professor and Swedish citizen Max Tegmark, offered a grant of $100,000 to right-wing extremists in Sweden, an Expo investigation reveals.”Public Transit Goes Off the Rails With Fewer Riders, Dwindling Cash, Rising Crime. “Several of the nation’s largest urban mass-transit systems are at a crossroads, with ridership still depressed three years into the pandemic and federal aid running out.”TechnologyInstagram's co-founders are mounting a comeback. “TikTok’s innovation was to show you stuff using only algorithmic predictions, regardless of who your friends are or who you followed. It soon became the most downloaded app in the world. Artifact represents an effort to do the same thing, but for text.” Potentially an interesting app, based on an interesting insight.Women, minorities lose ground in tech layoffs. “The technology industry has long struggled to recruit a diverse workforce, but the recent spate of cuts by Silicon Valley companies has hit women particularly hard, according to recently published analyses of demographic data from the layoffs. Women and some minorities were particularly vulnerable to layoffs because they were newer to their jobs and occupied roles that companies were less interested in retaining, experts said.”U.S. sues Google for allegedly breaking antitrust laws with its ad business. ““For 15 years, Google has pursued a course of anticompetitive conduct that has allowed it to halt the rise of rival technologies, manipulate auction mechanics, to insulate itself from competition, and force advertisers and publishers to use its tools,” said Attorney General Merrick Garland at a press conference announcing the lawsuit.”Warning: Do not “other” me because of my age. “But I hate this new attention lavished on aging. Why? Because it “others” me. It puts me in a separate category from the rest of the world, and that is not how I think, feel, act, or want to be seen. All of a sudden I am not smart, pretty, successful, talented, or part of the family. I am “old.” I am somebody’s responsibility. I have to be told when to stop driving, and my checkbook can be taken away. I am a candidate for Senior Living (banishment to a place full of other old people).”Tapbot shuts down Tweetbot as it pivots to Mastodon. “Now that Twitter has confirmed it’s banning third-party clients, some of the most prominent alternatives are going away. Tapbots has shut down work on Tweetbot, one of the more popular iOS apps, as Twitter rendered it non-functional “in a blink of an eye.” The developer is instead pivoting to Ivory, an app for the open social platform Mastodon. While it’s limited to an invitation-only test for now, Tapbots hopes to make the software “better than Tweetbot ever could be.”” Likewise, Mastodon will be better than Twitter ever could be.U.S. No Fly List Left on Unprotected Airline Server. “Analysis of the server resulted in the discovery of a text file named “NoFly.csv,” a reference to the subset of individuals in the Terrorist Screening Database who have been barred from air travel due to having suspected or known ties to terrorist organizations.”‘Passion economy’ platforms cut costs in tech downturn. ““People are making choices,” said Rebecca McGrath, an internet analyst at Mintel. “Unless you’re very loyal to a creator, that’ll be one of the obvious things to drop.””Tesla video promoting self-driving was staged, engineer testifies. “A 2016 video that Tesla used to promote its self-driving technology was staged to show capabilities like stopping at a red light and accelerating at a green light that the system did not have, according to testimony by a senior engineer.” They’re fun cars to drive, but don’t let them drive themselves.Medium embraces Mastodon. “Today, Medium is launching a Mastodon instance at http://me.dm/ to help our authors, publications and readers find a home in the fediverse. Mastodon is an emerging force for good in social media and we are excited to join this community.” Hell yeah.The Effects of Online Content Moderation: Evidence from President Trump's Account Deletion. “The toxicity of tweets sent by Trump followers relative to a representative sample of US Twitter users dropped by around 25% after the account deletion. Second, this effect is larger for pro-Trump tweets and Republican users. Third, Trump’s suspension reduced the total number of tweets, suggesting a drop in engagement. Fourth, we find effects on individuals who did not follow Trump directly but followed somebody that did, suggesting network spillovers.”The Intercept Obtains Surveillance Footage of Tesla Crash on Bay Bridge. “These semi-autonomous systems are playing the same sort of trick as ChatGPT: they offer a convincing but shallow impression of a competent driverless car without any broader context to fall back on.”Apache® Appropriation. “We urge The Apache® Software Foundation to take the necessary steps needed to express the ally-ship they promote so deeply on their website, to act in accordance with their own code of conduct, to “be careful in the words that [they] choose”, and change their name.” +1.San Francisco Police Are Using Driverless Cars as Mobile Surveillance Cameras. “Law enforcement agencies already have access to automated license plate readers, geofence warrants, Ring Doorbell footage, as well as the ability to purchase location data. This practice will extend the reach of an already pervasive web of surveillance.”Seattle schools sue tech giants over social media harm. “[The lawsuit] blames [social media giants] for worsening mental health and behavioral disorders including anxiety, depression, disordered eating and cyberbullying; making it more difficult to educate students; and forcing schools to take steps such as hiring additional mental health professionals, developing lesson plans about the effects of social media, and providing additional training to teachers.”‘Office Space’ Inspired Engineer’s Theft Scheme, Police Say. “A software engineer siphoned more than $300,000 from his employer by introducing what prosecutors called a “series of malicious software edits” that wired money into his personal account. If the scheme sounds like the plot of “Office Space,” that’s because the authorities said it was partly inspired by the movie.”Activity Streams graphical model. “So I did a bit of drawing just to make it clearer (for myself) what kind of data can be shipped around in the Fediverse. To be clear, this is only a small part of the overall stack, but an important one.” Useful work!TwitterElon Musk’s Twitter hit with holocaust denial hate speech lawsuit in Germany. “Current studies prove that 84% of posts containing antisemitic hate speech were not reviewed by social media platforms, as shown in a study by the Center for Countering Digital Hate. Which means that Twitter knows Jews are being publicly attacked on the platform every day and that antisemitism is becoming a normality in our society. And that the platform’s response is by no means adequate.”Daring Fireball: If You Needed Any More Confirmation, Internal Slack Messages at Twitter Show That Cutting Off Third-Party Clients Was 'Intentional'. “Twitter can of course do what it wants, and Musk owns Twitter so he can do what he wants. But pulling the plug on these clients and ghosting everyone on communications about it is so absurdly disrespectful. Zero respect for the users for those apps, zero respect for the developers behind them — many of whom had been building on the Twitter platform for 10-15 years. Just a clown show.”How Twitter misleads us about how many people have left — and what to do about it. “To outside observers, it can seem like Twitter users are continuing as before, seemingly unaware of the millions of people who have left. “You left Twitter?” a friend recently remarked, “I hadn’t noticed.” Yet many of the accounts I follow haven’t tweeted in ages, and roughly 15% of them have already set up accounts on Mastodon.” Some great tips in this piece."
              }
            ],
            "url": [
              "https://werd.io/2023/reading-watching-playing-using-january-2023"
            ],
            "published": [
              "2023-02-01T17:00:46+00:00"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "author": [
              {
                "type": [
                  "h-card"
                ],
                "properties": {
                  "url": [
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd"
                  ],
                  "photo": [
                    "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
                  ],
                  "name": [
                    "Ben Werdmuller"
                  ]
                },
                "value": "Ben Werdmuller"
              }
            ],
            "name": [
              "Which sales enablement tool powers all those template-driven follow-up-heavy cold emails? I hereby petition that we yeet it directly into the sun."
            ],
            "content": [
              {
                "html": "Which sales enablement tool powers all those template-driven follow-up-heavy cold emails? I hereby petition that we yeet it directly into the sun.",
                "value": "Which sales enablement tool powers all those template-driven follow-up-heavy cold emails? I hereby petition that we yeet it directly into the sun."
              }
            ],
            "url": [
              "https://werd.io/2023/which-sales-enablement-tool-powers-all-those"
            ],
            "published": [
              "2023-01-31T19:16:39+00:00"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "author": [
              {
                "type": [
                  "h-card"
                ],
                "properties": {
                  "url": [
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd"
                  ],
                  "photo": [
                    "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
                  ],
                  "name": [
                    "Ben Werdmuller"
                  ]
                },
                "value": "Ben Werdmuller"
              }
            ],
            "name": [
              "Few things terrify me more than yoga, which is really a terror and dissatisfaction with my own body. I would like to fix that."
            ],
            "content": [
              {
                "html": "Few things terrify me more than yoga, which is really a terror and dissatisfaction with my own body. I would like to fix that.",
                "value": "Few things terrify me more than yoga, which is really a terror and dissatisfaction with my own body. I would like to fix that."
              }
            ],
            "url": [
              "https://werd.io/2023/few-things-terrify-me-more-than-yoga"
            ],
            "published": [
              "2023-01-31T17:32:55+00:00"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "author": [
              {
                "type": [
                  "h-card"
                ],
                "properties": {
                  "url": [
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd"
                  ],
                  "photo": [
                    "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
                  ],
                  "name": [
                    "Ben Werdmuller"
                  ]
                },
                "value": "Ben Werdmuller"
              }
            ],
            "bookmark-of": [
              "https://www.platformer.news/p/instagrams-co-founders-are-mounting"
            ],
            "name": [
              "Instagram's co-founders are mounting a comeback"
            ],
            "content": [
              {
                "html": "<p>“TikTok’s innovation was to show you stuff using only algorithmic predictions, regardless of who your friends are or who you followed. It soon became the most downloaded app in the world. Artifact represents an effort to do the same thing, but for text.” Potentially an interesting app, based on an interesting insight. <a href=\"https://werd.io/tag/Technology\" class=\"p-category\" rel=\"tag\">#Technology</a></p>",
                "value": "“TikTok’s innovation was to show you stuff using only algorithmic predictions, regardless of who your friends are or who you followed. It soon became the most downloaded app in the world. Artifact represents an effort to do the same thing, but for text.” Potentially an interesting app, based on an interesting insight. #Technology"
              }
            ],
            "category": [
              "#Technology"
            ],
            "url": [
              "https://werd.io/2023/instagrams-co-founders-are-mounting-a-comeback"
            ],
            "published": [
              "2023-01-31T16:15:51+00:00"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "author": [
              {
                "type": [
                  "h-card"
                ],
                "properties": {
                  "url": [
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd"
                  ],
                  "photo": [
                    "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
                  ],
                  "name": [
                    "Ben Werdmuller"
                  ]
                },
                "value": "Ben Werdmuller"
              }
            ],
            "bookmark-of": [
              "https://arstechnica.com/gadgets/2023/01/the-generative-ai-revolution-has-begun-how-did-we-get-here/"
            ],
            "name": [
              "The generative AI revolution has begun—how did we get here?"
            ],
            "content": [
              {
                "html": "<p>“But there was also a surprise. The OpenAI researchers discovered that in making the models bigger, they didn’t just get better at producing text. The models could learn entirely new behaviors simply by being shown new training data. In particular, the researchers discovered that GPT3 could be trained to follow instructions in plain English without having to explicitly design the model that way.” A superb introduction. <a href=\"https://werd.io/tag/AI\" class=\"p-category\" rel=\"tag\">#AI</a></p>",
                "value": "“But there was also a surprise. The OpenAI researchers discovered that in making the models bigger, they didn’t just get better at producing text. The models could learn entirely new behaviors simply by being shown new training data. In particular, the researchers discovered that GPT3 could be trained to follow instructions in plain English without having to explicitly design the model that way.” A superb introduction. #AI"
              }
            ],
            "category": [
              "#AI"
            ],
            "url": [
              "https://werd.io/2023/the-generative-ai-revolution-has-begunhow-did-we-get-here"
            ],
            "published": [
              "2023-01-31T15:59:46+00:00"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "author": [
              {
                "type": [
                  "h-card"
                ],
                "properties": {
                  "url": [
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd"
                  ],
                  "photo": [
                    "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
                  ],
                  "name": [
                    "Ben Werdmuller"
                  ]
                },
                "value": "Ben Werdmuller"
              }
            ],
            "bookmark-of": [
              "https://www.washingtonpost.com/opinions/2023/01/30/newsrooms-news-reporting-objectivity-diversity/"
            ],
            "name": [
              "Newsrooms that move beyond ‘objectivity’ can build trust"
            ],
            "content": [
              {
                "html": "<p>“Newer, nonprofit news organizations often have launched with stated missions. The national digital news site the 19th, for example, aims to “elevate voices of women, people of color, and the LGBTQ+ community.”” <a href=\"https://werd.io/tag/Media\" class=\"p-category\" rel=\"tag\">#Media</a></p>",
                "value": "“Newer, nonprofit news organizations often have launched with stated missions. The national digital news site the 19th, for example, aims to “elevate voices of women, people of color, and the LGBTQ+ community.”” #Media"
              }
            ],
            "category": [
              "#Media"
            ],
            "url": [
              "https://werd.io/2023/newsrooms-that-move-beyond-objectivity-can-build-trust"
            ],
            "published": [
              "2023-01-31T15:42:29+00:00"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "author": [
              {
                "type": [
                  "h-card"
                ],
                "properties": {
                  "url": [
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd"
                  ],
                  "photo": [
                    "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
                  ],
                  "name": [
                    "Ben Werdmuller"
                  ]
                },
                "value": "Ben Werdmuller"
              }
            ],
            "bookmark-of": [
              "https://www.dailytarheel.com/article/2023/01/university-unc-leaders-blindsided-trustees-decision-professional-school"
            ],
            "name": [
              "‘I’m flabbergasted’: UNC leaders blindsided by trustees' decision on School of Civic Life and Leadership"
            ],
            "content": [
              {
                "html": "<p>“Mimi Chapman, chairperson of faculty, said she was “flabbergasted” in response to the exclusion of faculty input in the decision, which she said she considers to be an attack on shared University governance.” From the same university that denied tenure to Nikole Hannah-Jones. <a href=\"https://werd.io/tag/Democracy\" class=\"p-category\" rel=\"tag\">#Democracy</a></p>",
                "value": "“Mimi Chapman, chairperson of faculty, said she was “flabbergasted” in response to the exclusion of faculty input in the decision, which she said she considers to be an attack on shared University governance.” From the same university that denied tenure to Nikole Hannah-Jones. #Democracy"
              }
            ],
            "category": [
              "#Democracy"
            ],
            "url": [
              "https://werd.io/2023/im-flabbergasted-unc-leaders-blindsided-by-trustees-decision-on-school"
            ],
            "published": [
              "2023-01-31T14:55:51+00:00"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "author": [
              {
                "type": [
                  "h-card"
                ],
                "properties": {
                  "url": [
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd"
                  ],
                  "photo": [
                    "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
                  ],
                  "name": [
                    "Ben Werdmuller"
                  ]
                },
                "value": "Ben Werdmuller"
              }
            ],
            "bookmark-of": [
              "https://www.washingtonpost.com/technology/2023/01/27/diversity-layoffs-meta-facebook/"
            ],
            "name": [
              "Women, minorities lose ground in tech layoffs"
            ],
            "content": [
              {
                "html": "<p>“The technology industry has long struggled to recruit a diverse workforce, but the recent spate of cuts by Silicon Valley companies has hit women particularly hard, according to recently published analyses of demographic data from the layoffs. Women and some minorities were particularly vulnerable to layoffs because they were newer to their jobs and occupied roles that companies were less interested in retaining, experts said.” <a href=\"https://werd.io/tag/Technology\" class=\"p-category\" rel=\"tag\">#Technology</a></p>",
                "value": "“The technology industry has long struggled to recruit a diverse workforce, but the recent spate of cuts by Silicon Valley companies has hit women particularly hard, according to recently published analyses of demographic data from the layoffs. Women and some minorities were particularly vulnerable to layoffs because they were newer to their jobs and occupied roles that companies were less interested in retaining, experts said.” #Technology"
              }
            ],
            "category": [
              "#Technology"
            ],
            "url": [
              "https://werd.io/2023/women-minorities-lose-ground-in-tech-layoffs"
            ],
            "published": [
              "2023-01-30T17:54:43+00:00"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "author": [
              {
                "type": [
                  "h-card"
                ],
                "properties": {
                  "url": [
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd"
                  ],
                  "photo": [
                    "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
                  ],
                  "name": [
                    "Ben Werdmuller"
                  ]
                },
                "value": "Ben Werdmuller"
              }
            ],
            "bookmark-of": [
              "https://19thnews.org/2023/01/a-vast-majority-of-americans-are-concerned-people-could-face-criminal-penalties-for-abortion/"
            ],
            "name": [
              "A vast majority of Americans are concerned people could face criminal penalties for abortion"
            ],
            "content": [
              {
                "html": "<p>“The data found that 80 percent of Americans are concerned that domestic abuse survivors could be reported by their abuser for getting an abortion. Eighty percent of people are also concerned that law enforcement could investigate people who have miscarriages or stillbirths if they are suspected of getting an abortion. The poll also found that 75 percent of people are concerned that people who get an abortion could be charged with a felony or go to jail.” <a href=\"https://werd.io/tag/Society\" class=\"p-category\" rel=\"tag\">#Society</a></p>",
                "value": "“The data found that 80 percent of Americans are concerned that domestic abuse survivors could be reported by their abuser for getting an abortion. Eighty percent of people are also concerned that law enforcement could investigate people who have miscarriages or stillbirths if they are suspected of getting an abortion. The poll also found that 75 percent of people are concerned that people who get an abortion could be charged with a felony or go to jail.” #Society"
              }
            ],
            "category": [
              "#Society"
            ],
            "url": [
              "https://werd.io/2023/a-vast-majority-of-americans-are-concerned-people-could-face"
            ],
            "published": [
              "2023-01-30T17:28:49+00:00"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "author": [
              {
                "type": [
                  "h-card"
                ],
                "properties": {
                  "url": [
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd"
                  ],
                  "photo": [
                    "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
                  ],
                  "name": [
                    "Ben Werdmuller"
                  ]
                },
                "value": "Ben Werdmuller"
              }
            ],
            "bookmark-of": [
              "https://www.vice.com/en/article/z34ane/neo-nazi-homeschool-ohio"
            ],
            "name": [
              "Inside a US Neo-Nazi Homeschool Network With Thousands of Members"
            ],
            "content": [
              {
                "html": "<p>“Since the group began in October 2021 it has openly embraced Nazi ideology and promoted white supremacy, while proudly discouraging parents from letting their white children play with or have any contact with people of any other race. Admins and members use racist, homophobic, and antisemitic slurs without shame, and quote Hitler and other Nazi leaders daily in a channel open to the public.” <a href=\"https://werd.io/tag/Society\" class=\"p-category\" rel=\"tag\">#Society</a></p>",
                "value": "“Since the group began in October 2021 it has openly embraced Nazi ideology and promoted white supremacy, while proudly discouraging parents from letting their white children play with or have any contact with people of any other race. Admins and members use racist, homophobic, and antisemitic slurs without shame, and quote Hitler and other Nazi leaders daily in a channel open to the public.” #Society"
              }
            ],
            "category": [
              "#Society"
            ],
            "url": [
              "https://werd.io/2023/inside-a-us-neo-nazi-homeschool-network-with-thousands-of-members"
            ],
            "published": [
              "2023-01-30T05:18:01+00:00"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "author": [
              {
                "type": [
                  "h-card"
                ],
                "properties": {
                  "url": [
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd"
                  ],
                  "photo": [
                    "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
                  ],
                  "name": [
                    "Ben Werdmuller"
                  ]
                },
                "value": "Ben Werdmuller"
              }
            ],
            "bookmark-of": [
              "https://aeon.co/essays/the-tragedy-of-the-commons-is-a-false-and-dangerous-myth"
            ],
            "name": [
              "The tragedy of the commons is a false and dangerous myth"
            ],
            "content": [
              {
                "html": "<p>“Even before Hardin’s ‘The Tragedy of the Commons’ was published, however, the young political scientist Elinor Ostrom had proven him wrong. While Hardin speculated that the tragedy of the commons could be avoided only through total privatisation or total government control, Ostrom had witnessed groundwater users near her native Los Angeles hammer out a system for sharing their coveted resource.” <a href=\"https://werd.io/tag/Society\" class=\"p-category\" rel=\"tag\">#Society</a></p>",
                "value": "“Even before Hardin’s ‘The Tragedy of the Commons’ was published, however, the young political scientist Elinor Ostrom had proven him wrong. While Hardin speculated that the tragedy of the commons could be avoided only through total privatisation or total government control, Ostrom had witnessed groundwater users near her native Los Angeles hammer out a system for sharing their coveted resource.” #Society"
              }
            ],
            "category": [
              "#Society"
            ],
            "url": [
              "https://werd.io/2023/the-tragedy-of-the-commons-is-a-false-and-dangerous"
            ],
            "published": [
              "2023-01-30T05:04:10+00:00"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "author": [
              {
                "type": [
                  "h-card"
                ],
                "properties": {
                  "url": [
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd"
                  ],
                  "photo": [
                    "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
                  ],
                  "name": [
                    "Ben Werdmuller"
                  ]
                },
                "value": "Ben Werdmuller"
              }
            ],
            "name": [
              "I’m worried I have delayed onset long covid. I’ve had very strong fatigue, shortness of breath, congestion, and muscle aches for weeks. I can tell that having these symptoms while taking care of a baby is not going to be a walk in the park. Really hoping I can overcome them."
            ],
            "content": [
              {
                "html": "I’m worried I have delayed onset long covid. I’ve had very strong fatigue, shortness of breath, congestion, and muscle aches for weeks. I can tell that having these symptoms while taking care of a baby is not going to be a walk in the park. Really hoping I can overcome them.",
                "value": "I’m worried I have delayed onset long covid. I’ve had very strong fatigue, shortness of breath, congestion, and muscle aches for weeks. I can tell that having these symptoms while taking care of a baby is not going to be a walk in the park. Really hoping I can overcome them."
              }
            ],
            "url": [
              "https://werd.io/2023/im-worried-i-have-delayed-onset-long"
            ],
            "published": [
              "2023-01-30T03:44:12+00:00"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "author": [
              {
                "type": [
                  "h-card"
                ],
                "properties": {
                  "url": [
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd"
                  ],
                  "photo": [
                    "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
                  ],
                  "name": [
                    "Ben Werdmuller"
                  ]
                },
                "value": "Ben Werdmuller"
              }
            ],
            "bookmark-of": [
              "https://www.permissionslipcr.com/"
            ],
            "name": [
              "Permission Slip"
            ],
            "content": [
              {
                "html": "<p>“It’s no secret that a huge number of companies are collecting, buying and selling data about us. Find out what information they collect, and take action to help protect yourself.” An app by Consumer Reports that checks to see which businesses hold data about you - and then helps you to remove it. Great stuff. <a href=\"https://werd.io/tag/Technology\" class=\"p-category\" rel=\"tag\">#Technology</a></p>",
                "value": "“It’s no secret that a huge number of companies are collecting, buying and selling data about us. Find out what information they collect, and take action to help protect yourself.” An app by Consumer Reports that checks to see which businesses hold data about you - and then helps you to remove it. Great stuff. #Technology"
              }
            ],
            "category": [
              "#Technology"
            ],
            "url": [
              "https://werd.io/2023/permission-slip"
            ],
            "published": [
              "2023-01-29T18:15:57+00:00"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "author": [
              {
                "type": [
                  "h-card"
                ],
                "properties": {
                  "url": [
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd"
                  ],
                  "photo": [
                    "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
                  ],
                  "name": [
                    "Ben Werdmuller"
                  ]
                },
                "value": "Ben Werdmuller"
              }
            ],
            "name": [
              "What’s the last book you read and loved?"
            ],
            "content": [
              {
                "html": "What’s the last book you read and loved?",
                "value": "What’s the last book you read and loved?"
              }
            ],
            "url": [
              "https://werd.io/2023/whats-the-last-book-you-read-and"
            ],
            "published": [
              "2023-01-29T12:52:59+00:00"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "author": [
              {
                "type": [
                  "h-card"
                ],
                "properties": {
                  "url": [
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd"
                  ],
                  "photo": [
                    "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
                  ],
                  "name": [
                    "Ben Werdmuller"
                  ]
                },
                "value": "Ben Werdmuller"
              }
            ],
            "bookmark-of": [
              "https://reb00ted.org/tech/20230124-activitystreams-model/"
            ],
            "name": [
              "Activity Streams graphical model"
            ],
            "content": [
              {
                "html": "<p>“So I did a bit of drawing just to make it clearer (for myself) what kind of data can be shipped around in the Fediverse. To be clear, this is only a small part of the overall stack, but an important one.” Useful work! <a href=\"https://werd.io/tag/Coding\" class=\"p-category\" rel=\"tag\">#Coding</a></p>",
                "value": "“So I did a bit of drawing just to make it clearer (for myself) what kind of data can be shipped around in the Fediverse. To be clear, this is only a small part of the overall stack, but an important one.” Useful work! #Coding"
              }
            ],
            "category": [
              "#Coding"
            ],
            "url": [
              "https://werd.io/2023/activity-streams-graphical-model"
            ],
            "published": [
              "2023-01-28T16:45:58+00:00"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "author": [
              {
                "type": [
                  "h-card"
                ],
                "properties": {
                  "url": [
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd"
                  ],
                  "photo": [
                    "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
                  ],
                  "name": [
                    "Ben Werdmuller"
                  ]
                },
                "value": "Ben Werdmuller"
              }
            ],
            "bookmark-of": [
              "https://theconversation.com/pain-of-police-killings-ripples-outward-to-traumatize-black-people-and-communities-across-us-159624"
            ],
            "name": [
              "Pain of police killings ripples outward to traumatize Black people and communities across US"
            ],
            "content": [
              {
                "html": "<p>“Evidence shows that many Black Americans across the U.S. experience police killings of other Black people as traumatic events, and that this trauma diminishes the ability of Black communities to thrive.” Sobering statistics. <a href=\"https://werd.io/tag/Society\" class=\"p-category\" rel=\"tag\">#Society</a></p>",
                "value": "“Evidence shows that many Black Americans across the U.S. experience police killings of other Black people as traumatic events, and that this trauma diminishes the ability of Black communities to thrive.” Sobering statistics. #Society"
              }
            ],
            "category": [
              "#Society"
            ],
            "url": [
              "https://werd.io/2023/pain-of-police-killings-ripples-outward-to-traumatize-black-people"
            ],
            "published": [
              "2023-01-28T06:00:53+00:00"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "author": [
              {
                "type": [
                  "h-card"
                ],
                "properties": {
                  "url": [
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd"
                  ],
                  "photo": [
                    "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
                  ],
                  "name": [
                    "Ben Werdmuller"
                  ]
                },
                "value": "Ben Werdmuller"
              }
            ],
            "name": [
              "Tonight"
            ],
            "content": [
              {
                "html": "<p>I have two things on my mind tonight.</p>\n<p>First: <a href=\"https://www.cnn.com/2023/01/27/us/tyre-nichols-memphis-friday/index.html\">the brutal murder of Tyre Nichols by Memphis police officers</a>, far from the first <a href=\"https://www.washingtonpost.com/graphics/investigations/police-shootings-database/#database-header\">or even the fiftieth murder</a> by police so far this year. </p>\n<p>Second: <a href=\"https://everytownresearch.org/report/the-impact-of-active-shooter-drills-in-schools/\">active shooter drills in schools, which aren’t proven to save lives but do lead to anxiety and depression in children</a>.</p>\n<p>This country has violence burned into its bones. It’s in the air and visible in the holsters on the belts of police officers, in open carry, in the ongoing injustice of the death penalty. It’s in its stoic men, in its value of strength over intelligence and brute force over creativity, and in the militarization of everyday life. It’s in its failure to repair the gaping wounds of slavery and segregation, and in tribalism over solidarity. It’s in its failure to care for the poor, to put a roof over the head of the homeless, and to heal the sick. It’s in the value it places in wealth over kindness and fairness.</p>\n<p>It’s reductive to suggest there’s an easy answer. The rot is ingrained; a simultaneous equation made of simultaneous equations. But I can make some observations.</p>\n<p>A different question is this: what should we do about our son?</p>",
                "value": "I have two things on my mind tonight.First: the brutal murder of Tyre Nichols by Memphis police officers, far from the first or even the fiftieth murder by police so far this year. Second: active shooter drills in schools, which aren’t proven to save lives but do lead to anxiety and depression in children.This country has violence burned into its bones. It’s in the air and visible in the holsters on the belts of police officers, in open carry, in the ongoing injustice of the death penalty. It’s in its stoic men, in its value of strength over intelligence and brute force over creativity, and in the militarization of everyday life. It’s in its failure to repair the gaping wounds of slavery and segregation, and in tribalism over solidarity. It’s in its failure to care for the poor, to put a roof over the head of the homeless, and to heal the sick. It’s in the value it places in wealth over kindness and fairness.It’s reductive to suggest there’s an easy answer. The rot is ingrained; a simultaneous equation made of simultaneous equations. But I can make some observations.A different question is this: what should we do about our son?"
              }
            ],
            "url": [
              "https://werd.io/2023/tonight"
            ],
            "published": [
              "2023-01-28T05:32:49+00:00"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "author": [
              {
                "type": [
                  "h-card"
                ],
                "properties": {
                  "url": [
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd"
                  ],
                  "photo": [
                    "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
                  ],
                  "name": [
                    "Ben Werdmuller"
                  ]
                },
                "value": "Ben Werdmuller"
              }
            ],
            "bookmark-of": [
              "https://www.epi.org/publication/unionization-2022/"
            ],
            "name": [
              "Unionization increased by 200,000 in 2022: Tens of millions more wanted to join a union, but couldn’t"
            ],
            "content": [
              {
                "html": "<p>“One crucial way we can promote a more prosperous, equitable economy is to dismantle existing barriers to union organizing and collective bargaining. It is urgent that policymakers enact reforms at the federal and state levels to protect and support workers’ right to unionize.” <a href=\"https://werd.io/tag/Society\" class=\"p-category\" rel=\"tag\">#Society</a></p>",
                "value": "“One crucial way we can promote a more prosperous, equitable economy is to dismantle existing barriers to union organizing and collective bargaining. It is urgent that policymakers enact reforms at the federal and state levels to protect and support workers’ right to unionize.” #Society"
              }
            ],
            "category": [
              "#Society"
            ],
            "url": [
              "https://werd.io/2023/unionization-increased-by-200000-in-2022-tens-of-millions-more"
            ],
            "published": [
              "2023-01-28T04:19:37+00:00"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "author": [
              {
                "type": [
                  "h-card"
                ],
                "properties": {
                  "url": [
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd"
                  ],
                  "photo": [
                    "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
                  ],
                  "name": [
                    "Ben Werdmuller"
                  ]
                },
                "value": "Ben Werdmuller"
              }
            ],
            "bookmark-of": [
              "https://www.theonion.com/u-s-officials-announce-plans-to-continue-pretending-br-1850036671"
            ],
            "name": [
              "U.S. Officials Announce Plans To Continue Pretending Brutal State-Sponsored Violence Not Supposed To Happen"
            ],
            "content": [
              {
                "html": "<p>““Today, as we deal with the fallout from the death of Tyre Nichols, myself and the highest officials in the American government pledge to keep acting like we don’t want our highly militarized police force to kill innocent civilians every day,” said President Joe Biden at a White House press conference, adding that he and his fellow elected officials would pretend to gasp, pray, and put on a big emotional show every time law enforcement carried out the exact murders against its own citizens they had both tacitly and publicly approved.” <a href=\"https://werd.io/tag/Society\" class=\"p-category\" rel=\"tag\">#Society</a></p>",
                "value": "““Today, as we deal with the fallout from the death of Tyre Nichols, myself and the highest officials in the American government pledge to keep acting like we don’t want our highly militarized police force to kill innocent civilians every day,” said President Joe Biden at a White House press conference, adding that he and his fellow elected officials would pretend to gasp, pray, and put on a big emotional show every time law enforcement carried out the exact murders against its own citizens they had both tacitly and publicly approved.” #Society"
              }
            ],
            "category": [
              "#Society"
            ],
            "url": [
              "https://werd.io/2023/us-officials-announce-plans-to-continue-pretending-brutal-state-sponsored-violence"
            ],
            "published": [
              "2023-01-28T04:19:36+00:00"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "author": [
              {
                "type": [
                  "h-card"
                ],
                "properties": {
                  "url": [
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd"
                  ],
                  "photo": [
                    "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
                  ],
                  "name": [
                    "Ben Werdmuller"
                  ]
                },
                "value": "Ben Werdmuller"
              }
            ],
            "bookmark-of": [
              "https://19thnews.org/2023/01/three-years-of-the-19th-30-cities-54-employees-and-news-that-represents/"
            ],
            "name": [
              "Three years of The 19th: 30 cities, 54 employees and news that represents"
            ],
            "content": [
              {
                "html": "<p>“In the last year alone, we’ve grown at an astronomical pace: from 32 employees to 54, from a news organization that pledged to be the most representative in the nation to one where 65 percent of our staff is non-White, 30 percent are LGBTQ+ and 19 percent are living with disabilities. We’re now on the ground in more than 30 U.S. cities.” I’m so proud to be a part of this team. <a href=\"https://werd.io/tag/Media\" class=\"p-category\" rel=\"tag\">#Media</a></p>",
                "value": "“In the last year alone, we’ve grown at an astronomical pace: from 32 employees to 54, from a news organization that pledged to be the most representative in the nation to one where 65 percent of our staff is non-White, 30 percent are LGBTQ+ and 19 percent are living with disabilities. We’re now on the ground in more than 30 U.S. cities.” I’m so proud to be a part of this team. #Media"
              }
            ],
            "category": [
              "#Media"
            ],
            "url": [
              "https://werd.io/2023/three-years-of-the-19th-30-cities-54-employees-and"
            ],
            "published": [
              "2023-01-27T16:30:50+00:00"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "author": [
              {
                "type": [
                  "h-card"
                ],
                "properties": {
                  "url": [
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd"
                  ],
                  "photo": [
                    "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
                  ],
                  "name": [
                    "Ben Werdmuller"
                  ]
                },
                "value": "Ben Werdmuller"
              }
            ],
            "bookmark-of": [
              "https://techcrunch.com/2023/01/25/elon-musk-twitter-antisemitic-hate-speech-lawsuit-germany/"
            ],
            "name": [
              "Elon Musk’s Twitter hit with holocaust denial hate speech lawsuit in Germany"
            ],
            "content": [
              {
                "html": "<p>“Current studies prove that 84% of posts containing antisemitic hate speech were not reviewed by social media platforms, as shown in a study by the Center for Countering Digital Hate. Which means that Twitter knows Jews are being publicly attacked on the platform every day and that antisemitism is becoming a normality in our society. And that the platform’s response is by no means adequate.” <a href=\"https://werd.io/tag/Twitter\" class=\"p-category\" rel=\"tag\">#Twitter</a></p>",
                "value": "“Current studies prove that 84% of posts containing antisemitic hate speech were not reviewed by social media platforms, as shown in a study by the Center for Countering Digital Hate. Which means that Twitter knows Jews are being publicly attacked on the platform every day and that antisemitism is becoming a normality in our society. And that the platform’s response is by no means adequate.” #Twitter"
              }
            ],
            "category": [
              "#Twitter"
            ],
            "url": [
              "https://werd.io/2023/elon-musks-twitter-hit-with-holocaust-denial-hate-speech-lawsuit"
            ],
            "published": [
              "2023-01-27T05:06:52+00:00"
            ]
          }
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "author": [
              {
                "type": [
                  "h-card"
                ],
                "properties": {
                  "url": [
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd",
                    "https://werd.io/profile/benwerd"
                  ],
                  "photo": [
                    "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
                  ],
                  "name": [
                    "Ben Werdmuller"
                  ]
                },
                "value": "Ben Werdmuller"
              }
            ],
            "name": [
              "It's only a podcast if it's open"
            ],
            "content": [
              {
                "html": "<p><img src=\"https://werd.io/file/63d3270d581a475e990a9602/thumb.jpg\" alt=\"A podcasting setup with a microphone and a laptop\" width=\"1024\" height=\"683\"></p>\n<p>Quick PSA:</p>\n<p><strong>A podcast is only a podcast if you can listen to it anywhere.</strong></p>\n<p>Just like a newsletter isn’t a newsletter if you can’t subscribe using any email address, the point of a podcast is that you can listen to it in any podcast app. It just works.</p>\n<p>If your podcast only works in Spotify or Apple Podcasts or another proprietary app, perhaps because of an exclusivity arrangement, it’s just serial audio. The content may be wonderful, but you’re missing out on the complete set of potential listeners in order to focus on one app’s existing username.</p>\n<p>In some ways that’s fine - after all, you can’t watch a Netflix show in any app but Netflix’s - but it’s not a podcast. It’s something else. It’s just a show on someone’s channel.</p>\n<p>The way podcasts work is by releasing episodes as attachments on an RSS feed. You don’t need to <em>know</em> that this is how it happens - all you need to know is that it doesn’t matter which podcast app you prefer, just as it doesn’t matter which browser you use to access your favorite website. The point of these platforms is that you have the choice.</p>\n<p>That’s important for listeners, but it’s also important for producers. Tech companies are notoriously fickle, and signing an exclusivity deal with one inexorably ties your future into their evolving business strategies.</p>\n<p>It might make sense to make an exclusive deal with a streaming platform if they’re going to give you <a href=\"https://www.nytimes.com/2022/02/17/arts/music/spotify-joe-rogan-misinformation.html\">$200 million like Joe Rogan</a>. (I tend to think this is win-win: Spotify thinks it has something unique, while the rest of us aren’t bothered with Rogan’s show.) But if you’re making a deal for a fraction of that money, know that you’re losing out on reaching out to a whole ecosystem in exchange for tying yourself to the business model of a startup that might change business model on a dime and leave your show - or even your whole production company - in the dirt.</p>\n<p>The media industry is littered with the graves of companies that tied themselves to onerous distribution contracts. There’s no need. Podcasts are open, available everywhere, and easily monetizable once you’ve got a subscribed audience. You don’t need to prostrate yourself for a company that, ultimately, doesn’t care about your future.</p>",
                "value": "A podcasting setup with a microphone and a laptop Quick PSA:A podcast is only a podcast if you can listen to it anywhere.Just like a newsletter isn’t a newsletter if you can’t subscribe using any email address, the point of a podcast is that you can listen to it in any podcast app. It just works.If your podcast only works in Spotify or Apple Podcasts or another proprietary app, perhaps because of an exclusivity arrangement, it’s just serial audio. The content may be wonderful, but you’re missing out on the complete set of potential listeners in order to focus on one app’s existing username.In some ways that’s fine - after all, you can’t watch a Netflix show in any app but Netflix’s - but it’s not a podcast. It’s something else. It’s just a show on someone’s channel.The way podcasts work is by releasing episodes as attachments on an RSS feed. You don’t need to know that this is how it happens - all you need to know is that it doesn’t matter which podcast app you prefer, just as it doesn’t matter which browser you use to access your favorite website. The point of these platforms is that you have the choice.That’s important for listeners, but it’s also important for producers. Tech companies are notoriously fickle, and signing an exclusivity deal with one inexorably ties your future into their evolving business strategies.It might make sense to make an exclusive deal with a streaming platform if they’re going to give you $200 million like Joe Rogan. (I tend to think this is win-win: Spotify thinks it has something unique, while the rest of us aren’t bothered with Rogan’s show.) But if you’re making a deal for a fraction of that money, know that you’re losing out on reaching out to a whole ecosystem in exchange for tying yourself to the business model of a startup that might change business model on a dime and leave your show - or even your whole production company - in the dirt.The media industry is littered with the graves of companies that tied themselves to onerous distribution contracts. There’s no need. Podcasts are open, available everywhere, and easily monetizable once you’ve got a subscribed audience. You don’t need to prostrate yourself for a company that, ultimately, doesn’t care about your future."
              }
            ],
            "url": [
              "https://werd.io/2023/its-only-a-podcast-if-its-open"
            ],
            "published": [
              "2023-01-27T01:19:48+00:00"
            ]
          }
        }
      ]
    }
  ],
  "rels": {
    "apple-touch-icon": [
      "https://werd.io/gfx/logos/apple-icon-57x57.png",
      "https://werd.io/gfx/logos/apple-icon-72x72.png",
      "https://werd.io/gfx/logos/apple-icon-114x114.png",
      "https://werd.io/gfx/logos/apple-icon-144x144.png",
      "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
    ],
    "icon": [
      "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
    ],
    "shortcut": [
      "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
    ],
    "apple-touch-icon-precomposed": [
      "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg"
    ],
    "manifest": [
      "https://werd.io/chrome/manifest.json"
    ],
    "schema.DC": [
      "https://purl.org/dc/elements/1.1/"
    ],
    "stylesheet": [
      "https://werd.io/vendor/twbs/bootstrap/dist/css/bootstrap.min.css",
      "https://werd.io/vendor/npm-asset/bootstrap-accessibility-plugin/plugins/css/bootstrap-accessibility.css",
      "https://werd.io/vendor/forkawesome/fork-awesome/css/fork-awesome.min.css",
      "https://werd.io/vendor/forkawesome/fork-awesome/css/v5-compat.min.css",
      "https://werd.io/css/1659102598/known.min.css",
      "https://werd.io/vendor/npm-asset/bootstrap-toggle/css/bootstrap-toggle.min.css",
      "https://werd.io/vendor/idno/mentionjs/recommended-styles.css",
      "https://werd.io/vendor/npm-asset/eonasdan-bootstrap-datetimepicker/build/css/bootstrap-datetimepicker.min.css",
      "https://werd.io/Themes/CornmarketStreet/css/default.css",
      "https://fonts.googleapis.com/css?family=Merriweather:300,300i,400,400i,700,700i",
      "https://werd.io/vendor/npm-asset/mediaelement/build/mediaelementplayer.min.css"
    ],
    "alternate": [
      "https://werd.io/?_t=rss",
      "https://werd.io/content/all?_t=rss",
      "https://granary.io/url?url=https://werd.io/content/all/&input=html&output=atom&hub=https://bridgy-fed.superfeedr.com/"
    ],
    "feed": [
      "https://werd.io/?_t=rss",
      "https://werd.io/content/all?_t=rss",
      "https://werd.io/content/all"
    ],
    "http://webmention.org/": [
      "https://werd.io/webmention/"
    ],
    "webmention": [
      "https://werd.io/webmention/"
    ],
    "hub": [
      "https://withknown.superfeedr.com/"
    ],
    "me": [
      "https://github.com/benwerd",
      "https://www.linkedin.com/in/benwerd",
      "https://werd.social/@ben",
      "https://19thnews.org/"
    ],
    "openid.delegate": [
      "https://werd.io/"
    ],
    "openid.server": [
      "https://indieauth.com/openid"
    ],
    "authorization_endpoint": [
      "https://werd.io/indieauth/auth"
    ],
    "token_endpoint": [
      "https://werd.io/indieauth/token"
    ],
    "micropub": [
      "https://werd.io/micropub/endpoint"
    ],
    "tag": [
      "https://werd.io/tag/Society",
      "https://werd.io/tag/Technology",
      "https://werd.io/tag/Media",
      "https://werd.io/tag/AI",
      "https://werd.io/tag/Democracy",
      "https://werd.io/tag/Coding",
      "https://werd.io/tag/Twitter"
    ],
    "permalink": [
      "https://werd.io/2023/where-is-abortion-legal-almost-half-of-all-americans-arent",
      "https://werd.io/2023/shotspotter-employees-not-only-have-the-power-to-alter-gunshot",
      "https://werd.io/2023/medias-money-problem",
      "https://werd.io/2023/reading-watching-playing-using-january-2023",
      "https://werd.io/2023/which-sales-enablement-tool-powers-all-those",
      "https://werd.io/2023/few-things-terrify-me-more-than-yoga",
      "https://werd.io/2023/instagrams-co-founders-are-mounting-a-comeback",
      "https://werd.io/2023/the-generative-ai-revolution-has-begunhow-did-we-get-here",
      "https://werd.io/2023/newsrooms-that-move-beyond-objectivity-can-build-trust",
      "https://werd.io/2023/im-flabbergasted-unc-leaders-blindsided-by-trustees-decision-on-school",
      "https://werd.io/2023/women-minorities-lose-ground-in-tech-layoffs",
      "https://werd.io/2023/a-vast-majority-of-americans-are-concerned-people-could-face",
      "https://werd.io/2023/inside-a-us-neo-nazi-homeschool-network-with-thousands-of-members",
      "https://werd.io/2023/the-tragedy-of-the-commons-is-a-false-and-dangerous",
      "https://werd.io/2023/im-worried-i-have-delayed-onset-long",
      "https://werd.io/2023/permission-slip",
      "https://werd.io/2023/whats-the-last-book-you-read-and",
      "https://werd.io/2023/activity-streams-graphical-model",
      "https://werd.io/2023/pain-of-police-killings-ripples-outward-to-traumatize-black-people",
      "https://werd.io/2023/tonight",
      "https://werd.io/2023/unionization-increased-by-200000-in-2022-tens-of-millions-more",
      "https://werd.io/2023/us-officials-announce-plans-to-continue-pretending-brutal-state-sponsored-violence",
      "https://werd.io/2023/three-years-of-the-19th-30-cities-54-employees-and",
      "https://werd.io/2023/elon-musks-twitter-hit-with-holocaust-denial-hate-speech-lawsuit",
      "https://werd.io/2023/its-only-a-podcast-if-its-open"
    ],
    "next": [
      "https://werd.io/?offset=0"
    ],
    "prev": [
      "https://werd.io/?offset=25"
    ]
  },
  "rel-urls": {
    "https://werd.io/gfx/logos/apple-icon-57x57.png": {
      "rels": [
        "apple-touch-icon"
      ]
    },
    "https://werd.io/gfx/logos/apple-icon-72x72.png": {
      "rels": [
        "apple-touch-icon"
      ]
    },
    "https://werd.io/gfx/logos/apple-icon-114x114.png": {
      "rels": [
        "apple-touch-icon"
      ]
    },
    "https://werd.io/gfx/logos/apple-icon-144x144.png": {
      "rels": [
        "apple-touch-icon"
      ]
    },
    "https://werd.io/file/5d388c5fb16ea14aac640912/thumb.jpg": {
      "rels": [
        "icon",
        "shortcut"
      ],
      "type": "image/jpg"
    },
    "https://werd.io/chrome/manifest.json": {
      "rels": [
        "manifest"
      ]
    },
    "https://purl.org/dc/elements/1.1/": {
      "rels": [
        "schema.DC"
      ]
    },
    "https://werd.io/vendor/twbs/bootstrap/dist/css/bootstrap.min.css": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://werd.io/vendor/npm-asset/bootstrap-accessibility-plugin/plugins/css/bootstrap-accessibility.css": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://werd.io/vendor/forkawesome/fork-awesome/css/fork-awesome.min.css": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://werd.io/vendor/forkawesome/fork-awesome/css/v5-compat.min.css": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://werd.io/css/1659102598/known.min.css": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://werd.io/vendor/npm-asset/bootstrap-toggle/css/bootstrap-toggle.min.css": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://werd.io/vendor/idno/mentionjs/recommended-styles.css": {
      "rels": [
        "stylesheet"
      ],
      "type": "text/css"
    },
    "https://werd.io/vendor/npm-asset/eonasdan-bootstrap-datetimepicker/build/css/bootstrap-datetimepicker.min.css": {
      "rels": [
        "stylesheet"
      ],
      "type": "text/css"
    },
    "https://werd.io/?_t=rss": {
      "rels": [
        "alternate"
      ],
      "title": "Ben Werdmuller",
      "type": "application/rss+xml"
    },
    "https://werd.io/content/all?_t=rss": {
      "rels": [
        "alternate",
        "feed"
      ],
      "title": "Ben Werdmuller: all content",
      "type": "application/rss+xml"
    },
    "https://werd.io/content/all": {
      "rels": [
        "feed"
      ],
      "title": "Ben Werdmuller",
      "type": "text/html"
    },
    "https://werd.io/webmention/": {
      "rels": [
        "http://webmention.org/"
      ]
    },
    "https://withknown.superfeedr.com/": {
      "rels": [
        "hub"
      ]
    },
    "https://github.com/benwerd": {
      "rels": [
        "me"
      ]
    },
    "https://www.linkedin.com/in/benwerd": {
      "rels": [
        "me"
      ]
    },
    "https://werd.social/@ben": {
      "rels": [
        "me"
      ]
    },
    "https://19thnews.org/": {
      "rels": [
        "me"
      ]
    },
    "https://werd.io/": {
      "rels": [
        "openid.delegate"
      ]
    },
    "https://indieauth.com/openid": {
      "rels": [
        "openid.server"
      ]
    },
    "https://werd.io/indieauth/auth": {
      "rels": [
        "authorization_endpoint"
      ]
    },
    "https://werd.io/indieauth/token": {
      "rels": [
        "token_endpoint"
      ]
    },
    "https://werd.io/micropub/endpoint": {
      "rels": [
        "micropub"
      ]
    },
    "https://granary.io/url?url=https://werd.io/content/all/&input=html&output=atom&hub=https://bridgy-fed.superfeedr.com/": {
      "rels": [
        "alternate"
      ],
      "type": "application/atom+xml"
    },
    "https://werd.io/Themes/CornmarketStreet/css/default.css": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://fonts.googleapis.com/css?family=Merriweather:300,300i,400,400i,700,700i": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://werd.io/tag/Society": {
      "rels": [
        "tag"
      ],
      "text": "#Society"
    },
    "https://werd.io/2023/where-is-abortion-legal-almost-half-of-all-americans-arent": {
      "rels": [
        "permalink"
      ],
      "text": "\nFebruary 2, 2023\n"
    },
    "https://werd.io/tag/Technology": {
      "rels": [
        "tag"
      ],
      "text": "#Technology"
    },
    "https://werd.io/2023/shotspotter-employees-not-only-have-the-power-to-alter-gunshot": {
      "rels": [
        "permalink"
      ],
      "text": "\nFebruary 2, 2023\n"
    },
    "https://werd.io/tag/Media": {
      "rels": [
        "tag"
      ],
      "text": "#Media"
    },
    "https://werd.io/2023/medias-money-problem": {
      "rels": [
        "permalink"
      ],
      "text": "\n February 2, 2023\n"
    },
    "https://werd.io/2023/reading-watching-playing-using-january-2023": {
      "rels": [
        "permalink"
      ],
      "text": "\nFebruary 1, 2023\n"
    },
    "https://werd.io/2023/which-sales-enablement-tool-powers-all-those": {
      "rels": [
        "permalink"
      ],
      "text": "\nJanuary 31, 2023\n"
    },
    "https://werd.io/2023/few-things-terrify-me-more-than-yoga": {
      "rels": [
        "permalink"
      ],
      "text": "\nJanuary 31, 2023\n"
    },
    "https://werd.io/2023/instagrams-co-founders-are-mounting-a-comeback": {
      "rels": [
        "permalink"
      ],
      "text": "\nJanuary 31, 2023\n"
    },
    "https://werd.io/tag/AI": {
      "rels": [
        "tag"
      ],
      "text": "#AI"
    },
    "https://werd.io/2023/the-generative-ai-revolution-has-begunhow-did-we-get-here": {
      "rels": [
        "permalink"
      ],
      "text": "\nJanuary 31, 2023\n"
    },
    "https://werd.io/2023/newsrooms-that-move-beyond-objectivity-can-build-trust": {
      "rels": [
        "permalink"
      ],
      "text": "\nJanuary 31, 2023\n"
    },
    "https://werd.io/tag/Democracy": {
      "rels": [
        "tag"
      ],
      "text": "#Democracy"
    },
    "https://werd.io/2023/im-flabbergasted-unc-leaders-blindsided-by-trustees-decision-on-school": {
      "rels": [
        "permalink"
      ],
      "text": "\nJanuary 31, 2023\n"
    },
    "https://werd.io/2023/women-minorities-lose-ground-in-tech-layoffs": {
      "rels": [
        "permalink"
      ],
      "text": "\nJanuary 30, 2023\n"
    },
    "https://werd.io/2023/a-vast-majority-of-americans-are-concerned-people-could-face": {
      "rels": [
        "permalink"
      ],
      "text": "\nJanuary 30, 2023\n"
    },
    "https://werd.io/2023/inside-a-us-neo-nazi-homeschool-network-with-thousands-of-members": {
      "rels": [
        "permalink"
      ],
      "text": "\nJanuary 30, 2023\n"
    },
    "https://werd.io/2023/the-tragedy-of-the-commons-is-a-false-and-dangerous": {
      "rels": [
        "permalink"
      ],
      "text": "\nJanuary 30, 2023\n"
    },
    "https://werd.io/2023/im-worried-i-have-delayed-onset-long": {
      "rels": [
        "permalink"
      ],
      "text": "\nJanuary 30, 2023\n"
    },
    "https://werd.io/2023/permission-slip": {
      "rels": [
        "permalink"
      ],
      "text": "\nJanuary 29, 2023\n"
    },
    "https://werd.io/2023/whats-the-last-book-you-read-and": {
      "rels": [
        "permalink"
      ],
      "text": "\nJanuary 29, 2023\n"
    },
    "https://werd.io/tag/Coding": {
      "rels": [
        "tag"
      ],
      "text": "#Coding"
    },
    "https://werd.io/2023/activity-streams-graphical-model": {
      "rels": [
        "permalink"
      ],
      "text": "\nJanuary 28, 2023\n"
    },
    "https://werd.io/2023/pain-of-police-killings-ripples-outward-to-traumatize-black-people": {
      "rels": [
        "permalink"
      ],
      "text": "\nJanuary 28, 2023\n"
    },
    "https://werd.io/2023/tonight": {
      "rels": [
        "permalink"
      ],
      "text": "\nJanuary 28, 2023\n"
    },
    "https://werd.io/2023/unionization-increased-by-200000-in-2022-tens-of-millions-more": {
      "rels": [
        "permalink"
      ],
      "text": "\nJanuary 28, 2023\n"
    },
    "https://werd.io/2023/us-officials-announce-plans-to-continue-pretending-brutal-state-sponsored-violence": {
      "rels": [
        "permalink"
      ],
      "text": "\nJanuary 28, 2023\n"
    },
    "https://werd.io/2023/three-years-of-the-19th-30-cities-54-employees-and": {
      "rels": [
        "permalink"
      ],
      "text": "\nJanuary 27, 2023\n"
    },
    "https://werd.io/tag/Twitter": {
      "rels": [
        "tag"
      ],
      "text": "#Twitter"
    },
    "https://werd.io/2023/elon-musks-twitter-hit-with-holocaust-denial-hate-speech-lawsuit": {
      "rels": [
        "permalink"
      ],
      "text": "\nJanuary 27, 2023\n"
    },
    "https://werd.io/2023/its-only-a-podcast-if-its-open": {
      "rels": [
        "permalink"
      ],
      "text": "\nJanuary 27, 2023\n"
    },
    "https://werd.io/?offset=0": {
      "rels": [
        "next"
      ],
      "title": "Newer",
      "text": "« Newer"
    },
    "https://werd.io/?offset=25": {
      "rels": [
        "prev"
      ],
      "title": "Older",
      "text": "Older »"
    },
    "https://werd.io/vendor/npm-asset/mediaelement/build/mediaelementplayer.min.css": {
      "rels": [
        "stylesheet"
      ]
    }
  }
}