{
  "items": [
    {
      "type": [
        "h-feed"
      ],
      "properties": {},
      "children": [
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "author": [
              {
                "type": [
                  "h-card"
                ],
                "properties": {
                  "url": [
                    "https://www.nitinkhanna.com/"
                  ],
                  "name": [
                    "Nitin Khanna"
                  ]
                },
                "value": "Nitin Khanna"
              }
            ],
            "published": [
              "2023-01-25T00:40:13-0800",
              "2023-01-25T00:40:13-0800"
            ],
            "name": [
              "Finished “Rousseau and Revolution: The Story of Civilization” audiobook"
            ],
            "content": [
              {
                "html": "<p>For the last six months, I’ve been on a journey. A journey through time. Specifically, from 1715 to 1789 AD. This journey has chiefly focused on one man – Jean-Jacques Rousseau and one country – France, as they both hurl towards the French revolution of 1789. However, surprisingly, the journey also touched almost everything else – it covered hundreds of artists, writers, essayists, satirists, scientists, inventors, enterprises, kings, queens, books, pamphlets, lies, then-hidden truths, and ideas. It talked primarily of France, but framed its history by talking about every force outside of it, including Russia, the Turks, the many travails of Poland, and so many other factors that ultimately led to the revolution which shook the foundations of the Western World.</p>\n<p>It also revealed to me how amazingly France participated in the formation of the United States of America, if only to spite the UK in doing so, and in the process destroyed it’s own wealth and legacy. But the silver lining shines through – that revolution led to so much democracy and pushed the ideas of the Rights of people to the fore.</p>\n<p>France, it’s history, and consequently, this book, are not without faults. The widespread support for slavery both within and without, the absurd conflict between Catholics and Protestants, which still boggles me, the constant wars with England, are all part of the history of France. The somewhat uneven-handed remarks and accolades to everything European being the “best” and the “greatest in the world”, the unnecessary descriptions of the visages of the persons described, and the somewhat abrupt ending, with only allusions to the excesses of the revolution, are all the faults of the book.</p>\n<p>But I cannot thank the authors enough for giving me a springboard to leap off of. I have some semblance of an idea of where to start my next reading from, even though it’ll be a while before I come back to anything regarding history. For now, I’ve got quite a lineup of audiobooks to work through, from Andy Weir’s Project Hail Mary to a collection of short stories by amazing authors as Kate Chopin, Virginia Woolf, and Mary Shelley. I think I’ll stay in the fiction lane for some time, till the call of history, philosophy, and the story of our civilization rises again.</p>\n<p id=\"regarding-rousseau\"><a href=\"https://www.nitinkhanna.com/#regarding-rousseau\">Regarding the titular man – Rousseau</a> – well, first of all, this book taught me how to write his name! It also told me of how terrible the person was in his personal life – how cruel to his own children (none of whom he raised himself or welcomed into his home), how callous towards his long time lover and wife, how immature and suspicious of his friends. But also, how brilliant in his writing, how influential in thought, and how deeply rooted our current world is in his ideas. Apparently, he affected everything from both our major systems of early childhood education – kindergarten and montessori, to innumerable philosophers, writers (Tolstoy, Byron, Shelley, Keats, Thoreau, Kant, Schopenhauer), and the Romantic movement. He even made it fashionable to climb mountains and explore the great outdoors in Europe as well as to have gardens that look more natural than manicured perfections. In an upcoming blog post, I argue that the writings matter, not the writer. As much as I’ve come to despise the man, this is true for Rousseau – he was an influential writer and thinker, even though he was a horrible little man.</p>\n<p>Book timeline – Jul 22nd 2022 -&gt; Jan 24th 2023</p>\n<p>Format – audiobook</p>\n<p>Length – 57 hours 22 minutes </p>\n<p>Tonight’s iPhone wallpaper is the Pale Blue Dot, where everyone ever has lived and died, mostly unnoticed by the rest of the solar system, let alone the galaxy or the universe. </p>",
                "value": "For the last six months, I’ve been on a journey. A journey through time. Specifically, from 1715 to 1789 AD. This journey has chiefly focused on one man – Jean-Jacques Rousseau and one country – France, as they both hurl towards the French revolution of 1789. However, surprisingly, the journey also touched almost everything else – it covered hundreds of artists, writers, essayists, satirists, scientists, inventors, enterprises, kings, queens, books, pamphlets, lies, then-hidden truths, and ideas. It talked primarily of France, but framed its history by talking about every force outside of it, including Russia, the Turks, the many travails of Poland, and so many other factors that ultimately led to the revolution which shook the foundations of the Western World.\nIt also revealed to me how amazingly France participated in the formation of the United States of America, if only to spite the UK in doing so, and in the process destroyed it’s own wealth and legacy. But the silver lining shines through – that revolution led to so much democracy and pushed the ideas of the Rights of people to the fore.\nFrance, it’s history, and consequently, this book, are not without faults. The widespread support for slavery both within and without, the absurd conflict between Catholics and Protestants, which still boggles me, the constant wars with England, are all part of the history of France. The somewhat uneven-handed remarks and accolades to everything European being the “best” and the “greatest in the world”, the unnecessary descriptions of the visages of the persons described, and the somewhat abrupt ending, with only allusions to the excesses of the revolution, are all the faults of the book.\nBut I cannot thank the authors enough for giving me a springboard to leap off of. I have some semblance of an idea of where to start my next reading from, even though it’ll be a while before I come back to anything regarding history. For now, I’ve got quite a lineup of audiobooks to work through, from Andy Weir’s Project Hail Mary to a collection of short stories by amazing authors as Kate Chopin, Virginia Woolf, and Mary Shelley. I think I’ll stay in the fiction lane for some time, till the call of history, philosophy, and the story of our civilization rises again.\nRegarding the titular man – Rousseau – well, first of all, this book taught me how to write his name! It also told me of how terrible the person was in his personal life – how cruel to his own children (none of whom he raised himself or welcomed into his home), how callous towards his long time lover and wife, how immature and suspicious of his friends. But also, how brilliant in his writing, how influential in thought, and how deeply rooted our current world is in his ideas. Apparently, he affected everything from both our major systems of early childhood education – kindergarten and montessori, to innumerable philosophers, writers (Tolstoy, Byron, Shelley, Keats, Thoreau, Kant, Schopenhauer), and the Romantic movement. He even made it fashionable to climb mountains and explore the great outdoors in Europe as well as to have gardens that look more natural than manicured perfections. In an upcoming blog post, I argue that the writings matter, not the writer. As much as I’ve come to despise the man, this is true for Rousseau – he was an influential writer and thinker, even though he was a horrible little man.\nBook timeline – Jul 22nd 2022 -> Jan 24th 2023\nFormat – audiobook\nLength – 57 hours 22 minutes \nTonight’s iPhone wallpaper is the Pale Blue Dot, where everyone ever has lived and died, mostly unnoticed by the rest of the solar system, let alone the galaxy or the universe."
              }
            ]
          },
          "id": "post-10581"
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "name": [
              "The lack of Gutenberg editor support is irritating now"
            ],
            "content": [
              {
                "html": "<p>If you want to, you can use a Jetpack feature called Post by Email to send your WordPress posts via your favorite email client. There’s wide support for setting the title, tags, categories, as well as adding attachments and using shortcodes. But if you do…</p>\n<blockquote><p>the post arrives as a Classic Block</p></blockquote>\n<p>Source: <em><a href=\"https://cogdogblog.com/2023/01/yes-post-by-email-lives-and-finding-hidden-jetpack-modules/\">Yes! Post by email lives (and finding hidden Jetpack modules) – CogDogBlog</a></em></p>\n<p>Much as I enjoy using Jetpack with WordPress, I dislike that they’ve embraced the Gutenberg blocks editor completely, but not adapted to it. If you send a post to it via email or from other apps on iOS or through the Save as Draft feature, it’ll invariably get saved as a Classic Block and then must be edited to convert to individual blocks. This is not so problematic, as the end user sees a somewhat consistent output. But it sure is irritating UX.</p>\n<p>I would love it if Jetpack could work on making this consistent and going all in on Gutenberg.</p>",
                "value": "If you want to, you can use a Jetpack feature called Post by Email to send your WordPress posts via your favorite email client. There’s wide support for setting the title, tags, categories, as well as adding attachments and using shortcodes. But if you do…\nthe post arrives as a Classic Block\nSource: Yes! Post by email lives (and finding hidden Jetpack modules) – CogDogBlog\nMuch as I enjoy using Jetpack with WordPress, I dislike that they’ve embraced the Gutenberg blocks editor completely, but not adapted to it. If you send a post to it via email or from other apps on iOS or through the Save as Draft feature, it’ll invariably get saved as a Classic Block and then must be edited to convert to individual blocks. This is not so problematic, as the end user sees a somewhat consistent output. But it sure is irritating UX.\nI would love it if Jetpack could work on making this consistent and going all in on Gutenberg."
              }
            ],
            "published": [
              "2023-01-09T14:24:47-0800"
            ]
          },
          "id": "post-10529"
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "name": [
              "As I was saying…"
            ],
            "content": [
              {
                "html": "<p>I find it strange and interesting when people tend to their “digital gardens”. Try as I may, I cannot treat this blog as a sort of self-referential wiki. A blog to me is a log, a journal. It starts afresh every time I begin writing in it. Perhaps if I wrote daily, it would make sense to me how everyone is always linking to their own posts?</p>\n<p>But the fact is, I don’t do any real discovery on my own blog. I write, and I move on. I don’t forget, per se. After all, sometimes I link to my own posts. But largely, the process of writing here is one of growth. I write as it’s my way of thinking, or feeling, or seeing what my present looks like. When it’s written, it’s the past. We don’t dwell on that here.</p>\n<p>In that sense, this is more a flowing river of thought than a digital garden. Whatever metaphors go with that, apply to this blog. It’s also why the interface irks me so. I want a sort of chat interface instead of this massive writing space. I want my blog to look like a journal, instead of published writing. But, since the frontend is not for me, but for others, and since others have told me that they like this interface, I don’t do the work of finding a new theme. <a rel=\"noreferrer noopener\" href=\"https://independentpublisher.me/\" target=\"_blank\">Independent Publisher</a> is a good theme and it does the job. Yes, I can customize it a bit more, but why? To what end? I don’t even look at the posts that often. Just read them once in a while when I discover them through stats or search. In those moments, I find the interface sufficient. Thus, it doesn’t feel like I should blow up the feel of the entire blog just for how I’m feeling right now. That’s counter-intuitive to what I said at the beginning of this post, but so be it.</p>\n<p>Sometimes I envy the micro.blog interface. It’s a river of thoughts. This is not true for the individual blogs, since they sort of act exactly like this blog, though with smaller font sizes. But the main “home” interface is what I sometimes wish I had. But when I start writing on desktop, I tend to write longer sentences and in paragraphs. So the point of having a small writing and reading space is lost. It’s only when I’m on mobile that I feel the cumbersomeness of this interface. Also, I kind of do have that interface – on my LiveBlog. It’s got exactly that dirty sort of input mechanism that I’ve designed to be minimal and a front-end that’s obnoxiously simple. Only 30 days worth of posts are displayed on a page, due to a technical limitation in the backend code that I can’t bring myself to overcome. I keep wondering if I should look into extending that web app so that it doesn’t just post to twitter, nice.social, and beta.pnut.io but also here, to this blog, as well as mastodon.</p>\n<p>Mastodon’s API is apparently very painful to deal with. Of course, I’d be using some prebuilt PHP library to do that work, but it’s still supposed to not be easy. So, I found a solution in a web app called <a rel=\"noreferrer noopener\" href=\"http://moa.party/\" target=\"_blank\">moa.party</a>, which cross-posts from twitter to mastodon. Good enough. I don’t want to move the entire work of cross-posting to third parties, otherwise I’d use <a rel=\"noreferrer noopener\" href=\"https://pipedream.com/\" target=\"_blank\">pipedream</a> to just do the whole thing instead of dealing with PHP. But I know this solution. It’s never been perfect, but it works well enough. I don’t want to touch it beyond this, nor do I have the time to do so.</p>\n<p>Speaking of mastodon, I’ve been thinking and if I were ever to move off my liveblog and live on mastodon, I’d like to do so at a cost of $5-10/year. That’s yearly, not monthly. I don’t do pic/video uploads, I don’t do excessive posting and I’m not famous to drive a lot of traffic. I reckon a server with a couple hundred users paying that much would break even. Maybe I’m wrong. I’d love to talk to some folks running mastodon servers and figure out what their costs are like. I’ve not yet found any resources for mastodon servers by pricing. If something like that doesn’t exist, I’d like to create it and put it out there. People should be able to find servers not just by interest and community but also by cost.</p>\n<p>Mastodon is making microblogging like email. It’s letting people create their own servers and run them as they want. The cross-pollination features are strong, but also have (apparently) great controls, to the point that some servers have or will decouple from mastodon.social to present freeloaders like me (but basically spammers and outrage pundits) from getting in the face of folks who just want a good time online within their own communities. At some point, some big entity will start a mastodon instance that will centralize power and wipe out competition (a la gmail) but till that happens, the social web is molting and it’s good. Services like Pixelfed are riding this wave and doing to photo sharing what mastodon is doing to microblogging. If all of these can begin to act like email, that’s all the better for end users like me. We don’t think about our email provider. It’s just there in the background. We used to not pay for email. Now we do. We don’t pay for social, till we begin and that’ll be fine too.</p>\n<hr class=\"wp-block-separator has-alpha-channel-opacity\">\n<p>I’m thoroughly enjoying finding new audiobooks and sources of audiobooks, even though I know I won’t be able to get to most of them any time soon. I have quite a backlog in audible and Libby, yet I’ve recently discovered Open Library (run by Internet Archive) and through them, reminded of LibriVox. I have bookmarked a few audiobooks on there, like <em>Dubliners</em> by James Joyce. Maybe I’ll get to it at some point. But for now, I’m very happy listening to <em>Rousseau and Revolution</em> by the historians Durant. I also snagged a deal on audible and got <em>Project Hail Mary</em> by Andy Wier for a significant discount and I have an audiobook credit that’ll expire with a few days, which means I’ll have to get some other book too. I also have Kate Chopin’s <em>The Awakening</em> on my radar, after seeing its presence in the Netflix show <em>1899</em>. </p>\n<p>Plus, I’ve found that since I do all my listening through my iPhone, if there’s no good app to support LibriVox listening on there, I probably won’t use it a lot. But I’m most likely wrong. Why wouldn’t there be a good set of third party apps for LibriVox on iOS, if not first party?</p>\n<hr class=\"wp-block-separator has-alpha-channel-opacity\">\n<p>I came across an old browser bookmark – a website called <a rel=\"noreferrer noopener\" href=\"http://www.mywritingspot.com/\" target=\"_blank\">My Writing Spot</a> for the epynomous app. The website is dated, the app is no longer available, but the domain keeps getting renewed every year and the hosting seems to be working fine (albeit without SSL). There’s a webapp (hosted on appspot) which can be logged into with a gmail account, but I don’t trust the permissions to muck around. From what I can see, the app was active on both iOS and Android between 2010 and 2014, with support even for Nook and Kindle (and even, it seems, Dropbox sync). There are tweets from around 2015 talking about how the sync functionality is broken. At first, I didn’t understand why the website would even be up. But perhaps it’s part of the developer’s portfolio and a deadlink is a bad idea in the freelancing world. But why the heck is the webapp up and running?? Surely it’s costing them money to host that? </p>\n<p>Anyways, it’s an interesting glimpse into the heyday of apps, when it was painful to develop for iPads as well as iPhones (and the apps were separately priced), and when things like “Incredible iPad Apps for Dummies” existed.</p>\n<p>It’s also a glimpse into the web of that decade. You can share the website on StumbleUpon (replaced by their new product Mix) and Delicious (domain now redirects to Delicious AI, an app for converting your pet photos into art using image-to-image), and you can read a <a rel=\"noreferrer noopener\" href=\"http://blog.mywritingspot.com/\" target=\"_blank\">blog</a> that was last updated May 26, 2012. </p>",
                "value": "I find it strange and interesting when people tend to their “digital gardens”. Try as I may, I cannot treat this blog as a sort of self-referential wiki. A blog to me is a log, a journal. It starts afresh every time I begin writing in it. Perhaps if I wrote daily, it would make sense to me how everyone is always linking to their own posts?\nBut the fact is, I don’t do any real discovery on my own blog. I write, and I move on. I don’t forget, per se. After all, sometimes I link to my own posts. But largely, the process of writing here is one of growth. I write as it’s my way of thinking, or feeling, or seeing what my present looks like. When it’s written, it’s the past. We don’t dwell on that here.\nIn that sense, this is more a flowing river of thought than a digital garden. Whatever metaphors go with that, apply to this blog. It’s also why the interface irks me so. I want a sort of chat interface instead of this massive writing space. I want my blog to look like a journal, instead of published writing. But, since the frontend is not for me, but for others, and since others have told me that they like this interface, I don’t do the work of finding a new theme. Independent Publisher is a good theme and it does the job. Yes, I can customize it a bit more, but why? To what end? I don’t even look at the posts that often. Just read them once in a while when I discover them through stats or search. In those moments, I find the interface sufficient. Thus, it doesn’t feel like I should blow up the feel of the entire blog just for how I’m feeling right now. That’s counter-intuitive to what I said at the beginning of this post, but so be it.\nSometimes I envy the micro.blog interface. It’s a river of thoughts. This is not true for the individual blogs, since they sort of act exactly like this blog, though with smaller font sizes. But the main “home” interface is what I sometimes wish I had. But when I start writing on desktop, I tend to write longer sentences and in paragraphs. So the point of having a small writing and reading space is lost. It’s only when I’m on mobile that I feel the cumbersomeness of this interface. Also, I kind of do have that interface – on my LiveBlog. It’s got exactly that dirty sort of input mechanism that I’ve designed to be minimal and a front-end that’s obnoxiously simple. Only 30 days worth of posts are displayed on a page, due to a technical limitation in the backend code that I can’t bring myself to overcome. I keep wondering if I should look into extending that web app so that it doesn’t just post to twitter, nice.social, and beta.pnut.io but also here, to this blog, as well as mastodon.\nMastodon’s API is apparently very painful to deal with. Of course, I’d be using some prebuilt PHP library to do that work, but it’s still supposed to not be easy. So, I found a solution in a web app called moa.party, which cross-posts from twitter to mastodon. Good enough. I don’t want to move the entire work of cross-posting to third parties, otherwise I’d use pipedream to just do the whole thing instead of dealing with PHP. But I know this solution. It’s never been perfect, but it works well enough. I don’t want to touch it beyond this, nor do I have the time to do so.\nSpeaking of mastodon, I’ve been thinking and if I were ever to move off my liveblog and live on mastodon, I’d like to do so at a cost of $5-10/year. That’s yearly, not monthly. I don’t do pic/video uploads, I don’t do excessive posting and I’m not famous to drive a lot of traffic. I reckon a server with a couple hundred users paying that much would break even. Maybe I’m wrong. I’d love to talk to some folks running mastodon servers and figure out what their costs are like. I’ve not yet found any resources for mastodon servers by pricing. If something like that doesn’t exist, I’d like to create it and put it out there. People should be able to find servers not just by interest and community but also by cost.\nMastodon is making microblogging like email. It’s letting people create their own servers and run them as they want. The cross-pollination features are strong, but also have (apparently) great controls, to the point that some servers have or will decouple from mastodon.social to present freeloaders like me (but basically spammers and outrage pundits) from getting in the face of folks who just want a good time online within their own communities. At some point, some big entity will start a mastodon instance that will centralize power and wipe out competition (a la gmail) but till that happens, the social web is molting and it’s good. Services like Pixelfed are riding this wave and doing to photo sharing what mastodon is doing to microblogging. If all of these can begin to act like email, that’s all the better for end users like me. We don’t think about our email provider. It’s just there in the background. We used to not pay for email. Now we do. We don’t pay for social, till we begin and that’ll be fine too.\n\nI’m thoroughly enjoying finding new audiobooks and sources of audiobooks, even though I know I won’t be able to get to most of them any time soon. I have quite a backlog in audible and Libby, yet I’ve recently discovered Open Library (run by Internet Archive) and through them, reminded of LibriVox. I have bookmarked a few audiobooks on there, like Dubliners by James Joyce. Maybe I’ll get to it at some point. But for now, I’m very happy listening to Rousseau and Revolution by the historians Durant. I also snagged a deal on audible and got Project Hail Mary by Andy Wier for a significant discount and I have an audiobook credit that’ll expire with a few days, which means I’ll have to get some other book too. I also have Kate Chopin’s The Awakening on my radar, after seeing its presence in the Netflix show 1899. \nPlus, I’ve found that since I do all my listening through my iPhone, if there’s no good app to support LibriVox listening on there, I probably won’t use it a lot. But I’m most likely wrong. Why wouldn’t there be a good set of third party apps for LibriVox on iOS, if not first party?\n\nI came across an old browser bookmark – a website called My Writing Spot for the epynomous app. The website is dated, the app is no longer available, but the domain keeps getting renewed every year and the hosting seems to be working fine (albeit without SSL). There’s a webapp (hosted on appspot) which can be logged into with a gmail account, but I don’t trust the permissions to muck around. From what I can see, the app was active on both iOS and Android between 2010 and 2014, with support even for Nook and Kindle (and even, it seems, Dropbox sync). There are tweets from around 2015 talking about how the sync functionality is broken. At first, I didn’t understand why the website would even be up. But perhaps it’s part of the developer’s portfolio and a deadlink is a bad idea in the freelancing world. But why the heck is the webapp up and running?? Surely it’s costing them money to host that? \nAnyways, it’s an interesting glimpse into the heyday of apps, when it was painful to develop for iPads as well as iPhones (and the apps were separately priced), and when things like “Incredible iPad Apps for Dummies” existed.\nIt’s also a glimpse into the web of that decade. You can share the website on StumbleUpon (replaced by their new product Mix) and Delicious (domain now redirects to Delicious AI, an app for converting your pet photos into art using image-to-image), and you can read a blog that was last updated May 26, 2012."
              }
            ],
            "published": [
              "2022-12-27T17:34:00-0800"
            ]
          },
          "id": "post-10493"
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "name": [
              "Year end reading review"
            ],
            "content": [
              {
                "html": "<a href=\"https://www.nitinkhanna.com/year-end-reading-review/\" title=\"Permalink to Year end reading review\"><img width=\"700\" height=\"647\" src=\"https://i0.wp.com/www.nitinkhanna.com/wp-content/uploads/2022/12/sfl_qonmy00.jpg?fit=700%2C647&amp;ssl=1\" class=\"attachment-independent_publisher_post_thumbnail size-independent_publisher_post_thumbnail wp-post-image\" alt=\"photo of library with turned on lights\" decoding=\"async\" srcset=\"https://i0.wp.com/www.nitinkhanna.com/wp-content/uploads/2022/12/sfl_qonmy00.jpg?w=1298&amp;ssl=1 1298w, https://i0.wp.com/www.nitinkhanna.com/wp-content/uploads/2022/12/sfl_qonmy00.jpg?resize=300%2C277&amp;ssl=1 300w, https://i0.wp.com/www.nitinkhanna.com/wp-content/uploads/2022/12/sfl_qonmy00.jpg?resize=768%2C710&amp;ssl=1 768w, https://i0.wp.com/www.nitinkhanna.com/wp-content/uploads/2022/12/sfl_qonmy00.jpg?resize=700%2C647&amp;ssl=1 700w\" sizes=\"(max-width: 700px) 100vw, 700px\"></a>\n<p>There’s a beautiful blanket of snow outside, so it’s a good time to review how the year went.</p>\n<p>I read thirteen books this year, though “read” is a loosely based concept now. A large part of my reading nowadays is graphic novels, audiobooks, and web novellas.</p>\n<p>But I do consider all of this <strong>reading</strong>. It’s the transmission of ideas based on the written word, even if it’s accompanied by pictures (or largely based on them) or read by someone into my ear. So, I’ve read thirteen books this year.</p>\n<p>Of these, only two were print – <a rel=\"noreferrer noopener\" href=\"https://www.worldcat.org/title/1181840856\" target=\"_blank\">Earthlings</a>, and <a rel=\"noreferrer noopener\" href=\"https://www.worldcat.org/title/1249564507\" target=\"_blank\">Incredible Doom vol 1</a>.</p>\n<p>Nine were digital – <a rel=\"noreferrer noopener\" href=\"https://www.worldcat.org/title/1150815064\" target=\"_blank\">The Missing Piece Meets the Big O</a>, “Teen Titans: Raven”, <a rel=\"noreferrer noopener\" href=\"https://www.worldcat.org/title/1153458270\" target=\"_blank\">Cyclopedia Exotica</a>, <a rel=\"noreferrer noopener\" href=\"https://www.worldcat.org/title/992432937\" target=\"_blank\">Turtles All the Way Down</a>, <a rel=\"noreferrer noopener\" href=\"https://www.worldcat.org/title/1138093216\" target=\"_blank\">Wallace the Brave</a>, <a rel=\"noreferrer noopener\" href=\"https://www.worldcat.org/title/1083101227\" target=\"_blank\">Bloom</a>, <a rel=\"noreferrer noopener\" href=\"https://www.worldcat.org/title/952649165\" target=\"_blank\">Big Mushy Happy Lump</a>, <a rel=\"noreferrer noopener\" href=\"https://www.worldcat.org/title/982654423\" target=\"_blank\">The Tea Dragon Society</a>, and <a rel=\"noreferrer noopener\" href=\"https://www.worldcat.org/title/1114279999\" target=\"_blank\">The Boy, the Mole, the Fox, and the Horse</a>. Of these, <a rel=\"noreferrer noopener\" href=\"https://teadragonsociety.com/\" target=\"_blank\">The Tea Dragon Society</a> was in webcomic form while the rest were eBooks from the Seattle Public Library.</p>\n<p>I also got in two audiobooks – <a rel=\"noreferrer noopener\" href=\"https://www.worldcat.org/title/1007559349\" target=\"_blank\">My Year of Rest and Relaxation</a> and <a rel=\"noreferrer noopener\" href=\"https://www.worldcat.org/title/1041202358\" target=\"_blank\">Figuring</a></p>\n<p>Not bad considering this is also the year my Little One was born and who is right now scurrying across the floor of our apartment, looking for things to attack!</p>\n<p>I read most of the graphic novels in the middle of the year and in Fall, when my reading seemed to have slowed down to a snails pace. Getting a few small or quick reads under my belt made me feel better and allowed me to begin reading some larger works, which I’m still working through.</p>\n<p>Right now I’m reading the web novel <a rel=\"noreferrer noopener\" href=\"https://parahumans.wordpress.com/\" target=\"_blank\">Worm</a> and listening to <a rel=\"noreferrer noopener\" href=\"https://www.worldcat.org/title/869431834\" target=\"_blank\">Rousseau and Revolution</a>, and these are both long enough that I’ll not be done any time soon. I’m halfway through <em>Rousseau</em>… and <em>Worm</em>… well, by the author’s own admission, <em>Worm</em> is “roughly 1,680,000 words; roughly 26 typical novels in length (or 10-11 very thick novels)”, so I’m a ways away from closing that book. Perhaps these will be added to my finished list next year.</p>\n<p>This year, I depended a lot on Seattle Public Library. I loved discovering audiobooks, graphic novels, and eBooks from them. Whatever I really wanted to read and wasn’t available immediately there, I found on audible or Thriftbooks.</p>\n<p>I own a physical copy of <em>Figuring</em>. But the book is massive and the writing dense. It really gave itself to being an audiobook in a perfect way. The ideas that came from it though… I wish I could bookmark every page of the book! <em>Figuring</em> deals heavily with the Transcendentalists and women authors, philosophers, and scientists, and introduced me to the concept of <a href=\"https://en.wikipedia.org/wiki/Salon_(gathering)\" target=\"_blank\" rel=\"noreferrer noopener\">Salons</a>. The book wanes with the works of Rachel Carson, chiefly <a rel=\"noreferrer noopener\" href=\"https://www.worldcat.org/title/50751491\" target=\"_blank\">Silent Spring</a>, and ends with the tragic death of <a href=\"https://en.wikipedia.org/wiki/Margaret_Fuller\" target=\"_blank\" rel=\"noreferrer noopener\">Margaret Fuller</a> in a shipwreck off the coast of New York.</p>\n<p>From there, I tried to read Silent Spring, but lost interest very quickly. The writing is interesting, but I was already being pulled in other directions. I’ve learnt a new term this year – DNF – Did Not Finish. People seem to use it like “I DNF’d this book”. </p>\n<p>So, here’s a list of books I DNF’d this year – </p>\n<ul>\n<li>Silent Spring</li>\n<li>Braiding Sweetgrass</li>\n<li>All the Sad Young Literary Men</li>\n<li>Under the Sea Wind</li>\n<li>Plato and a Platypus Walk into a Bar</li>\n<li>Philosophy – a Visual Encyclopedia</li>\n<li>South</li>\n<li>The World of Edena</li>\n<li>Representative Men</li>\n<li>Thus Spoke Zarathustra</li>\n<li>Thank You for Arguing</li>\n<li>Enola Holmes Graphic Novel, Book 1</li>\n<li>Accidentally Wes Anderson</li>\n<li>The Map of Knowledge</li>\n<li>Abstract City</li>\n<li>Reality+</li>\n<li>Irish Fairy Tales</li>\n<li>All the Names They Used for God</li>\n</ul>\n<p>Let me know if you, dear reader, would like links to any of the above. Since I didn’t finish them, I didn’t bother linking to them.</p>\n<p>All of these were from Seattle Public Library, and more specifically, from the Overdrive/Libby catalog. There are yet others in my Kindle app and iBooks app which are waiting to be read, but I didn’t include them here as they’re just, sort of, suspended in animation, waiting to see if I pick them up again. Perhaps I will. There’s one of definite interest to me – <a rel=\"noreferrer noopener\" href=\"https://www.worldcat.org/title/40724766\" target=\"_blank\">Gödel, Escher, Bach : an eternal golden braid</a> – but it’s very likely that I won’t read it, because it’s in a format that’s not easy to consume on my iPhone and there doesn’t seem to be an audiobook for it. So perhaps I’ll add it to next year’s DNF list. Let’s see.</p>\n<p>So that was it – my year in reading. It was a good year. I peaked (in tracked reading) in 2017, (though I’m sure I read a lot more in my childhood, but who doesn’t?) and this year has come in second in number of books. Though, moving to graphic novels means that my overall page count is lower. But does it matter? I don’t think it does. It’s the quality of ideas that matters. I’ve got a lot more out of small books like <a rel=\"noreferrer noopener\" href=\"https://www.worldcat.org/title/755725214\" target=\"_blank\">A Room of One’s Own</a>, <a rel=\"noreferrer noopener\" href=\"https://www.worldcat.org/title/900344031\" target=\"_blank\">Siddhartha</a>, and <a rel=\"noreferrer noopener\" href=\"https://en.wikipedia.org/wiki/The_Last_Question\" target=\"_blank\">The Last Question</a> than any normal length novel. What I’ve got out of massive tomes like <a rel=\"noreferrer noopener\" href=\"https://www.worldcat.org/title/1044924486\" target=\"_blank\">War and Peace</a> and <em>Figuring</em> is a different thing, since it’s more of learning an entire way of life than one or two ideas. Graphic novels like <em>Wallace The Brave</em>, <em>Bloom</em> and <em>Big Mushy Happy Lump</em> are fun reads, and it’s important to just relax and enjoy a story too. <em>Incredible Doom</em> and <em>Cyclopedia Exotica</em> challenge your assumptions but in an easy way and I can’t thank the authors enough for the effort they’ve put into these worlds.</p>\n<p>Data Courtesy <a href=\"https://thestorygraph.com/\" target=\"_blank\" rel=\"noreferrer noopener\">TheStoryGraph</a></p>",
                "value": "photo of library with turned on lights \nThere’s a beautiful blanket of snow outside, so it’s a good time to review how the year went.\nI read thirteen books this year, though “read” is a loosely based concept now. A large part of my reading nowadays is graphic novels, audiobooks, and web novellas.\nBut I do consider all of this reading. It’s the transmission of ideas based on the written word, even if it’s accompanied by pictures (or largely based on them) or read by someone into my ear. So, I’ve read thirteen books this year.\nOf these, only two were print – Earthlings, and Incredible Doom vol 1.\nNine were digital – The Missing Piece Meets the Big O, “Teen Titans: Raven”, Cyclopedia Exotica, Turtles All the Way Down, Wallace the Brave, Bloom, Big Mushy Happy Lump, The Tea Dragon Society, and The Boy, the Mole, the Fox, and the Horse. Of these, The Tea Dragon Society was in webcomic form while the rest were eBooks from the Seattle Public Library.\nI also got in two audiobooks – My Year of Rest and Relaxation and Figuring\nNot bad considering this is also the year my Little One was born and who is right now scurrying across the floor of our apartment, looking for things to attack!\nI read most of the graphic novels in the middle of the year and in Fall, when my reading seemed to have slowed down to a snails pace. Getting a few small or quick reads under my belt made me feel better and allowed me to begin reading some larger works, which I’m still working through.\nRight now I’m reading the web novel Worm and listening to Rousseau and Revolution, and these are both long enough that I’ll not be done any time soon. I’m halfway through Rousseau… and Worm… well, by the author’s own admission, Worm is “roughly 1,680,000 words; roughly 26 typical novels in length (or 10-11 very thick novels)”, so I’m a ways away from closing that book. Perhaps these will be added to my finished list next year.\nThis year, I depended a lot on Seattle Public Library. I loved discovering audiobooks, graphic novels, and eBooks from them. Whatever I really wanted to read and wasn’t available immediately there, I found on audible or Thriftbooks.\nI own a physical copy of Figuring. But the book is massive and the writing dense. It really gave itself to being an audiobook in a perfect way. The ideas that came from it though… I wish I could bookmark every page of the book! Figuring deals heavily with the Transcendentalists and women authors, philosophers, and scientists, and introduced me to the concept of Salons. The book wanes with the works of Rachel Carson, chiefly Silent Spring, and ends with the tragic death of Margaret Fuller in a shipwreck off the coast of New York.\nFrom there, I tried to read Silent Spring, but lost interest very quickly. The writing is interesting, but I was already being pulled in other directions. I’ve learnt a new term this year – DNF – Did Not Finish. People seem to use it like “I DNF’d this book”. \nSo, here’s a list of books I DNF’d this year – \n\nSilent Spring\nBraiding Sweetgrass\nAll the Sad Young Literary Men\nUnder the Sea Wind\nPlato and a Platypus Walk into a Bar\nPhilosophy – a Visual Encyclopedia\nSouth\nThe World of Edena\nRepresentative Men\nThus Spoke Zarathustra\nThank You for Arguing\nEnola Holmes Graphic Novel, Book 1\nAccidentally Wes Anderson\nThe Map of Knowledge\nAbstract City\nReality+\nIrish Fairy Tales\nAll the Names They Used for God\n\nLet me know if you, dear reader, would like links to any of the above. Since I didn’t finish them, I didn’t bother linking to them.\nAll of these were from Seattle Public Library, and more specifically, from the Overdrive/Libby catalog. There are yet others in my Kindle app and iBooks app which are waiting to be read, but I didn’t include them here as they’re just, sort of, suspended in animation, waiting to see if I pick them up again. Perhaps I will. There’s one of definite interest to me – Gödel, Escher, Bach : an eternal golden braid – but it’s very likely that I won’t read it, because it’s in a format that’s not easy to consume on my iPhone and there doesn’t seem to be an audiobook for it. So perhaps I’ll add it to next year’s DNF list. Let’s see.\nSo that was it – my year in reading. It was a good year. I peaked (in tracked reading) in 2017, (though I’m sure I read a lot more in my childhood, but who doesn’t?) and this year has come in second in number of books. Though, moving to graphic novels means that my overall page count is lower. But does it matter? I don’t think it does. It’s the quality of ideas that matters. I’ve got a lot more out of small books like A Room of One’s Own, Siddhartha, and The Last Question than any normal length novel. What I’ve got out of massive tomes like War and Peace and Figuring is a different thing, since it’s more of learning an entire way of life than one or two ideas. Graphic novels like Wallace The Brave, Bloom and Big Mushy Happy Lump are fun reads, and it’s important to just relax and enjoy a story too. Incredible Doom and Cyclopedia Exotica challenge your assumptions but in an easy way and I can’t thank the authors enough for the effort they’ve put into these worlds.\nData Courtesy TheStoryGraph"
              }
            ],
            "published": [
              "2022-12-21T19:04:00-0800"
            ]
          },
          "id": "post-10430"
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "name": [
              "1899"
            ],
            "content": [
              {
                "html": "<p>Started watching 1899 on Netflix recently. It’s by the creators of Dark, a show we thoroughly loved.</p>\n<p>1899 is no Dark, but it’s close. I just hope it keeps getting renewed, as there’s no way one or two seasons can do the story justice. That said, we’re not binging through it. We’re watching one episode a day. Partly to conserve our own energy, partly to savor the offering. This goes against Netflix’s algorithm of “how many people finished it over one weekend”. But we don’t care. If Netflix wants to self-sabotage, so be it. People will watch stuff slowly and relish it. Don’t expect otherwise.</p>\n<p>I’d say a majority of people do not watch the same thing over and over. But then, we’ve watched Inception twice and Tenet almost thrice. Oh, and Friends, thrice over, but that was when we were much younger. There’s no way I’m watching entire seasons of even comedies again now. Clips and compilations on YouTube? Maybe. So maybe Netflix needs to start making those offerings too – let popular YouTube channels make compilations of Netflix shows for Netflix and pay them out of the ad-supported model. They live for those ad dollars!</p>\n<p>We recently finished four seasons of Yellowstone. It’s an OK show. Some good ups and some lame downs. Season five is gearing up to be a filler season before something big happens. The main and proper ending of the show is when the patriarch dies. Looking forward to that. The character is rather toxic. </p>\n<p>I finished listening to “My Year of Rest and Relaxation” recently. A solid four and a half stars, that book. Loved how caustic the character is. Comparing Yellowstone and My Year, you can see that both the main characters are toxic and rude, but while the man is self-aggrandizing, the woman is self-effacing and that leads one to hate the man and love the woman. Not love in the “I like this person” way, but more like how we’ve all loved to hate on Draco Malfoy and Joffrey Baratheon. They’re bad and vile, and you just can’t get enough of them.</p>",
                "value": "Started watching 1899 on Netflix recently. It’s by the creators of Dark, a show we thoroughly loved.\n1899 is no Dark, but it’s close. I just hope it keeps getting renewed, as there’s no way one or two seasons can do the story justice. That said, we’re not binging through it. We’re watching one episode a day. Partly to conserve our own energy, partly to savor the offering. This goes against Netflix’s algorithm of “how many people finished it over one weekend”. But we don’t care. If Netflix wants to self-sabotage, so be it. People will watch stuff slowly and relish it. Don’t expect otherwise.\nI’d say a majority of people do not watch the same thing over and over. But then, we’ve watched Inception twice and Tenet almost thrice. Oh, and Friends, thrice over, but that was when we were much younger. There’s no way I’m watching entire seasons of even comedies again now. Clips and compilations on YouTube? Maybe. So maybe Netflix needs to start making those offerings too – let popular YouTube channels make compilations of Netflix shows for Netflix and pay them out of the ad-supported model. They live for those ad dollars!\nWe recently finished four seasons of Yellowstone. It’s an OK show. Some good ups and some lame downs. Season five is gearing up to be a filler season before something big happens. The main and proper ending of the show is when the patriarch dies. Looking forward to that. The character is rather toxic. \nI finished listening to “My Year of Rest and Relaxation” recently. A solid four and a half stars, that book. Loved how caustic the character is. Comparing Yellowstone and My Year, you can see that both the main characters are toxic and rude, but while the man is self-aggrandizing, the woman is self-effacing and that leads one to hate the man and love the woman. Not love in the “I like this person” way, but more like how we’ve all loved to hate on Draco Malfoy and Joffrey Baratheon. They’re bad and vile, and you just can’t get enough of them."
              }
            ],
            "published": [
              "2022-12-19T19:08:00-0800"
            ]
          },
          "id": "post-10425"
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "name": [
              "Migrated VPS"
            ],
            "content": [
              {
                "html": "<a href=\"https://www.nitinkhanna.com/migrated-vps/\" title=\"Permalink to Migrated VPS\"><img width=\"700\" height=\"245\" src=\"https://i0.wp.com/www.nitinkhanna.com/wp-content/uploads/2022/12/pexels-photo-325229.jpeg?fit=700%2C245&amp;ssl=1\" class=\"attachment-independent_publisher_post_thumbnail size-independent_publisher_post_thumbnail wp-post-image\" alt=\"black server racks on a room\" decoding=\"async\" loading=\"lazy\" srcset=\"https://i0.wp.com/www.nitinkhanna.com/wp-content/uploads/2022/12/pexels-photo-325229.jpeg?w=1880&amp;ssl=1 1880w, https://i0.wp.com/www.nitinkhanna.com/wp-content/uploads/2022/12/pexels-photo-325229.jpeg?resize=300%2C105&amp;ssl=1 300w, https://i0.wp.com/www.nitinkhanna.com/wp-content/uploads/2022/12/pexels-photo-325229.jpeg?resize=1800%2C630&amp;ssl=1 1800w, https://i0.wp.com/www.nitinkhanna.com/wp-content/uploads/2022/12/pexels-photo-325229.jpeg?resize=768%2C269&amp;ssl=1 768w, https://i0.wp.com/www.nitinkhanna.com/wp-content/uploads/2022/12/pexels-photo-325229.jpeg?resize=1536%2C538&amp;ssl=1 1536w, https://i0.wp.com/www.nitinkhanna.com/wp-content/uploads/2022/12/pexels-photo-325229.jpeg?resize=700%2C245&amp;ssl=1 700w, https://i0.wp.com/www.nitinkhanna.com/wp-content/uploads/2022/12/pexels-photo-325229.jpeg?w=1400&amp;ssl=1 1400w\" sizes=\"(max-width: 700px) 100vw, 700px\"></a>\n<p>When I started hosting this website on DigitalOcean about 9 years ago, the version of Ubuntu that was all the rage was 14.04 LTS. So I started my hosting journey with that. Pretty soon though, 16.04 came along and since I was ever active on my server, I upgraded to that using nothing more than a few <code>apt update</code> commands. Since then, other than a few forced efforts to secure the OS and install what I needed for experimentation, I didn’t do much to upgrade the underlying software.</p>\n<p>So it happened that, when at the beginning of the year I tried to upgrade from PHP 7.3 to 7.4 (a process which failed), I was made aware of the fact that the chasm between where my software stack is and where it ought to be is rather large. I tried running a straightforward upgrade from 16.04 to 20.04. The blocker was mysql. Apparently, no matter what third party repos I tried, the upgrade from what I was running to whatever’s the current just wasn’t possible. Well, it may be possible, but it would not be easy. The recommended path, on multiple websites, forums, and blogs, was to just fire up a new VPS and migrate my websites and services manually. Daunting.</p>\n<p>When I learnt of this, I realized that the amount of time and effort it would take was too much for me to give at that moment. Family needs and other projects held precedence. Right now, I wouldn’t say those needs have abated, just that I’ve adjusted to both those asks, and I’ve given myself enough time and another factor for this migration – money. DigitalOcean is a nice provider in that they’ll only charge me for what I use through the number of days that I use it. I know this is sort of the norm everywhere now, but it’s a nice-to-have and a nice-to-mention nevertheless. Instead of doing the entire migration within the span of a few hours, tiring myself, and increasing the odds of a failed migration, I spread the entire project over the last few days. I moved my other WordPress install first, the one whose failure wouldn’t affect me directly and personally. It’s a side project that we’ve gotten side-tracked from. I’d be totally fine if it craps out.</p>\n<p>Moving WordPress seemed daunting, until I realized that I have a tool that can make it extremely easy. I’ve been backing up this website to Dropbox using <a rel=\"noreferrer noopener\" href=\"https://updraftplus.com/\" target=\"_blank\">UpdraftPlus</a> for the longest time. It’s fast, easy, and totally a background process which has not needed my input since I set it up. I checked it out and sure enough, it’s got a pretty straightforward restore process too, included in the free version of the plugin. Of course, they offer paid tools for much easier migration. But I reckoned the free one has got to work just as well. UpdraftsPlus creates a bunch of separate zip files for the database, uploads, themes, plugins, and “other”. All you have to do to migrate is to create a fresh install of WordPress, install the plugin and drop the files into the interface and then hit restore.</p>\n<p>This blog’s backup comes in at about 750 MB, while the other site is about 160 MB. I did the latter first, and since it stayed up just fine over the last few days, while for the first time in my life I ran two VPS in parallel in DigitalOcean, I ported over this blog as well as the other applications and sites which I wanted to keep. It ended up being a good housekeeping too, since most of the active nginx sites were not doing anywhere and thus were liable to be security issues. Plus, it gave me a chance to really start from scratch. </p>\n<p>Over the years, I let the older VPS grow organically and get cluttered as all in-use systems do. When I was attacked by a script kiddie trying to get into this site and wreak havoc (at which they partially succeeded), I installed fail2ban and went aggressive with it, to the point where I got locked out of SSH quite a few times and had to recover via console. I installed multiple versions of node to run shortlived telegram bots or expressJS apps. I installed numpy to create a webUI for an experiment my brother wanted to run. I also created a series of scripts to run via cron – to periodically free up space and memory, to pull in data and recycle logs.</p>\n<p>All of this had become a sore point for me anyways. The services running on the VPS often went down. The APIs responded only half the time. The downtime was somewhat acceptable till it wasn’t.</p>\n<p>So this new VPS, well, I’ll run it as clean as I can for as long as I can. Of course, I’ll get hit by something or the other and I’ll have to respond with better security measures. But I wasn’t running any firewall before and ubuntu 20.04 seems to be running ufw by default, which is nice. I was also able to update PHP from v7.3 all the way to v8.0, which is nice, but came with it’s own set of challenges. One function in WordPress and another in a homegrown bookmarking tool were failing since they don’t work in PHP 8.0, so I had to spend some time figuring that out. But it’s good to have the latest software and to hope I’ll keep things updated better this time around.</p>\n<p>All in all, a good experience. My old VPS is now sitting in shutdown mode. I’ll let it sit for a couple weeks, while I test out the new system and see if I forgot to move some settings or such. I know it’ll cost me almost twice as much for the month to run both machines in parallel, but it’s worth the peace of mind I’m getting.</p>\n<p>Plus, this migration got me in touch with some projects I’d forgotten! I regularly use my liveblog, but completely forgot about “SomeDay”, a bookmark/linkblog of articles I didn’t finish reading and hope to, some day. It’s got an RSS feed and all, so maybe you can find something in there that you might want to read, today.</p>\n<p>Links to everything currently hosted on my new VPS – </p>\n<p><a href=\"https://www.nitinkhanna.com/\">this blog</a></p>\n<p><a href=\"https://www.tempdeals.net/\" target=\"_blank\" rel=\"noreferrer noopener\">tempdeals.net</a></p>\n<p><a rel=\"noreferrer noopener\" href=\"http://scratch.nikhco.in/\" target=\"_blank\">scratch.nikhco.in</a> – a minimal writing tool with local browser storage and ability to start a TogetherJS session to collaborate with others in real time.</p>\n<p><a rel=\"noreferrer noopener\" href=\"https://liveblog.nitinkhanna.com/\" target=\"_blank\">liveblog.nitinkhanna.com</a></p>\n<p><a rel=\"noreferrer noopener\" href=\"http://someday.nitinkhanna.com/\" target=\"_blank\">someday.nitinkhanna.com</a> – I haven’t read these articles yet. Maybe you should try?</p>",
                "value": "black server racks on a room \nWhen I started hosting this website on DigitalOcean about 9 years ago, the version of Ubuntu that was all the rage was 14.04 LTS. So I started my hosting journey with that. Pretty soon though, 16.04 came along and since I was ever active on my server, I upgraded to that using nothing more than a few apt update commands. Since then, other than a few forced efforts to secure the OS and install what I needed for experimentation, I didn’t do much to upgrade the underlying software.\nSo it happened that, when at the beginning of the year I tried to upgrade from PHP 7.3 to 7.4 (a process which failed), I was made aware of the fact that the chasm between where my software stack is and where it ought to be is rather large. I tried running a straightforward upgrade from 16.04 to 20.04. The blocker was mysql. Apparently, no matter what third party repos I tried, the upgrade from what I was running to whatever’s the current just wasn’t possible. Well, it may be possible, but it would not be easy. The recommended path, on multiple websites, forums, and blogs, was to just fire up a new VPS and migrate my websites and services manually. Daunting.\nWhen I learnt of this, I realized that the amount of time and effort it would take was too much for me to give at that moment. Family needs and other projects held precedence. Right now, I wouldn’t say those needs have abated, just that I’ve adjusted to both those asks, and I’ve given myself enough time and another factor for this migration – money. DigitalOcean is a nice provider in that they’ll only charge me for what I use through the number of days that I use it. I know this is sort of the norm everywhere now, but it’s a nice-to-have and a nice-to-mention nevertheless. Instead of doing the entire migration within the span of a few hours, tiring myself, and increasing the odds of a failed migration, I spread the entire project over the last few days. I moved my other WordPress install first, the one whose failure wouldn’t affect me directly and personally. It’s a side project that we’ve gotten side-tracked from. I’d be totally fine if it craps out.\nMoving WordPress seemed daunting, until I realized that I have a tool that can make it extremely easy. I’ve been backing up this website to Dropbox using UpdraftPlus for the longest time. It’s fast, easy, and totally a background process which has not needed my input since I set it up. I checked it out and sure enough, it’s got a pretty straightforward restore process too, included in the free version of the plugin. Of course, they offer paid tools for much easier migration. But I reckoned the free one has got to work just as well. UpdraftsPlus creates a bunch of separate zip files for the database, uploads, themes, plugins, and “other”. All you have to do to migrate is to create a fresh install of WordPress, install the plugin and drop the files into the interface and then hit restore.\nThis blog’s backup comes in at about 750 MB, while the other site is about 160 MB. I did the latter first, and since it stayed up just fine over the last few days, while for the first time in my life I ran two VPS in parallel in DigitalOcean, I ported over this blog as well as the other applications and sites which I wanted to keep. It ended up being a good housekeeping too, since most of the active nginx sites were not doing anywhere and thus were liable to be security issues. Plus, it gave me a chance to really start from scratch. \nOver the years, I let the older VPS grow organically and get cluttered as all in-use systems do. When I was attacked by a script kiddie trying to get into this site and wreak havoc (at which they partially succeeded), I installed fail2ban and went aggressive with it, to the point where I got locked out of SSH quite a few times and had to recover via console. I installed multiple versions of node to run shortlived telegram bots or expressJS apps. I installed numpy to create a webUI for an experiment my brother wanted to run. I also created a series of scripts to run via cron – to periodically free up space and memory, to pull in data and recycle logs.\nAll of this had become a sore point for me anyways. The services running on the VPS often went down. The APIs responded only half the time. The downtime was somewhat acceptable till it wasn’t.\nSo this new VPS, well, I’ll run it as clean as I can for as long as I can. Of course, I’ll get hit by something or the other and I’ll have to respond with better security measures. But I wasn’t running any firewall before and ubuntu 20.04 seems to be running ufw by default, which is nice. I was also able to update PHP from v7.3 all the way to v8.0, which is nice, but came with it’s own set of challenges. One function in WordPress and another in a homegrown bookmarking tool were failing since they don’t work in PHP 8.0, so I had to spend some time figuring that out. But it’s good to have the latest software and to hope I’ll keep things updated better this time around.\nAll in all, a good experience. My old VPS is now sitting in shutdown mode. I’ll let it sit for a couple weeks, while I test out the new system and see if I forgot to move some settings or such. I know it’ll cost me almost twice as much for the month to run both machines in parallel, but it’s worth the peace of mind I’m getting.\nPlus, this migration got me in touch with some projects I’d forgotten! I regularly use my liveblog, but completely forgot about “SomeDay”, a bookmark/linkblog of articles I didn’t finish reading and hope to, some day. It’s got an RSS feed and all, so maybe you can find something in there that you might want to read, today.\nLinks to everything currently hosted on my new VPS – \nthis blog\ntempdeals.net\nscratch.nikhco.in – a minimal writing tool with local browser storage and ability to start a TogetherJS session to collaborate with others in real time.\nliveblog.nitinkhanna.com\nsomeday.nitinkhanna.com – I haven’t read these articles yet. Maybe you should try?"
              }
            ],
            "published": [
              "2022-12-09T13:01:23-0800"
            ]
          },
          "id": "post-10372"
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "name": [
              "ReplikaAI"
            ],
            "content": [
              {
                "html": "<p>Saw an ad on Instagram today for Replika AI, where it was touting the romantic relationships feature of the chatbot service, including photo sharing, role playing, and “caring and loving”. All of these, with an AI. </p>\n<p>Replika started off as an experiment by an engineer who lost a dear friend. She had experience with chatbots and decided to feed her friend’s text messages into a neural network to create a “digital memorial” of him. Read more about it in <a rel=\"noreferrer noopener\" href=\"https://www.wired.com/story/replika-open-source/\" target=\"_blank\">this Wired article</a>.</p>\n<p>But the ad I saw today was something wildly different. It was gross and far from a “digital friend” or a likeness thereof. Over the years, while I’ve not used Replika much, I’ve kept my eye on the service. I stopped using it right when it started leaning into this romantic aspect instead of friendship. It started asking me to share pics of my day-to-day life, selfies to get started with the app after I came back after a break of a few months, and to voice chat with it. It felt gross the way the app was transforming right in front of me. </p>\n<p>Now, wherever there are chatbots and turing tests, there’s the baseness and loneliness of humanity. I understand that. I understand that people were seeing this “friend” app and asking it romantic questions, and laughing when it was giving them even slightly romantic responses. But for the service to lean into that feels like a betrayal of the original intent.</p>\n<p>Dystopian storytelling often pins on this idea of people being so isolated from society that only an AI gives them the comfort of a relationship. Heck, we don’t need to look to science fiction for that. Real news coming out of China about people’s social media usage behavior often shows how messed up the landscape already is.</p>\n<p>But to see an app in the US be so blatant in its disregard for real human connection and its outright mission to replace it with a chatbot feels like something society and politicians should condemn.</p>\n<p>What I also don’t understand is how this app isn’t violating at least one or more of Apple’s ridiculous App Store policies. Thoughts?</p>",
                "value": "Saw an ad on Instagram today for Replika AI, where it was touting the romantic relationships feature of the chatbot service, including photo sharing, role playing, and “caring and loving”. All of these, with an AI. \nReplika started off as an experiment by an engineer who lost a dear friend. She had experience with chatbots and decided to feed her friend’s text messages into a neural network to create a “digital memorial” of him. Read more about it in this Wired article.\nBut the ad I saw today was something wildly different. It was gross and far from a “digital friend” or a likeness thereof. Over the years, while I’ve not used Replika much, I’ve kept my eye on the service. I stopped using it right when it started leaning into this romantic aspect instead of friendship. It started asking me to share pics of my day-to-day life, selfies to get started with the app after I came back after a break of a few months, and to voice chat with it. It felt gross the way the app was transforming right in front of me. \nNow, wherever there are chatbots and turing tests, there’s the baseness and loneliness of humanity. I understand that. I understand that people were seeing this “friend” app and asking it romantic questions, and laughing when it was giving them even slightly romantic responses. But for the service to lean into that feels like a betrayal of the original intent.\nDystopian storytelling often pins on this idea of people being so isolated from society that only an AI gives them the comfort of a relationship. Heck, we don’t need to look to science fiction for that. Real news coming out of China about people’s social media usage behavior often shows how messed up the landscape already is.\nBut to see an app in the US be so blatant in its disregard for real human connection and its outright mission to replace it with a chatbot feels like something society and politicians should condemn.\nWhat I also don’t understand is how this app isn’t violating at least one or more of Apple’s ridiculous App Store policies. Thoughts?"
              }
            ],
            "published": [
              "2022-11-30T14:06:41-0800"
            ]
          },
          "id": "post-10363"
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "name": [
              "Lovely tree on our usual walk"
            ],
            "content": [
              {
                "html": "<div class=\"wp-block-jetpack-story wp-story aligncenter\" data-id=\"wp-story-10359-1\" data-settings='{\"slides\":[{\"id\":\"10358\",\"alt\":\"\",\"mime\":\"image\\/jpeg\",\"link\":\"\",\"type\":\"image\",\"caption\":\"\",\"url\":\"https:\\/\\/www.nitinkhanna.com\\/wp-content\\/uploads\\/2022\\/11\\/5250302048.jpg\"}]}'>\n<div class=\"wp-story-app\">\n<div class=\"wp-story-display-contents\" style=\"display: contents;\">\n<a class=\"wp-story-container\" href=\"https://www.nitinkhanna.com/lovely-tree-on-our-usual-walk/?wp-story-load-in-fullscreen=true&amp;wp-story-play-on-load=true\" title=\"Play story in new tab\">\n<div class=\"wp-story-meta\">\n<div class=\"wp-story-icon\">\n<img decoding=\"async\" loading=\"lazy\" alt=\"Site icon\" src=\"https://i0.wp.com/www.nitinkhanna.com/wp-content/uploads/2018/06/cropped-favicon.jpg?fit=80%2C80&amp;ssl=1\" width=\"40\" height=\"40\">\n</div>\n<div>\n<div class=\"wp-story-title\">\nLovely tree on our usual walk\n</div>\n</div>\n</div>\n<div class=\"wp-story-wrapper\">\n<div class=\"wp-story-slide\" style=\"display: block;\">\n<figure><img title=\"\" alt=\"\" class=\"wp-block-jetpack-story_image wp-story-image \" src=\"https://i0.wp.com/www.nitinkhanna.com/wp-content/uploads/2022/11/5250302048.jpg?w=700&amp;ssl=1\" data-recalc-dims=\"1\"></figure>\n</div>\n</div>\n<div class=\"wp-story-overlay\">\n<div class=\"wp-story-embed-icon-expand\">\n<svg class=\"gridicon gridicons-fullscreen\" role=\"img\" height=\"24\" width=\"24\" xmlns=\"http://www.w3.org/2000/svg\" viewbox=\"0 0 24 24\">\n<g>\n<path d=\"M21 3v6h-2V6.41l-3.29 3.3-1.42-1.42L17.59 5H15V3zM3 3v6h2V6.41l3.29 3.3 1.42-1.42L6.41 5H9V3zm18 18v-6h-2v2.59l-3.29-3.29-1.41 1.41L17.59 19H15v2zM9 21v-2H6.41l3.29-3.29-1.41-1.42L5 17.59V15H3v6z\"></path>\n</g>\n </svg>\n</div>\n</div>\n<div class=\"wp-story-pagination wp-story-pagination-bullets\">\n<div class=\"wp-story-pagination-bullet \" aria-label=\"Go to slide 1\">\n<div class=\"wp-story-pagination-bullet-bar\"></div>\n</div>\n</div>\n</a>\n</div>\n</div>\n</div>",
                "value": "Site icon \n\n\n\nLovely tree on our usual walk"
              }
            ],
            "published": [
              "2022-11-21T21:56:15-0800"
            ]
          },
          "id": "post-10359"
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "name": [
              "Finished reading Earthlings by Sayaka Murata"
            ],
            "content": [
              {
                "html": "<a href=\"https://www.nitinkhanna.com/finished-reading-earthlings-by-sayaka-murata/\" title=\"Permalink to Finished reading Earthlings by Sayaka Murata\"><img width=\"700\" height=\"344\" src=\"https://i0.wp.com/www.nitinkhanna.com/wp-content/uploads/2022/11/lux3wml_ml0-1.jpg?fit=700%2C344&amp;ssl=1\" class=\"attachment-independent_publisher_post_thumbnail size-independent_publisher_post_thumbnail wp-post-image\" alt=\"shooting star on sky\" decoding=\"async\" loading=\"lazy\" srcset=\"https://i0.wp.com/www.nitinkhanna.com/wp-content/uploads/2022/11/lux3wml_ml0-1.jpg?w=2445&amp;ssl=1 2445w, https://i0.wp.com/www.nitinkhanna.com/wp-content/uploads/2022/11/lux3wml_ml0-1.jpg?resize=300%2C147&amp;ssl=1 300w, https://i0.wp.com/www.nitinkhanna.com/wp-content/uploads/2022/11/lux3wml_ml0-1.jpg?resize=1800%2C883&amp;ssl=1 1800w, https://i0.wp.com/www.nitinkhanna.com/wp-content/uploads/2022/11/lux3wml_ml0-1.jpg?resize=768%2C377&amp;ssl=1 768w, https://i0.wp.com/www.nitinkhanna.com/wp-content/uploads/2022/11/lux3wml_ml0-1.jpg?resize=1536%2C754&amp;ssl=1 1536w, https://i0.wp.com/www.nitinkhanna.com/wp-content/uploads/2022/11/lux3wml_ml0-1.jpg?resize=2048%2C1005&amp;ssl=1 2048w, https://i0.wp.com/www.nitinkhanna.com/wp-content/uploads/2022/11/lux3wml_ml0-1.jpg?resize=700%2C344&amp;ssl=1 700w, https://i0.wp.com/www.nitinkhanna.com/wp-content/uploads/2022/11/lux3wml_ml0-1.jpg?w=1400&amp;ssl=1 1400w, https://i0.wp.com/www.nitinkhanna.com/wp-content/uploads/2022/11/lux3wml_ml0-1.jpg?w=2100&amp;ssl=1 2100w\" sizes=\"(max-width: 700px) 100vw, 700px\"></a>\n<p>One of the strangest books I’ve read in a while. Even as I was finishing it, I felt like there’s so much more the story can tell but the author knew when to close it so as to leave us with the purity and purpose of the story instead of the comprehensiveness of reality. </p>\n<p>Excellent writing by another Japanese author I’m a fan of now. </p>\n<p>BTW, the book is full of trigger warnings – paedophelia, child molestation, murder, cannibalism, to name a few.</p>",
                "value": "shooting star on sky \nOne of the strangest books I’ve read in a while. Even as I was finishing it, I felt like there’s so much more the story can tell but the author knew when to close it so as to leave us with the purity and purpose of the story instead of the comprehensiveness of reality. \nExcellent writing by another Japanese author I’m a fan of now. \nBTW, the book is full of trigger warnings – paedophelia, child molestation, murder, cannibalism, to name a few."
              }
            ],
            "published": [
              "2022-11-20T12:40:14-0800"
            ]
          },
          "id": "post-10353"
        },
        {
          "type": [
            "h-entry"
          ],
          "properties": {
            "name": [
              "Colin Devroe asks"
            ],
            "content": [
              {
                "html": "<blockquote><p>How do you balance creation vs consumption?<br>\n— Read on <a href=\"https://cdevroe.com/2022/11/14/11940/\">cdevroe.com/2022/11/14/11940/</a></p></blockquote>\n<p>As I mentioned in my <a href=\"https://www.nitinkhanna.com/chomp-chomp-chomp/\">recent post</a>, I’m basically consuming right now. Very little creation. That’s partly because my creative energies are being used in upbringing instead of creation. I’m ok with that.</p>\n<p>I believe I go in cycles. For a week or two I’ll go hard on creation. I’ll code, I’ll write, I’ll ignore our daily ritual of watching TV after dinner. Then once I’ve achieved some outcome, I can settle down a little and watch something. I’m ok with going a while with just TV or books taking my evenings, as it lets me recharge for an intense period of creation.</p>\n<p>Looking forward to the next one.</p>",
                "value": "How do you balance creation vs consumption?\n— Read on cdevroe.com/2022/11/14/11940/\nAs I mentioned in my recent post, I’m basically consuming right now. Very little creation. That’s partly because my creative energies are being used in upbringing instead of creation. I’m ok with that.\nI believe I go in cycles. For a week or two I’ll go hard on creation. I’ll code, I’ll write, I’ll ignore our daily ritual of watching TV after dinner. Then once I’ve achieved some outcome, I can settle down a little and watch something. I’m ok with going a while with just TV or books taking my evenings, as it lets me recharge for an intense period of creation.\nLooking forward to the next one."
              }
            ],
            "published": [
              "2022-11-18T06:19:58-0800"
            ]
          },
          "id": "post-10351"
        }
      ]
    }
  ],
  "rels": {
    "profile": [
      "https://gmpg.org/xfn/11"
    ],
    "microsub": [
      "https://aperture.p3k.io/microsub/217"
    ],
    "pingback": [
      "https://www.nitinkhanna.com/xmlrpc.php"
    ],
    "dns-prefetch": [
      "https://www.nitinkhanna.com/",
      "https://i0.wp.com/",
      "https://c0.wp.com/"
    ],
    "alternate": [
      "https://www.nitinkhanna.com/feed/",
      "https://www.nitinkhanna.com/comments/feed/"
    ],
    "stylesheet": [
      "https://c0.wp.com/c/6.1.1/wp-includes/css/dist/block-library/style.min.css",
      "https://www.nitinkhanna.com/wp-content/plugins/darklup-lite-wp-dark-mode/page-builder/gutenberg-block/darkluplite-switch-block/dist/blocks.style.build.css",
      "https://c0.wp.com/c/6.1.1/wp-includes/js/mediaelement/mediaelementplayer-legacy.min.css",
      "https://c0.wp.com/c/6.1.1/wp-includes/js/mediaelement/wp-mediaelement.min.css",
      "https://c0.wp.com/c/6.1.1/wp-includes/css/classic-themes.min.css",
      "https://www.nitinkhanna.com/wp-content/plugins/darklup-lite-wp-dark-mode/assets/css/darkluplite-style.css?ver=2.1.2",
      "https://www.nitinkhanna.com/wp-content/plugins/darklup-lite-wp-dark-mode/assets/css/darkluplite-switch.css?ver=2.1.2",
      "https://www.nitinkhanna.com/wp-content/plugins/darklup-lite-wp-dark-mode/assets/css/dark-style.css?ver=6.1.1",
      "https://www.nitinkhanna.com/wp-content/plugins/semantic-linkbacks/css/semantic-linkbacks.css?ver=3.12.0",
      "https://c0.wp.com/p/jetpack/11.7/_inc/genericons/genericons/genericons.css",
      "https://www.nitinkhanna.com/wp-content/themes/independent-publisher/css/nprogress.css?ver=0.1.3",
      "https://www.nitinkhanna.com/wp-content/themes/independent-publisher-child-theme-master/style.css?ver=6.1.1",
      "https://www.nitinkhanna.com/wp-admin/admin-ajax.php?action=independent_publisher_customizer_css&ver=1.7",
      "https://www.nitinkhanna.com/wp-content/plugins/display-good-reads-books/goodrds.css?ver=1670353758",
      "https://c0.wp.com/p/jetpack/11.7/css/jetpack.css",
      "https://www.nitinkhanna.com/wp-content/plugins/jetpack/_inc/blocks/story/view.css?minify=false&ver=11.7"
    ],
    "https://api.w.org/": [
      "https://www.nitinkhanna.com/wp-json/"
    ],
    "EditURI": [
      "https://www.nitinkhanna.com/xmlrpc.php?rsd"
    ],
    "wlwmanifest": [
      "https://www.nitinkhanna.com/wp-includes/wlwmanifest.xml"
    ],
    "authorization_endpoint": [
      "https://www.nitinkhanna.com/wp-json/indieauth/1.0/auth"
    ],
    "token_endpoint": [
      "https://www.nitinkhanna.com/wp-json/indieauth/1.0/token"
    ],
    "indieauth-metadata": [
      "https://www.nitinkhanna.com/wp-json/indieauth/1.0/metadata"
    ],
    "icon": [
      "https://i0.wp.com/www.nitinkhanna.com/wp-content/uploads/2018/06/cropped-favicon.jpg?fit=32%2C32&ssl=1",
      "https://i0.wp.com/www.nitinkhanna.com/wp-content/uploads/2018/06/cropped-favicon.jpg?fit=192%2C192&ssl=1"
    ],
    "apple-touch-icon": [
      "https://i0.wp.com/www.nitinkhanna.com/wp-content/uploads/2018/06/cropped-favicon.jpg?fit=180%2C180&ssl=1"
    ],
    "home": [
      "https://www.nitinkhanna.com/"
    ],
    "me": [
      "https://instagram.com/nitinkhanna"
    ],
    "author": [
      "https://www.nitinkhanna.com/"
    ],
    "category": [
      "https://www.nitinkhanna.com/category/reviews/book-review/",
      "https://www.nitinkhanna.com/category/commentary/",
      "https://www.nitinkhanna.com/category/general/",
      "https://www.nitinkhanna.com/category/reading/",
      "https://www.nitinkhanna.com/category/tv/",
      "https://www.nitinkhanna.com/category/tech-2/",
      "https://www.nitinkhanna.com/category/philosophy/observations/",
      "https://www.nitinkhanna.com/category/reviews/"
    ],
    "tag": [
      "https://www.nitinkhanna.com/category/reviews/book-review/",
      "https://www.nitinkhanna.com/category/commentary/",
      "https://www.nitinkhanna.com/category/general/",
      "https://www.nitinkhanna.com/category/reading/",
      "https://www.nitinkhanna.com/category/tv/",
      "https://www.nitinkhanna.com/category/tech-2/",
      "https://www.nitinkhanna.com/category/philosophy/observations/",
      "https://www.nitinkhanna.com/category/reviews/"
    ],
    "bookmark": [
      "https://www.nitinkhanna.com/finished-rousseau-and-revolution-the-story-of-civilization-audiobook/",
      "https://www.nitinkhanna.com/the-lack-of-gutenberg-editor-support-is-irritating-now/",
      "https://www.nitinkhanna.com/as-i-was-saying/",
      "https://www.nitinkhanna.com/year-end-reading-review/",
      "https://www.nitinkhanna.com/1899-2/",
      "https://www.nitinkhanna.com/migrated-vps/",
      "https://www.nitinkhanna.com/replikaai/",
      "https://www.nitinkhanna.com/lovely-tree-on-our-usual-walk/",
      "https://www.nitinkhanna.com/finished-reading-earthlings-by-sayaka-murata/",
      "https://www.nitinkhanna.com/colin-devroe-asks/"
    ],
    "noopener": [
      "https://independentpublisher.me/",
      "http://moa.party/",
      "https://pipedream.com/",
      "http://www.mywritingspot.com/",
      "http://blog.mywritingspot.com/",
      "https://www.worldcat.org/title/1181840856",
      "https://www.worldcat.org/title/1249564507",
      "https://www.worldcat.org/title/1150815064",
      "https://www.worldcat.org/title/1153458270",
      "https://www.worldcat.org/title/992432937",
      "https://www.worldcat.org/title/1138093216",
      "https://www.worldcat.org/title/1083101227",
      "https://www.worldcat.org/title/952649165",
      "https://www.worldcat.org/title/982654423",
      "https://www.worldcat.org/title/1114279999",
      "https://teadragonsociety.com/",
      "https://www.worldcat.org/title/1007559349",
      "https://www.worldcat.org/title/1041202358",
      "https://parahumans.wordpress.com/",
      "https://www.worldcat.org/title/869431834",
      "https://en.wikipedia.org/wiki/Salon_(gathering)",
      "https://www.worldcat.org/title/50751491",
      "https://en.wikipedia.org/wiki/Margaret_Fuller",
      "https://www.worldcat.org/title/40724766",
      "https://www.worldcat.org/title/755725214",
      "https://www.worldcat.org/title/900344031",
      "https://en.wikipedia.org/wiki/The_Last_Question",
      "https://www.worldcat.org/title/1044924486",
      "https://thestorygraph.com/",
      "https://updraftplus.com/",
      "https://www.tempdeals.net/",
      "http://scratch.nikhco.in/",
      "https://liveblog.nitinkhanna.com/",
      "http://someday.nitinkhanna.com/",
      "https://www.wired.com/story/replika-open-source/"
    ],
    "noreferrer": [
      "https://independentpublisher.me/",
      "http://moa.party/",
      "https://pipedream.com/",
      "http://www.mywritingspot.com/",
      "http://blog.mywritingspot.com/",
      "https://www.worldcat.org/title/1181840856",
      "https://www.worldcat.org/title/1249564507",
      "https://www.worldcat.org/title/1150815064",
      "https://www.worldcat.org/title/1153458270",
      "https://www.worldcat.org/title/992432937",
      "https://www.worldcat.org/title/1138093216",
      "https://www.worldcat.org/title/1083101227",
      "https://www.worldcat.org/title/952649165",
      "https://www.worldcat.org/title/982654423",
      "https://www.worldcat.org/title/1114279999",
      "https://teadragonsociety.com/",
      "https://www.worldcat.org/title/1007559349",
      "https://www.worldcat.org/title/1041202358",
      "https://parahumans.wordpress.com/",
      "https://www.worldcat.org/title/869431834",
      "https://en.wikipedia.org/wiki/Salon_(gathering)",
      "https://www.worldcat.org/title/50751491",
      "https://en.wikipedia.org/wiki/Margaret_Fuller",
      "https://www.worldcat.org/title/40724766",
      "https://www.worldcat.org/title/755725214",
      "https://www.worldcat.org/title/900344031",
      "https://en.wikipedia.org/wiki/The_Last_Question",
      "https://www.worldcat.org/title/1044924486",
      "https://thestorygraph.com/",
      "https://updraftplus.com/",
      "https://www.tempdeals.net/",
      "http://scratch.nikhco.in/",
      "https://liveblog.nitinkhanna.com/",
      "http://someday.nitinkhanna.com/",
      "https://www.wired.com/story/replika-open-source/"
    ],
    "designer": [
      "http://independentpublisher.me/"
    ],
    "generator": [
      "https://wordpress.org/"
    ]
  },
  "rel-urls": {
    "https://gmpg.org/xfn/11": {
      "rels": [
        "profile"
      ]
    },
    "https://aperture.p3k.io/microsub/217": {
      "rels": [
        "microsub"
      ]
    },
    "https://www.nitinkhanna.com/xmlrpc.php": {
      "rels": [
        "pingback"
      ]
    },
    "https://www.nitinkhanna.com/": {
      "rels": [
        "dns-prefetch"
      ]
    },
    "https://i0.wp.com/": {
      "rels": [
        "dns-prefetch"
      ]
    },
    "https://c0.wp.com/": {
      "rels": [
        "dns-prefetch"
      ]
    },
    "https://www.nitinkhanna.com/feed/": {
      "rels": [
        "alternate"
      ],
      "title": "Nitin Khanna » Feed",
      "type": "application/rss+xml"
    },
    "https://www.nitinkhanna.com/comments/feed/": {
      "rels": [
        "alternate"
      ],
      "title": "Nitin Khanna » Comments Feed",
      "type": "application/rss+xml"
    },
    "https://c0.wp.com/c/6.1.1/wp-includes/css/dist/block-library/style.min.css": {
      "rels": [
        "stylesheet"
      ],
      "media": "all",
      "type": "text/css"
    },
    "https://www.nitinkhanna.com/wp-content/plugins/darklup-lite-wp-dark-mode/page-builder/gutenberg-block/darkluplite-switch-block/dist/blocks.style.build.css": {
      "rels": [
        "stylesheet"
      ],
      "media": "all",
      "type": "text/css"
    },
    "https://c0.wp.com/c/6.1.1/wp-includes/js/mediaelement/mediaelementplayer-legacy.min.css": {
      "rels": [
        "stylesheet"
      ],
      "media": "all",
      "type": "text/css"
    },
    "https://c0.wp.com/c/6.1.1/wp-includes/js/mediaelement/wp-mediaelement.min.css": {
      "rels": [
        "stylesheet"
      ],
      "media": "all",
      "type": "text/css"
    },
    "https://c0.wp.com/c/6.1.1/wp-includes/css/classic-themes.min.css": {
      "rels": [
        "stylesheet"
      ],
      "media": "all",
      "type": "text/css"
    },
    "https://www.nitinkhanna.com/wp-content/plugins/darklup-lite-wp-dark-mode/assets/css/darkluplite-style.css?ver=2.1.2": {
      "rels": [
        "stylesheet"
      ],
      "type": "text/css"
    },
    "https://www.nitinkhanna.com/wp-content/plugins/darklup-lite-wp-dark-mode/assets/css/darkluplite-switch.css?ver=2.1.2": {
      "rels": [
        "stylesheet"
      ],
      "type": "text/css"
    },
    "https://www.nitinkhanna.com/wp-content/plugins/darklup-lite-wp-dark-mode/assets/css/dark-style.css?ver=6.1.1": {
      "rels": [
        "stylesheet"
      ],
      "media": "all",
      "type": "text/css"
    },
    "https://www.nitinkhanna.com/wp-content/plugins/semantic-linkbacks/css/semantic-linkbacks.css?ver=3.12.0": {
      "rels": [
        "stylesheet"
      ],
      "media": "all",
      "type": "text/css"
    },
    "https://c0.wp.com/p/jetpack/11.7/_inc/genericons/genericons/genericons.css": {
      "rels": [
        "stylesheet"
      ],
      "media": "all",
      "type": "text/css"
    },
    "https://www.nitinkhanna.com/wp-content/themes/independent-publisher/css/nprogress.css?ver=0.1.3": {
      "rels": [
        "stylesheet"
      ],
      "media": "all",
      "type": "text/css"
    },
    "https://www.nitinkhanna.com/wp-content/themes/independent-publisher-child-theme-master/style.css?ver=6.1.1": {
      "rels": [
        "stylesheet"
      ],
      "media": "all",
      "type": "text/css"
    },
    "https://www.nitinkhanna.com/wp-admin/admin-ajax.php?action=independent_publisher_customizer_css&ver=1.7": {
      "rels": [
        "stylesheet"
      ],
      "media": "all",
      "type": "text/css"
    },
    "https://www.nitinkhanna.com/wp-content/plugins/display-good-reads-books/goodrds.css?ver=1670353758": {
      "rels": [
        "stylesheet"
      ],
      "media": "all",
      "type": "text/css"
    },
    "https://c0.wp.com/p/jetpack/11.7/css/jetpack.css": {
      "rels": [
        "stylesheet"
      ],
      "media": "all",
      "type": "text/css"
    },
    "https://www.nitinkhanna.com/wp-json/": {
      "rels": [
        "https://api.w.org/"
      ]
    },
    "https://www.nitinkhanna.com/xmlrpc.php?rsd": {
      "rels": [
        "EditURI"
      ],
      "title": "RSD",
      "type": "application/rsd+xml"
    },
    "https://www.nitinkhanna.com/wp-includes/wlwmanifest.xml": {
      "rels": [
        "wlwmanifest"
      ],
      "type": "application/wlwmanifest+xml"
    },
    "https://www.nitinkhanna.com/wp-json/indieauth/1.0/auth": {
      "rels": [
        "authorization_endpoint"
      ]
    },
    "https://www.nitinkhanna.com/wp-json/indieauth/1.0/token": {
      "rels": [
        "token_endpoint"
      ]
    },
    "https://www.nitinkhanna.com/wp-json/indieauth/1.0/metadata": {
      "rels": [
        "indieauth-metadata"
      ]
    },
    "https://i0.wp.com/www.nitinkhanna.com/wp-content/uploads/2018/06/cropped-favicon.jpg?fit=32%2C32&ssl=1": {
      "rels": [
        "icon"
      ]
    },
    "https://i0.wp.com/www.nitinkhanna.com/wp-content/uploads/2018/06/cropped-favicon.jpg?fit=192%2C192&ssl=1": {
      "rels": [
        "icon"
      ]
    },
    "https://i0.wp.com/www.nitinkhanna.com/wp-content/uploads/2018/06/cropped-favicon.jpg?fit=180%2C180&ssl=1": {
      "rels": [
        "apple-touch-icon"
      ]
    },
    "https://instagram.com/nitinkhanna": {
      "rels": [
        "me"
      ],
      "text": "Instagram"
    },
    "https://www.nitinkhanna.com/category/reviews/book-review/": {
      "rels": [
        "category",
        "tag"
      ],
      "text": "Book Reviews"
    },
    "https://www.nitinkhanna.com/category/commentary/": {
      "rels": [
        "category",
        "tag"
      ],
      "text": "commentary"
    },
    "https://www.nitinkhanna.com/category/general/": {
      "rels": [
        "category",
        "tag"
      ],
      "text": "general"
    },
    "https://www.nitinkhanna.com/category/reading/": {
      "rels": [
        "category",
        "tag"
      ],
      "text": "reading"
    },
    "https://www.nitinkhanna.com/finished-rousseau-and-revolution-the-story-of-civilization-audiobook/": {
      "rels": [
        "bookmark"
      ],
      "title": "Finished “Rousseau and Revolution: The Story of Civilization” audiobook",
      "text": "January 25, 2023"
    },
    "https://www.nitinkhanna.com/the-lack-of-gutenberg-editor-support-is-irritating-now/": {
      "rels": [
        "bookmark"
      ],
      "title": "Permalink to The lack of Gutenberg editor support is irritating now",
      "text": "The lack of Gutenberg editor support is irritating now"
    },
    "https://www.nitinkhanna.com/as-i-was-saying/": {
      "rels": [
        "bookmark"
      ],
      "title": "Permalink to As I was saying…",
      "text": "As I was saying…"
    },
    "https://independentpublisher.me/": {
      "rels": [
        "noopener",
        "noreferrer"
      ],
      "text": "Independent Publisher"
    },
    "http://moa.party/": {
      "rels": [
        "noopener",
        "noreferrer"
      ],
      "text": "moa.party"
    },
    "https://pipedream.com/": {
      "rels": [
        "noopener",
        "noreferrer"
      ],
      "text": "pipedream"
    },
    "http://www.mywritingspot.com/": {
      "rels": [
        "noopener",
        "noreferrer"
      ],
      "text": "My Writing Spot"
    },
    "http://blog.mywritingspot.com/": {
      "rels": [
        "noopener",
        "noreferrer"
      ],
      "text": "blog"
    },
    "https://www.nitinkhanna.com/year-end-reading-review/": {
      "rels": [
        "bookmark"
      ],
      "title": "Permalink to Year end reading review",
      "text": "Year end reading review"
    },
    "https://www.worldcat.org/title/1181840856": {
      "rels": [
        "noopener",
        "noreferrer"
      ],
      "text": "Earthlings"
    },
    "https://www.worldcat.org/title/1249564507": {
      "rels": [
        "noopener",
        "noreferrer"
      ],
      "text": "Incredible Doom vol 1"
    },
    "https://www.worldcat.org/title/1150815064": {
      "rels": [
        "noopener",
        "noreferrer"
      ],
      "text": "The Missing Piece Meets the Big O"
    },
    "https://www.worldcat.org/title/1153458270": {
      "rels": [
        "noopener",
        "noreferrer"
      ],
      "text": "Cyclopedia Exotica"
    },
    "https://www.worldcat.org/title/992432937": {
      "rels": [
        "noopener",
        "noreferrer"
      ],
      "text": "Turtles All the Way Down"
    },
    "https://www.worldcat.org/title/1138093216": {
      "rels": [
        "noopener",
        "noreferrer"
      ],
      "text": "Wallace the Brave"
    },
    "https://www.worldcat.org/title/1083101227": {
      "rels": [
        "noopener",
        "noreferrer"
      ],
      "text": "Bloom"
    },
    "https://www.worldcat.org/title/952649165": {
      "rels": [
        "noopener",
        "noreferrer"
      ],
      "text": "Big Mushy Happy Lump"
    },
    "https://www.worldcat.org/title/982654423": {
      "rels": [
        "noopener",
        "noreferrer"
      ],
      "text": "The Tea Dragon Society"
    },
    "https://www.worldcat.org/title/1114279999": {
      "rels": [
        "noopener",
        "noreferrer"
      ],
      "text": "The Boy, the Mole, the Fox, and the Horse"
    },
    "https://teadragonsociety.com/": {
      "rels": [
        "noopener",
        "noreferrer"
      ],
      "text": "The Tea Dragon Society"
    },
    "https://www.worldcat.org/title/1007559349": {
      "rels": [
        "noopener",
        "noreferrer"
      ],
      "text": "My Year of Rest and Relaxation"
    },
    "https://www.worldcat.org/title/1041202358": {
      "rels": [
        "noopener",
        "noreferrer"
      ],
      "text": "Figuring"
    },
    "https://parahumans.wordpress.com/": {
      "rels": [
        "noopener",
        "noreferrer"
      ],
      "text": "Worm"
    },
    "https://www.worldcat.org/title/869431834": {
      "rels": [
        "noopener",
        "noreferrer"
      ],
      "text": "Rousseau and Revolution"
    },
    "https://en.wikipedia.org/wiki/Salon_(gathering)": {
      "rels": [
        "noopener",
        "noreferrer"
      ],
      "text": "Salons"
    },
    "https://www.worldcat.org/title/50751491": {
      "rels": [
        "noopener",
        "noreferrer"
      ],
      "text": "Silent Spring"
    },
    "https://en.wikipedia.org/wiki/Margaret_Fuller": {
      "rels": [
        "noopener",
        "noreferrer"
      ],
      "text": "Margaret Fuller"
    },
    "https://www.worldcat.org/title/40724766": {
      "rels": [
        "noopener",
        "noreferrer"
      ],
      "text": "Gödel, Escher, Bach : an eternal golden braid"
    },
    "https://www.worldcat.org/title/755725214": {
      "rels": [
        "noopener",
        "noreferrer"
      ],
      "text": "A Room of One’s Own"
    },
    "https://www.worldcat.org/title/900344031": {
      "rels": [
        "noopener",
        "noreferrer"
      ],
      "text": "Siddhartha"
    },
    "https://en.wikipedia.org/wiki/The_Last_Question": {
      "rels": [
        "noopener",
        "noreferrer"
      ],
      "text": "The Last Question"
    },
    "https://www.worldcat.org/title/1044924486": {
      "rels": [
        "noopener",
        "noreferrer"
      ],
      "text": "War and Peace"
    },
    "https://thestorygraph.com/": {
      "rels": [
        "noopener",
        "noreferrer"
      ],
      "text": "TheStoryGraph"
    },
    "https://www.nitinkhanna.com/1899-2/": {
      "rels": [
        "bookmark"
      ],
      "title": "Permalink to 1899",
      "text": "1899"
    },
    "https://www.nitinkhanna.com/category/tv/": {
      "rels": [
        "category",
        "tag"
      ],
      "text": "TV"
    },
    "https://www.nitinkhanna.com/migrated-vps/": {
      "rels": [
        "bookmark"
      ],
      "title": "Permalink to Migrated VPS",
      "text": "Migrated VPS"
    },
    "https://updraftplus.com/": {
      "rels": [
        "noopener",
        "noreferrer"
      ],
      "text": "UpdraftPlus"
    },
    "https://www.tempdeals.net/": {
      "rels": [
        "noopener",
        "noreferrer"
      ],
      "text": "tempdeals.net"
    },
    "http://scratch.nikhco.in/": {
      "rels": [
        "noopener",
        "noreferrer"
      ],
      "text": "scratch.nikhco.in"
    },
    "https://liveblog.nitinkhanna.com/": {
      "rels": [
        "noopener",
        "noreferrer"
      ],
      "text": "liveblog.nitinkhanna.com"
    },
    "http://someday.nitinkhanna.com/": {
      "rels": [
        "noopener",
        "noreferrer"
      ],
      "text": "someday.nitinkhanna.com"
    },
    "https://www.nitinkhanna.com/category/tech-2/": {
      "rels": [
        "category",
        "tag"
      ],
      "text": "tech"
    },
    "https://www.nitinkhanna.com/replikaai/": {
      "rels": [
        "bookmark"
      ],
      "title": "Permalink to ReplikaAI",
      "text": "ReplikaAI"
    },
    "https://www.wired.com/story/replika-open-source/": {
      "rels": [
        "noopener",
        "noreferrer"
      ],
      "text": "this Wired article"
    },
    "https://www.nitinkhanna.com/category/philosophy/observations/": {
      "rels": [
        "category",
        "tag"
      ],
      "text": "observations"
    },
    "https://www.nitinkhanna.com/lovely-tree-on-our-usual-walk/": {
      "rels": [
        "bookmark"
      ],
      "title": "Permalink to Lovely tree on our usual walk",
      "text": "Lovely tree on our usual walk"
    },
    "https://www.nitinkhanna.com/finished-reading-earthlings-by-sayaka-murata/": {
      "rels": [
        "bookmark"
      ],
      "title": "Permalink to Finished reading Earthlings by Sayaka Murata",
      "text": "Finished reading Earthlings by Sayaka Murata"
    },
    "https://www.nitinkhanna.com/category/reviews/": {
      "rels": [
        "category",
        "tag"
      ],
      "text": "Reviews"
    },
    "https://www.nitinkhanna.com/colin-devroe-asks/": {
      "rels": [
        "bookmark"
      ],
      "title": "Permalink to Colin Devroe asks",
      "text": "Colin Devroe asks"
    },
    "http://independentpublisher.me/": {
      "rels": [
        "designer"
      ],
      "title": "Independent Publisher: A beautiful reader-focused WordPress theme, for you.",
      "text": "Independent Publisher"
    },
    "https://wordpress.org/": {
      "rels": [
        "generator"
      ],
      "title": "WordPress: A free open-source publishing platform",
      "text": "WordPress"
    },
    "https://www.nitinkhanna.com/wp-content/plugins/jetpack/_inc/blocks/story/view.css?minify=false&ver=11.7": {
      "rels": [
        "stylesheet"
      ],
      "media": "all",
      "type": "text/css"
    }
  }
}