{
  "items": [
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "published": [
          "Saturday, January 14, 2023"
        ],
        "name": [
          "Saturday, January 14, 2023\n        \n       \n      \n        \n          In a few days, I’ll hit my one-month mark on the piano. When I bought it and began playing, I made sure to keep an open mind about how I learn best; not following any particular method, but tailoring practices to my interests, speed, challenges, and desires.\n\nOne learning strategy that always works best for me is a top-down approach. With the piano, there’s great benefit in playing music from sheets (of which I’m capable), but I could tell something had been missing. This morning, as I woke early once again, this time at 03:20 a.m., I realized the missing part was an overview of which chords work in a particular key.\n\nThis morning over coffee at my favorite spot, I did some digging and found Piano-Music-Theory.com, which has a wonderful series on diatonic chords. If you’re not familiar, these are chords belonging to notes that make up a particular scale. Knowing the diatonic chords of each scale is going to benefit my flexibility on the piano, because I’ll be able to play songs in whichever key I need.\n\nAs I was drawing up a matrix of what I was learning, I remembered how special music theory really is. I love its intricacy and depth, and how it manages to capture one of life’s most extraordinary things: combinations of sounds that can tell a story."
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "published": [
          "Friday, January 13, 2023"
        ],
        "name": [
          "Friday, January 13, 2023\n        \n       \n      \n        \n          More than any other time in my online life am I aware of the value of alt text. I make a point to write image descriptions whenever I can. Kind strangers with a variety of accessibility needs have been helping me understand how to best capture my interpretation of an image. I’ve come to regard alt text as the secret side bar I get to have with blind people and others who need it.\n\nFor me, alt text raises interesting cultural questions, particularly around its growing visibility. Traditionally, it requires that people who don’t use accessibility tools hover an image to produce what I call “the world’s slowest tooltip”. In addition, I’ve been seeing a growing number of people work alt text into places where it doesn’t exist. Places that don’t require a hover. Two examples of this are Mastodon’s profile and banner images.\n\nA few weeks ago, I saw the profile picture of a young woman winking. Her bio captured the image with something along the lines of “young woman looking seductively at the camera, winking, and slightly sticking out her tongue hoping to engage the viewer”. Before reading that text I felt engaged indeed, my mind painting a quick image of what her manic pixie dream girl university campus life would be like.\n\nReading her description of the image had an effect. I gather it was the overtness — her self-awareness about what the image could convey — that somehow put me off just slightly. The image and not so much her description of it but the very fact that I could even see that description, and that she understood I would, changed how I saw her in the image. It also changed how I see the Internet.\n\nWhat does it mean, I’ve been thinking ever since, that people with no need for alt text get to peek behind its curtain? What effect can this form of double meaning-making have? Does it mean we’ll eventually go on to describe images differently, knowing that not a portion of our audience but the entirety of it is looking on? Does it mean we may, some day, try to say less with imagery? In one way, I’d consider that reduction of fluff a triumph for accessibility.\n\nToday, Piper Haywood’s blog put me onto a handy alt text decision tree. I’m entirely surprised to read that the answer to the final question in the tree, “Is the image purely decorative or not intended for the user?”, is “use an empty alt” and not “don’t post the image”.\n\nI guess that paints the best picture of how much of a reductionist I am."
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "published": [
          "Thursday, January 12, 2023"
        ],
        "name": [
          "Thursday, January 12, 2023\n        \n       \n      \n        \n          Have you heard? Anja and I are getting a dog. It was up in the air for a little while, but we got the confirmation yesterday that we’ll get first pick of a nest of eight adorable little Pembroke - Cardigan corgi mixes. We’re meeting the puppies for the first time on Sunday. Are you crying? I’m crying.\n\n2022 showed me that there are serious drawbacks to being an A type personality. The way it helps Anja and I prepare for a puppy isn’t one of them. Too excited to sleep, I now wake at 04:15 to formulate schedules, training OKRs, and crate strategies.\n\nAnnoyingly, I’ve now become one of those people who thinks they know a minuscule sliver of the dread expecting parents must feel, aiming to read all of the world’s parenting books before retiring on the idea that, at the end of the day, it’s all about intuition and consistency."
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "published": [
          "Wednesday, January 11, 2023"
        ],
        "name": [
          "Wednesday, January 11, 2023\n        \n       \n      \n        \n          In one of the many jubilant reviews garnered by Darren Aronofsky’s latest film The Whale, one writer concluded that we shouldn’t judge a book by its cover. This was in reference to the morbidly obese main character who eventually dies, but not before we find out he developed an eating disorder out of grief. Here was a fat man who evidently had feelings despite his exterior. Ironically, I find myself doing just what the writer suggested I don’t: judge the film before I’ve seen it.\n\nAs a fat person, I’m surprised to have forgotten some of the tropes society has formulated about bodies like mine. It might be the time I’ve spent recovering from an eating disorder, my underuse of popular (and harmful) social media, or my Blur It Out browser extension, but I apparently had been living in a kinder world. Everything about The Whale puts a damper on that experience.\n\nMany may marvel at Brendan Fraser’s stellar performance, I see a minstrelsy of fatness. While undoubtedly not its primary purpose, The Whale reminds fat people that life is absolutely different for people who are not like us. Non-fat people can use the film to reconcile with fatness, to see the humanity behind the physical. Fat people can get reacquainted with how they’re supposed to see themselves, employing The Whale for scale."
        ]
      }
    }
  ],
  "rels": {
    "canonical": [
      "https://www.zinzy.website/"
    ],
    "author": [
      "https://www.zinzy.website/humans.txt"
    ],
    "icon": [
      "https://www.zinzy.website/assets/img/android-chrome-512x512.png",
      "https://www.zinzy.website/assets/img/favicon-32x32.png",
      "https://www.zinzy.website/assets/img/favicon-16x16.png"
    ],
    "apple-touch-icon": [
      "https://www.zinzy.website/assets/img/apple-touch-icon.png"
    ],
    "manifest": [
      "https://www.zinzy.website/assets/img/site.webmanifest"
    ],
    "stylesheet": [
      "https://www.zinzy.website/styles.css"
    ],
    "alternate": [
      "https://www.zinzy.website/feed.xml"
    ],
    "me": [
      "https://github.com/zinzy",
      "https://tech.lgbt/@zinzy",
      "https://twitter.com/zinzywaleson",
      "mailto:zinzy@pm.me"
    ],
    "authorization_endpoint": [
      "https://indieauth.com/auth"
    ],
    "token_endpoint": [
      "https://tokens.indieauth.com/token"
    ],
    "microsub": [
      "https://aperture.p3k.io/microsub/596"
    ],
    "micropub": [
      "https://zinzy.website/micropub/main"
    ],
    "webmention": [
      "https://webmention.io/www.zinzy.website/webmention"
    ],
    "pingback": [
      "https://webmention.io/www.zinzy.website/xmlrpc"
    ]
  },
  "rel-urls": {
    "https://www.zinzy.website/": {
      "rels": [
        "canonical"
      ]
    },
    "https://www.zinzy.website/humans.txt": {
      "rels": [
        "author"
      ]
    },
    "https://www.zinzy.website/assets/img/android-chrome-512x512.png": {
      "rels": [
        "icon"
      ],
      "type": "image/png"
    },
    "https://www.zinzy.website/assets/img/apple-touch-icon.png": {
      "rels": [
        "apple-touch-icon"
      ]
    },
    "https://www.zinzy.website/assets/img/favicon-32x32.png": {
      "rels": [
        "icon"
      ],
      "type": "image/png"
    },
    "https://www.zinzy.website/assets/img/favicon-16x16.png": {
      "rels": [
        "icon"
      ],
      "type": "image/png"
    },
    "https://www.zinzy.website/assets/img/site.webmanifest": {
      "rels": [
        "manifest"
      ]
    },
    "https://www.zinzy.website/styles.css": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://www.zinzy.website/feed.xml": {
      "rels": [
        "alternate"
      ],
      "title": "RSS",
      "type": "application/rss+xml"
    },
    "https://github.com/zinzy": {
      "rels": [
        "me"
      ]
    },
    "https://tech.lgbt/@zinzy": {
      "rels": [
        "me"
      ]
    },
    "https://twitter.com/zinzywaleson": {
      "rels": [
        "me"
      ]
    },
    "mailto:zinzy@pm.me": {
      "rels": [
        "me"
      ]
    },
    "https://indieauth.com/auth": {
      "rels": [
        "authorization_endpoint"
      ]
    },
    "https://tokens.indieauth.com/token": {
      "rels": [
        "token_endpoint"
      ]
    },
    "https://aperture.p3k.io/microsub/596": {
      "rels": [
        "microsub"
      ]
    },
    "https://zinzy.website/micropub/main": {
      "rels": [
        "micropub"
      ]
    },
    "https://webmention.io/www.zinzy.website/webmention": {
      "rels": [
        "webmention"
      ]
    },
    "https://webmention.io/www.zinzy.website/xmlrpc": {
      "rels": [
        "pingback"
      ]
    }
  }
}