{
  "items": [
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "published": [
          "Tuesday, January 17, 2023"
        ],
        "name": [
          "Tuesday, January 17, 2023\n        \n       \n      \n        \n          Sometimes, when bad news arrives, I think to myself “argh, just when I was beginning to think life was nice and steady!” Today is one of those days. I’m immediately thrown off, though mostly by the scenarios playing out in my head. Not because of the particular fact of which I learn.\n\nI’m disappointed by the rediscovery of life’s unsteadiness. At the same time, there’s beauty to be found. After all, there have been times in my life when I’ve been so anxious that bad news wasn’t an interruption, but a confirmation of what I already thought I knew.\n\nToday, a cloud blocks the sun. I remind myself that it’s a whole lot better than rain all year round."
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "published": [
          "Monday, January 16, 2023"
        ],
        "name": [
          "Monday, January 16, 2023\n        \n       \n      \n        \n          As I already mentioned earlier today on Mastodon, one of my favorite things about design work is getting to help other designers solve their own problems.\n\nAs one of the designers on my team and I were discussing how to leverage research to benefit stakeholder relationships, I saw a light switch on in her head that I think we’d have trouble turning off if we even wanted to. It’s so satisfying to see that happen, simply by mentioning a framework, sharing a bit of background on a particular research method, or on strategizing research within a product development process.\n\nComing back from product management into design management lets me focus wholeheartedly on this part of my skillset. I’m still not fully back at work (doing five hours a day now), but with encounters like this I’m beginning to feel more and more a part of the team again.\n\nAnd I wouldn’t want it any other way."
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "published": [
          "Sunday, January 15, 2023"
        ],
        "name": [
          "Sunday, January 15, 2023\n        \n       \n      \n        \n          \n    \n        I'm a person looking down lovingly at the two-week old sleeping corgi pup in my arms. I'm wearing a black vest and marbeled glasses and have a curly buzzcut. The puppy is white and dark brown. She rests in my hand on her back, her white paws sticking out.\n    \n    \n        Close-up of the puppy sleeping in my hands. I hold her up for the picture.\n    \n\nAmong a nest of eight, this little corgi pup immediately stood out because of her deep gaze, friendly cuddles, and millions of kisses. I think we might have found our girl."
        ]
      }
    },
    {
      "type": [
        "h-entry"
      ],
      "properties": {
        "published": [
          "Saturday, January 14, 2023"
        ],
        "name": [
          "Saturday, January 14, 2023\n        \n       \n      \n        \n          In a few days, I’ll hit my one-month mark on the piano. When I bought it and began playing, I made sure to keep an open mind about how I learn best; not following any particular method, but tailoring practices to my interests, speed, challenges, and desires.\n\nOne learning strategy that always works best for me is a top-down approach. With the piano, there’s great benefit in playing music from sheets (of which I’m capable), but I could tell something had been missing. This morning, as I woke early once again, this time at 03:20 a.m., I realized the missing part was an overview of which chords work in a particular key.\n\nThis morning over coffee at my favorite spot, I did some digging and found Piano-Music-Theory.com, which has a wonderful series on diatonic chords. If you’re not familiar, these are chords belonging to notes that make up a particular scale. Knowing the diatonic chords of each scale is going to benefit my flexibility on the piano, because I’ll be able to play songs in whichever key I need.\n\nAs I was drawing up a matrix of what I was learning, I remembered how special music theory really is. I love its intricacy and depth, and how it manages to capture one of life’s most extraordinary things: combinations of sounds that can tell a story."
        ]
      }
    }
  ],
  "rels": {
    "canonical": [
      "https://www.zinzy.website/"
    ],
    "author": [
      "https://www.zinzy.website/humans.txt"
    ],
    "icon": [
      "https://www.zinzy.website/assets/img/android-chrome-512x512.png",
      "https://www.zinzy.website/assets/img/favicon-32x32.png",
      "https://www.zinzy.website/assets/img/favicon-16x16.png"
    ],
    "apple-touch-icon": [
      "https://www.zinzy.website/assets/img/apple-touch-icon.png"
    ],
    "manifest": [
      "https://www.zinzy.website/assets/img/site.webmanifest"
    ],
    "stylesheet": [
      "https://www.zinzy.website/styles.css"
    ],
    "alternate": [
      "https://www.zinzy.website/feed.xml"
    ],
    "me": [
      "https://github.com/zinzy",
      "https://tech.lgbt/@zinzy",
      "https://twitter.com/zinzywaleson",
      "mailto:zinzy@pm.me"
    ],
    "authorization_endpoint": [
      "https://indieauth.com/auth"
    ],
    "token_endpoint": [
      "https://tokens.indieauth.com/token"
    ],
    "microsub": [
      "https://aperture.p3k.io/microsub/596"
    ],
    "micropub": [
      "https://zinzy.website/micropub/main"
    ],
    "webmention": [
      "https://webmention.io/www.zinzy.website/webmention"
    ],
    "pingback": [
      "https://webmention.io/www.zinzy.website/xmlrpc"
    ]
  },
  "rel-urls": {
    "https://www.zinzy.website/": {
      "rels": [
        "canonical"
      ]
    },
    "https://www.zinzy.website/humans.txt": {
      "rels": [
        "author"
      ]
    },
    "https://www.zinzy.website/assets/img/android-chrome-512x512.png": {
      "rels": [
        "icon"
      ],
      "type": "image/png"
    },
    "https://www.zinzy.website/assets/img/apple-touch-icon.png": {
      "rels": [
        "apple-touch-icon"
      ]
    },
    "https://www.zinzy.website/assets/img/favicon-32x32.png": {
      "rels": [
        "icon"
      ],
      "type": "image/png"
    },
    "https://www.zinzy.website/assets/img/favicon-16x16.png": {
      "rels": [
        "icon"
      ],
      "type": "image/png"
    },
    "https://www.zinzy.website/assets/img/site.webmanifest": {
      "rels": [
        "manifest"
      ]
    },
    "https://www.zinzy.website/styles.css": {
      "rels": [
        "stylesheet"
      ]
    },
    "https://www.zinzy.website/feed.xml": {
      "rels": [
        "alternate"
      ],
      "title": "RSS",
      "type": "application/rss+xml"
    },
    "https://github.com/zinzy": {
      "rels": [
        "me"
      ]
    },
    "https://tech.lgbt/@zinzy": {
      "rels": [
        "me"
      ]
    },
    "https://twitter.com/zinzywaleson": {
      "rels": [
        "me"
      ]
    },
    "mailto:zinzy@pm.me": {
      "rels": [
        "me"
      ]
    },
    "https://indieauth.com/auth": {
      "rels": [
        "authorization_endpoint"
      ]
    },
    "https://tokens.indieauth.com/token": {
      "rels": [
        "token_endpoint"
      ]
    },
    "https://aperture.p3k.io/microsub/596": {
      "rels": [
        "microsub"
      ]
    },
    "https://zinzy.website/micropub/main": {
      "rels": [
        "micropub"
      ]
    },
    "https://webmention.io/www.zinzy.website/webmention": {
      "rels": [
        "webmention"
      ]
    },
    "https://webmention.io/www.zinzy.website/xmlrpc": {
      "rels": [
        "pingback"
      ]
    }
  }
}